["\n\r\n\t\t\t\t2,123 people found this review helpful51 people found this review funny\t\t\t\t34\n\n\n\n\n\n\nRecommended\n1,139.3 hrs on record\n\n\n\n\nPosted: 12 June, 2018\nMy ImpressionIt's hard to write a proper review for this ever-changing, continually evolving game, but at its heart, it will always remain Space Ninjas with Magic... and weapons... tons of weapons.SummaryWarframe easily has enough content to fill up the space of steam reviews..., but let's make it short here:  Positive Mediocre Negative   + perfectly executed F2P ~ misleading store layout     + amazing sidequests ~ main storyline is very slow     ~ overwhelming content - subpar new player experience   + different planets ~ unvaried tilesets    + loveable and hateable characters ~ some could use more voice lines    + pure fun horde-slaying     + lots of different frames(builds) ~ some balancing problems    + different build for different mission type philosophy     + have I mentioned tons of weapons? ~ some are just bad    + diverse mission types      ~ quite a few bugs - some make you lose mission progress   + tons of things to do ~ quite repetitive - lacking endgame   + impressive style and execution     + cool sounds   The GuideSoo, due to the steam restriction on the character limit for reviews, I will be putting the following points into a Guide: Free to play - why this game has a great monetization model and you don't have to worry about being ripped off.The Story - yes this game has a story, one which will entertain you for quite some time, combined with all the 'character quests'The Star Chart - or The World of this game and what to expect of itThe Factions - and the characters which inhibit this galaxyThe Gameplay - which is obviously the most important part here and reasons you will sink hours on hours of your life into this gameThe Visuals - the beauty this work of art isThe Sound - and how far you can take itIf that is too much reading for you, go ahead and finish this off with my personal verdict and then form your own opinion.https://steamcommunity.com/sharedfiles/filedetails/?id=1409926603The VerdictIf you get through the harsh beginning, where you will lack a guiding hand this game will suck you in.Once the game catches you into its flow of daily activities like the login reward and the sorties - 3 mission endgame action - and keeps you there with hourly temptations like alerts and new void rifts, you will become lost in space and time will just fly by.Warframe is not without flaws, but it is steadily being worked on and being improved, the devs neither lack creativity nor daring, to try new things.Although it's easy to forget - this game doesn't cost you any cash, so just give it some time and see what it can give you back.NoteIf you have read this far - thank you.I hope this review helped you in deciding to give this game a try and if you like it, I would be grateful for a 'thumbs up', if you didn't like it, you can give me a 'thumbs down' but I would be glad to hear your opinion on what you didn't like.\t\t\t\n", "\n\r\n\t\t\t\t1,238 people found this review helpful47 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n610.9 hrs on record\n\n\n\n\nPosted: 11 October, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you're here at the crossroads asking yourself \"Destiny 2 or Warframe?\" - then perhaps this review might clear a few things up for you!To start with I have around 190 hours at the time of writing review and I approximately started playing Warframe around 3 weeks ago. I initially was looking for a game to keep me occupied whilst waiting for the Destiny 2 PC release.Now I played Destiny 1 non-stop, I mean I grinded that game so hard for 4 months, achieved absolutely everything possible, obtained everything and then never touched it again. Don't get me wrong, I LOVED those 4 months. But this isn't a review about Destiny, but rather about Warframe... And man is it a good game!Warframe at times can feel a bit overwhelming, there certainly isn't  the type of hand-holding that Bungie provide you with in Destiny. Whilst this hand holding can seem helpful at the start, it soon turns into a glass ceiling. Forcing you to go in a particular direction or playstyle - there is non of this in Warframe. In Warframe the universe is an open book and you approach it however you would like. There is a general linear progression to the missions, you unlock one planet move onto a next and so on, but warframe really lets you choose how you tackle this. The weapon system in Warframe is a prime example of how open it is: You can pick a starter gun, and because of 100's of mods available, this starter weapon can still kick a** in mid to end game! Every Primary, secondary and melee weapon feels unique and there are so many ways to alter these weapons: Want a machine gun that sets enemies alight? No problem, just add a Fire Mod! Want a bow that fires 2 arrows instead of 1? No problem, add a multi-shot mod! Want both of those? No problem, add both mods!That's just the weapons, wait till you try the warframes! There are about 30 or so different warframes (basically characters) and each has 4 unique abilities. Each warframe is suited to a particular purpose: You like to control the sea and summon a Kraken to throw enemies about? Hydroid's your guy! You like to set every enemy on fire and watch the world burn? Ember's who you're after! Want to heal the rest of your teammates and be the lifeline of the team? Trinity is here! And guess what? Yepp, you can mod these just like you mod the weapons: Want more shield on your tanky Rhino warframe? No problem, we got that! Want more energy to keep using your abilities? Eyyy yepp that too! And that's just 2 examples out of hundreds!Companions I heard you say? Oh yeah well in Destiny you have a futuristic rubix cube who attempts to make jokes. Whilst in Warframe you have about 6 different companions, 4 war wolves, some cat/fox breed and an epic looking alien bull! All of which have their unique abilities and purpose... And yes you guessed it: You can also mod them!Next is customisation... Now wow oh wow is this impressive. Warframe lets you customise pretty much about everything. On a warframe you can add skins, you can add armor pieces, you can add sigils (tattoo type things), you can add capes, you can change helmet style and you can change the colour of every single one of these pieces and aspects. The same goes for your companions and weapons. Also you can customise the colour and skin of your ship, you can even change the colour of the walls inside your ship! There's ALOT to customise in this game, it's quite impressive.Now at this stage you're probably saying: \"Yeah well I heard you gotta buy in-game currency to get access to this awesome stuff.\" Incorrect! Warframe has a whole in-game market/trading system that often fuels the crafting system. Meaning that you can sell the drops you get from certain missions to other players for the in-game currency. Or you can keep it for yourself and once you've got all the bits you can craft it! Either way you will eventually earn platinum and be able to buy the epic stuff you wanted.Lastly, the community. This is perhaps one of the nicest and most pleasant social aspects of Warframe. The community is so close, kind and caring. People have always helped me and some even gave me free stuff! This really is unique in an online game and boy is it nice to see.All in all, I came to Warframe to keep me occupied and now I'm hooked. I STRONGLY recommend you try Warframe, you will not be disappointed. Great work DE!* EDIT 1: Thank you all for your thumbs up, feedback and comments! I'll do my best to answer a few valid points that I've seen come up in the past week or in the comments.1) \"Certain Warframes are OP\" - Well Yes and No, I don't think the term over-powered can be used here. I think certain Warframes are more USEFUL than others, but then again that will entirely depend on what mission or purpose you are doing. For example: Sure I can run through a difficult Spy mission with Ember (an incredibly offensive fire based Warframe) but I will have an easier and smoother time tackling it with Ash (a stealthy, silent, single target based Warframe).It's also important to remember that a Warframe, weapon or even companion is only as powerful as the mods you put on it. Meaning that you can completely transform a warframe from something \"meh\" to something godly just by using the right mods, and good ones too! But remember, the better the mods, the harder they are to find / more expensive they are to buy with plat!2) \"The graphics are horrible\" - I'm going to use World of Warcraft to demonstrate my point here (I'm sure there are many other examples, but WoW is the one I can think of right now!): - World of Warcraft is a long-running game and like in Warframe, the often beginner areas (which were created right at the start of the game) look barren and terrible. This is somewhat true about the first few planets in Warframe, certain areas at the start look lifeless and without depth BUT as you progress, the planets become more detailed and graphically nicer.Furthermore, recently DE just remastered Earth (the first planet) and it looks MUCH nicer! So be patient, DE definitely know that certain areas look crud and they are working on it I'm sure! I expect more planets will get a make-over just like Earth in the near future.3) \"Plains of Eidolon is boring and filled with bugs \" - Okay sure, Plains of Eidolon (the newest, semi-open world area) is not entirely what we expected but think of this: This is the first time DE have attempted anything like it, they clearly said prior to the release that they were expecting feedback and will continue to add more content to PoE. They are a small studio and don't necessarily have the resources that large studios like Blizzard or Activision might have. Give them time, give them feedback and be patient. I am almost certain that in the coming weeks DE will be adding more content and tweaking the existing stuff to make it smooth and enjoyable.Also, Plains of Eidolon is not meant to be the bulk of the game, there are still many other planets and things to do! It's just a new area in an existing planet. Everyone chill and give DE some room to breathe and work things out, they have in the past and they will do so now too.Thanks again all!\t\t\t\n", "\n\r\n\t\t\t\t4,440 people found this review helpful191 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n615.4 hrs on record\n\n\n\n\nPosted: 21 November, 2014\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis story requires a bit of setup.Last year, a friend of mine whom I'd known from gaming for a long time contacted me and told me about this great new game that was in beta that he was backing as a founder (called a \"Grandmaster\" in-game) called Warframe. A third person cooperative shooter with elements of Phantasy Star Online/Diablo loot runs, procedurally generated levels, and more content being added all the time. The game was difficult to start, as there are many keys for various secret parkour maneuvers. Running along walls! Sliding down ziplines! Soon, I was completely hooked; my friend and I were playing late into the night, trying to grind out just one more piece necessary to build a new component or weapon, or trying to beat our best time on the Survival missions -- where you fend off an ever growing wave of foes as life support ticks down. Over the year, there were many great victories, hair raising last second escapes, and new friends joining our little group. Many hours were spent joking around with each other on Skype, cracking jokes, blasting weird songs at each other, and coming up with our own stupid little catchphrases.Flash forward a year; Warframe now has space combat, new Warframes, new weapons, and new combat controls. The game still has its original style, but it's so much improved. Last week, our four player regular team developed some incredible strategies that let us get further than we ever had on wave defense missions. The only thing that made us stop was getting tired.On Tuesday, my friend who invited me to the game a year ago didn't show up that night. I found out on Wednesday that he had passed away suddenly from an undiagnosed health condition. The shock of it is still hitting us hard. The friendships that we had formed through the game, gone in an instant. It hardly feels real. I keep expecting him to log in and be there, ready to do another defense mission, and it's difficult to accept that we'll be going it alone now.We contacted Digital Extremes, the company that makes the game, and asked if there was anything we could do. They dedicated their 11/20/2014 episode of their webcast to the memory of our friend and read our memorials to him on the air. Their reactions were heartfelt and touching. They really do listen to and react to the community.I not only recommend the game for how much fun it is (I recommend you play it with a group of friends on voice chat -- up to four per session; your gameplay experience may vary alone, and form a clan or join one just because many items are clan-only), I recommend it for how responsive the game developers are to the community. They constantly improve it and add new content, items, and weapons. There is a storyline that is unfolding. The voice acting is delightful. You could easily play this game without spending a single dollar of real world currency on it (real world currency is used for cosmetics and increasing the number of Warframes and weapons you can own, or buying things that you can't wait for).Thanks, Digital Extremes. And rest in peace, Woxit.\t\t\t\n", "\n\r\n\t\t\t\t439 people found this review helpful205 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n1,356.9 hrs on record\n\n\n\n\nPosted: 28 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDealing 5 billion damage to a 100 health points enemy is crucial for the plot, trust me\t\t\t\n", "\n\r\n\t\t\t\t303 people found this review helpful55 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n522.7 hrs on record\n\n\n\n\nPosted: 22 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbest way to play this game w/o burning out. Play the game, quit for a few years, come back and learn everything again.\t\t\t\n", "\n\r\n\t\t\t\t404 people found this review helpful235 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n3,159.5 hrs on record\n\n\n\n\nPosted: 8 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWelcome to Warframe. Play the same mission 231 times for the peepeepoopoo blueprint.\t\t\t\n", "\n\r\n\t\t\t\t316 people found this review helpful4 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n92.9 hrs on record\n\n\n\n\nPosted: 4 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOnce Cross save is available, I will start playing this game again. until then, ill just say i had a great time playing it on console.\t\t\t\n", "\n\r\n\t\t\t\t339 people found this review helpful127 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n785.4 hrs on record\n\n\n\n\nPosted: 7 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t700+ Hours and I still have no idea what I'm doing. 10/10.\t\t\t\n", "\n\r\n\t\t\t\t329 people found this review helpful14 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n3.2 hrs on record\n\n\n\n\nPosted: 8 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'm waiting for Cross-save to happen.\t\t\t\n", "\n\r\n\t\t\t\t312 people found this review helpful22 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n940.4 hrs on record\n\n\n\n\nPosted: 30 August, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFirst, good things about Warframe:This game has spoiled me. I will no longer accept anything less than this from any game developer. Be it AAA or indie.This game is free. Get it? Free. You are not required to spend a single penny in order to experience the full content of the game. All characters, quests and environments are fully disclosed to you on their due time. That being said, I HAVE spent money on this. Why? Cosmetics of course. Fashion is endgame you know?Now, just what is Warframe? Warframe is a mostly PVE third person shooter action game with parkour elements flawlessly integrated into the gameplay. You have seen games do parkour before of course, but these are space ninjas we're talking about, which means you can basically fly around the stage at high speed while letting loose a torrent of bullets, rockets and/or high-energy plasma, or just take out your trusty sword/hammer/fists and cripple anything in your path.What will you face? Humanoids, robots, aliens, you name it. Yes, there are bosses, and they can and will kick your butt.What will you face them with? Hundreds, and I mean HUNDREDS of weapons to choose from. Each of them unique in its own way, and deeply customizable to suit your needs and/or taste. You can carry three of them at a time. A primary weapon (bow, rifle, etc), a secondary weapon (pistol, throwing knives, and... other things), and of course a melee weapon.Now, you can always tear through the game solo, but, for the best experience, the game pairs you with up to three other players in missions ranging from a stealthy rescue in the overgrown jungles of Earth, to an all-out extermination in the frozen wastelands of Pluto.But doing missions is just one part of it, you also have a widely explorable open-world area, with its own assortment of missions waiting for you. And this open-world thing is only going get bigger in future updates. Oh and the updates, they are a regular thing. Like, every other day.Now what's the story? Can't tell you. Its a secret. No, really, the game community is super protective of the game lore. There is a certain point in the game where you will KNOW, and then we can talk about it, but until then, you gotta find out for yourself. For now just consider yourself a space ninja.How about difficulty? Scales up with your level, just like most modern mmos. The game will be just as hard as you want to handle. If you want to go at it casually, there's content for you. If you're looking for a challenge, good news, the enemy level can scale up almost infinitely.------------------------------------Now, bad things about warframe:-PVP sucks-Grinding, lots of grinding.-There are some cool aspects of the game that are seemingly abandoned and/or have been in development hell for ages.-Your inventory slots are limited, and you can buy more by using the premium currency. While technically you do not need to buy more slots, since you can simply sell what you don't need or want, it is a huge temptation and it is the most likely reason why you will buy platinum, if you ever do.------------------------------------About grinding. This is both a good and bad thing about the game. Most will consider grinding a bad thing but here it's a little diferent. In Warframe, the grind is integratd into the core objective of the game. Grinding is what you do to pass the time. It is so integrated into the game world that you don't really notice it. So yeah, there is a lot of grinding, but you have fun while doing it.------------------------------------Final thoughts.Now, I'm not saying warframe should be game of the year or anything (more like game of the decade), but the level of attention and communication that Digital Extremes (the game devs) has with the warframe community and the display of love for their own game is absolutely marvelous. These people are setting a new standard for the gaming industry, and I can only see good things in the future for them.In conclusion, we don't deserve Warframe.Also, you can have a space dog/cat, and PET THEM. 10/10*EDIT: Grammar*\t\t\t\n"]