["\n\r\n\t\t\t\t1,990 people found this review helpful483 people found this review funny\t\t\t\t119\n\n\n\n\n\n\nRecommended\n135.2 hrs on record\n\n\n\n\nPosted: 16 January, 2014\nEarly Access Review\r\n\t\t\t\t\t\t\t\tSo I started playing 'Rust' at 4pm yesterday.Within 3 minutes of my first time playing, a bear ate me. Then I watched two other players club each other to death with large stones, while completely naked, penises (penii?) dangling in the wind. Having managed to slay a small pig, I fashioned some clothes to cover my genitals, then went exploring.Ate some uncooked meat and threw up all over the place. Made a small fire to cook the rest of my meat. Fashioned a bow and arrow out of some wood I collected, also a shirt and a pair of boots. Went about fashioning a small shelter out of some random crap laying around so I wouldn't have to sleep outdoors. I could have chosen from one of the many, many, ramshackle structures dotting the landscape. But those may or may not belong to/contain other players. Who may or may not be armed or clothed. I just wanted to peacefully live alone, so I stuck to the wilderness.I slipped off a cliff and broke both my legs. I shouted out to anyone who would listen, asking what to do to fix my broken legs, I didn't understand the game and I needed help. A naked man came over, typed '??? i help' in response to my pleas, then bashed my head in with a rock and presumably looted my corpse.Then I starved to death when I forgot to eat. Out of desperation I butchered a wolf that attacked me instead of running away, but didnt have time to cook so I ate raw meat again. Nope. Instead of just starving to death, I vomited, then starved to death.Its now 7:25 am and many adventures later, I've decided to sleep in a small shack I made myself in the mountains. Don't dare risk making a fire, someone might see it at night and kill me for the tin of baked beans I got off a zombie I found wandering around a town that gave me radiation poisoning. Oh yeah, I'll probably die slowly because of the radiation, but thats a problem for later-me.In a tiny hut on a mountain with my sleeping bag and meager belongings after 12 hours of playing straight, I can probably safely say I'm enjoying this game.\t\t\t\n", "\n\r\n\t\t\t\t1,010 people found this review helpful617 people found this review funny\t\t\t\t125\n\n\n\n\n\n\nRecommended\n2,598.7 hrs on record\n\n\n\n\nPosted: 5 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRust is a game. If you like...-Sleeping-Feeling happiness-Being intimate with women-Maintaining a relationship with your family-Breathing fresh air-Having friendsIt is not your game. \n", "\n\r\n\t\t\t\t963 people found this review helpful557 people found this review funny\t\t\t\t144\n\n\n\n\n\n\nRecommended\n538.7 hrs on record\n\n\n\n\nPosted: 4 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOnce upon a time in Rust, in less cringy format, recollected to the best of my memory.Together with the help of a random friend, I made a small, simple base and proceeded to work on gathering resources for I'd say about 20 hours, upgrading said base along the way as it was my intent to turn it into a farm.I was getting harrassed by a small group of people every now and then but they didn't seem really interested in raiding, just camping or taking whatever kits they could get from our exchanges.After a small conversation in outpost, I realized something very important about landmines, something that seemed very unused at the time.Out of spite from the exchanges that got nowhere, I decided to put all my efforts into crafting possibly over a hundred landmines, surrounding the area around the base with them. There were many bushes and grass around the area, making it easy to hide those mines.After that, I started armoring the base, changing specific stone walls to metal walls, and more important (and some fake) walls with high qual.A couple of hours later when working on furnaces I started hearing the sound of certain landmines popping, often chain detonating as one detonated the other. A couple more exchanges later and some kits I took and another group of people got entangled into the mess, a larger clan, which also ended up getting killed by the landmines, several times. The explosions and constant fights however, seemingly attracted more and more people, nakeds, smaller groups, duos and people trying to cash in by getting kills and kits from others.I had upgraded what I could, with whatever resources I had left. Occasionally using what kits I could salvage to do a little bit more shooting, but most of the time as a solo you're not getting anywhere when there's such a large amount of players expecting you. Wipe was almost at hand, so I didn't really mind.The honeycombed walls didn't last long, and it certainly wasn't longer until they got through to where they wanted. But even then, people still kept dying to more landmines. I had honestly lost count of how many I had placed around, of how many resources were used. But boy did I have a smile on my face, knowing that as soon as they got into the TC, there was really nothing I had in terms of resources other than a couple stacks of high qual and metal scrap. And I'm more than sure that the amount of gear lost to the landmines, as they destroy items in one's inventory if they die to one, was not worth what was found there.TL;DR I used every single resource gathered over a wipe to make a large amount of people most likely lose an enormous quantity of their work and resources for almost nothing.11/10 would do it again.Thank you, Rust.\t\t\t\n", "\n\r\n\t\t\t\t433 people found this review helpful202 people found this review funny\t\t\t\t41\n\n\n\n\n\n\nRecommended\n34.6 hrs on record\n\n\n\n\nPosted: 22 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA Random 14 year old russian kid was screaming the N word after i bombed his base,he also gave a detailed instruction on how to kill myself.very fun experience would definetly recommend\t\t\t\n", "\n\r\n\t\t\t\t579 people found this review helpful190 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n4,851.7 hrs on record\n\n\n\n\nPosted: 19 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit is a fun game but if you have a life dont get it \n", "\n\r\n\t\t\t\t672 people found this review helpful339 people found this review funny\t\t\t\t60\n\n\n\n\n\n\nRecommended\n6,476.7 hrs on record\n\n\n\n\nPosted: 2 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you like:Having friendsHaving a loving familyHaving a social lifeBeing healthyHaving a good sleep scheduleNot being racistThen this game is not for you\t\t\t\n", "\n\r\n\t\t\t\t623 people found this review helpful580 people found this review funny\t\t\t\t91\n\n\n\n\n\n\nRecommended\n1,895.3 hrs on record\n\n\n\n\nPosted: 24 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti woke up on the beach and saw a naked man hitting a naked woman in the face with a rock when i took a rock out and hit the man in the face with the rock and the man died and i went home and downloaded rust and did it again\t\t\t\n", "\n\r\n\t\t\t\t1,296 people found this review helpful1,500 people found this review funny\t\t\t\t338\n\n\n\n\n\n\nRecommended\n3,216.6 hrs on record\n\n\n\n\nPosted: 16 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t> wake up on the beach> wander> meet some guys dressed up in trash holding AK-47's>\"HEY YOU, NAKED\"> I come> \"Follow us, you're our prisoner now\"> They bring me to a base with a crudely drawn ISIS flag on it> They bring me into their base> \"SING FOR US\"> I don't say anything> \"well you're ♥♥♥♥♥♥♥ useless aren't you\"> \"bring him in to the thunderdome\">  waitwhat> they bring me into a prison with another naked> \"NOW FIGHT!\" > me and the naked fight intensely with rocks> I kill him, everyone is screaming \"ALLAHU AKBAR\" in bad middle-eastern accents> they bring me outside for a break> one ISIS member leaves the base, and i run outside while the door is open> being shot at by AK-47's while zigzagging> I escape the desertthen left Egypt, bought Rust and the same thing happened in Rust\t\t\t\n", "\n\r\n\t\t\t\t997 people found this review helpful788 people found this review funny\t\t\t\t68\n\n\n\n\n\n\nRecommended\n1,436.0 hrs on record\n\n\n\n\nPosted: 16 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLove this game, lost my gf, my job, my dignity but at least i have my rock\t\t\t\n", "\n\r\n\t\t\t\t552 people found this review helpful301 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n1,359.6 hrs on record\n\n\n\n\nPosted: 3 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti have 1000 hours on the game and i still dont know what im doing\t\t\t\n"]