["\n\r\n\t\t\t\t2,027 people found this review helpful442 people found this review funny\t\t\t\t52\n\n\n\n\n\n\nRecommended\n89.5 hrs on record\n\n\n\n\nPosted: 20 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsomething about this game tells me this \"megacorporations\" thing might be a little bad\t\t\t\n", "\n\r\n\t\t\t\t3,453 people found this review helpful1,283 people found this review funny\t\t\t\t342\n\n\n\n\n\n\nRecommended\n55.5 hrs on record\n\n\n\n\nPosted: 25 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWake up, Samurai. We're out of Early Access.⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠛⠛⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠁⠄⠄⠄⠄⠈⠄⠈⠙⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣟⠄⠄⣠⣶⣷⣦⣠⡄⠄⠄⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡻⠟⠄⢰⣿⣿⣿⣿⣿⡿⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⢉⠁⠄⠚⠙⠻⢿⢿⣿⡀⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣃⠆⠄⠄⠄⠄⢀⡆⠄⠄⠄⠄⠠⠳⠃⡏⠈⢙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠯⠄⠓⣤⣦⡶⢿⠇⠄⠄⠄⠄⠄⡄⡜⠄⠄⠌⡫⣿⣿⣿⣿⣿⣿⣿⣿⣿⡣⠁⠄⠄⠋⣤⣄⡀⠄⠄⠄⠄⠄⠄⢣⢍⠄⠄⠄⠆⣿⣿⣿⣿⣿⠛⠛⠉⠙⢂⣠⡖⡀⠄⠓⠄⠄⠄⠄⠄⠄⢐⣾⣷⡀⠄⠄⠘⠄⣿⣿⣿⣿⣿⠄⠄⠄⠄⣿⣿⣿⣿⡝⡄⠄⠄⠄⠄⠄⠄⠄⠙⢿⣧⡀⠄⠄⢀⢿⣿⣿⣿⣿⡀⠄⠄⠄⢿⣿⣿⣿⣇⠁⣀⡀⠄⠄⠄⠄⠄⠄⠰⣿⡂⠄⠁⠄⠈⣿:\t\t\t\n", "\n\r\n\t\t\t\t5,230 people found this review helpful86 people found this review funny\t\t\t\t338\n\n\n\n\n\n\nRecommended\n127.0 hrs on record\n\n\n\n\nPosted: 16 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeen here since day 1, and I am someone who came from the PS4 version of the game. This has been quite the journey from its horrendous launch to where we are today. Ever since launch I have enjoyed the game, though I do acknowledge that it is completely unacceptable how this game launched, and no video game should launch how Cyberpunk 2077 did. I'd say that this game has been \"playable\" since its 1.3 updates, but it wasn't in a state where I could fully recommended this game to others due to it still being in a worst state than early day Skyrim or the likes. Now here we are, the 1.5 relaunch update has brought us the \"next gen\" update to the game. Whatever you want to actually call this update, it brings the soft overhaul to the game in terms of stability and actual feature and mechanics rebalance to make the game far better in its design, and thus making it feel better to play, along with its far improved stability. The game is now at a state where I could fully recommend it.The game is still far from being perfect, as certain play styles far outclass other play styles in terms of combat, especially melee combat, as its still pretty stiff and a bit of a button masher at times. Content still feels weirdly distributed around the map with some areas being far more dense in terms of content than others. Any other complaints I have would just be nitpicking at the game really. There is a lot to like about this game. The characters do feel genuine in who they are and what roles they play. The combat and stealth in most areas feels good or great mechanically and in execution. Traversing the world is never really a chore, given the amount of different vehicle types, the large number of fast travel locations, and general movement speed when on the ground thanks to the not terrible stamina amount you have along with the very basic parkour system you get access to. The decent variation in quests has a mix of combat, detective work, or even stealth retrieval, sometimes a multiple of styles. Depending on which skill tree you spec in, it actually changes a lot of how you approach each quest. You can go in stealthy, or go in guns blazing or fist swingin' if the quest allows for it. The driving was alright before the 1.5 update, but it is now incredible how much better it feels to control in the 1.5 update given the new types of driving options you have. There is a large variety of cars and motorbikes you can obtain too, and you don't even need to buy any to have good options. You can good a good selection of vehicles by just doing the main campaign.I really genuinely like this game, a lot. It is far from perfect, but it is really fun to play. If you were unsure about the game before, but were thinking about jumping in with this update coming out, you should play it. I highly recommend the game now. It is a lot of fun, and is now in a far more acceptable state now.\t\t\t\n", "\n\r\n\t\t\t\t1,255 people found this review helpful18 people found this review funny\t\t\t\t107\n\n\n\n\n\n\nRecommended\n170.9 hrs on record\n\n\n\n\nPosted: 19 November, 2023\n For me this is the end of the Night City story. I completed all the tasks, unlocked all the endings and completed the DLC. Honestly, I actually cried a lot in this game. haha. It was also fun, such a contrast in the game allowed us to move on, gave us hope for something good. But I can say that Cyberpunk 2077 will never end well. You have to make hard choices, but in the end you will still lose something.I fell in love with this game and would like to forget everything that happened in it, so that I could plunge into Night City again like the first time. \n", "\n\r\n\t\t\t\t1,403 people found this review helpful147 people found this review funny\t\t\t\t55\n\n\n\n\n\n\nRecommended\n228.7 hrs on record\n\n\n\n\nPosted: 14 September, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHad to replay this immediately to demolish Adam Smasher again\t\t\t\n", "\n\r\n\t\t\t\t1,800 people found this review helpful78 people found this review funny\t\t\t\t65\n\n\n\n\n\n\nRecommended\n184.5 hrs on record\n\n\n\n\nPosted: 19 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPatch 1.5 fixed everything for me. The quests make more sense. The fixers make more sense. The map and mini map make more sense.The driving is a lot more fun. Throwing knives and a katana were something I never knew I needed. The city feels a little bit more alive. The voice acting was always great, but now the npc facial expressions flow more with the dialogue. Like, Judy actually rolled her eyes at me in a believable way. Played for hours without having to reload or crash because of a glitch. It's all I want to play. It cured (replaced) my Skyrim addiction.\t\t\t\n", "\n\r\n\t\t\t\t6,590 people found this review helpful283 people found this review funny\t\t\t\t323\n\n\n\n\n\n\nRecommended\n113.7 hrs on record\n\n\n\n\nPosted: 21 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEarly Access release date: 10 Dec 2020Actually release date: 21 Sep 2023Complete edition release date: 26 Sep 2023Nice comeback CD PROJEKT RED, just please don't do like that again. Take your all time to make a full game and then release.\t\t\t\n", "\n\r\n\t\t\t\t2,323 people found this review helpful137 people found this review funny\t\t\t\t104\n\n\n\n\n\n\nRecommended\n98.6 hrs on record\n\n\n\n\nPosted: 30 October, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWatches Edgerunners -> Downloads Cyberpunk 2077-> has the time of his life\t\t\t\n", "\n\r\n\t\t\t\t488 people found this review helpful15 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n172.9 hrs on record\n\n\n\n\nPosted: 23 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe 2.0 patch is my first time playing the game. Leveling is really fun. No crashes, the gunplay feels good. Amazing graphics, and good music. Characters are likeable, the voice acting is great. Excellent story, sidequests, and gigs. The DLC (Phantom Liberty) was absolutely amazing as well. Johnny is one of the sweetest bada♥♥ you'll ever meet! :D This game is proof, that good things come to those who wait. Now, wake the f♥♥♥ up, Samurai! You have a game to play!\t\t\t\n", "\n\r\n\t\t\t\t6,185 people found this review helpful8,786 people found this review funny\t\t\t\t838\n\n\n\n\n\n\nRecommended\n71.5 hrs on record\n\n\n\n\nPosted: 24 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUnlike CDPR, I finished the game.\t\t\t\n"]