["\n\r\n\t\t\t\t1,194 people found this review helpful29 people found this review funny\t\t\t\t42\n\n\n\n\n\n\nRecommended\n944.8 hrs on record\n\n\n\n\nPosted: 1 October, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWith almost 300 hours of Destiny 2 (D2) back on Battle.net (the Blizzard launcher), let me give this perspective/advice for new players, specifically with regards for the F2P offering that is Destiny 2: New Light, with a few more holistic thoughts sprinkled throughout:This overall game is very good. It doesn't always live up to its promise (the first mission of every campaign is always the most polished thing aside from the raids/dungeons), but when it does, it really shines.The gunplay is unrivaled. The visual/audio feedback is great, the handling feels really good, and enemies really pop when you take them out. Expect nothing less from the studio that brought us grunt birthday parties.The game is better in a fireteam. Now that the base game is F2P [though with considerably less content than it used to be/I would like], this should be easier than ever for most activities. That said, a huge majority of my playtime was done solo. It can get tricky at times (\"Darkness Zones\" in certain missions prevent respawning but allow for revives, so solo players have a distinct disadvantage there). With that said, dungeons (currently 'The Shattered Throne', 'Pit of Heresy', 'Prophecy' which is free to all players, 'Grasp of Avarice', 'Duality', and 'Spire of the Watcher') and raids (\"Last Wish\" from Forsaken, \"Garden of Salvation\" from Shadowkeep, \"The Deep Stone Crypt\" from Beyond Light, 'Vow of the Disciple' from Witch Queen, as well as 'Vault of Glass' and 'King's Fall' from D1 - both of which are both free to all players) are best experienced with a team, so don't shy away from LFG group-finder options like the Discord, official app, or any number of other sites (just make sure to accurately describe your experience, level, and gear. 'Tis only polite). Of the matchmade multiplayer offerings, I enjoy Gambit (PvPvE, reminds me of the Black Ops Zombies 4z4 mode done right), jump into the occasional Strike (PvE, matchmade fireteams running campaign-like missions), and have no interest in Crucible (PvP, it's fine I guess, but I've never liked PvP that's dependent in large part on personal progression - especially in the competitive modes like Trials of Osiris and Iron Banner)Don't be afraid to ignore content - this is absolutely the kind of game where you can set your own goals. Want a specific exotic gun? Look up where it drops and focus on grinding that content. Want a specific roll on a random roll gun? Find the best possible farming (or crafting) method and go to town. Chase down some of the exotic questions that the game clutters up your quest page with, or just goof around doing things that you find fun while absolutely ignoring all signposts.Some stuff just won't be explained in game. It's not as bad as Warframe (much less need for a wiki) but some things are still obscured. Feel free to look up Xur (exotic weapon vendor who visits on weekends) and other hidden exotics tied to specific activities, lost sectors, patrol locations, or quest chains.For anything that you can't easily find online - reach out and find a sherpa. The community for this game tends to be pretty great, and enough of us have spent enough time leaning specific parts of it (e.g. raids) or just mechanics in general (\"What are random rolls? Which do I keep?\") that we'd be happy to jump onto discord (there are a bunch for PC, just check out the subreddit sidebar linked below) and answer any and all questions you may have. The fact that a representative chunk of this game is free makes this the perfect time to dip your toes in without emptying out your wallet. Any other questions about this game as a product (\"Should I pay for DLC? Is Eververse worth it?\") should absolutely be researched elsewhere.If you're looking for a place to start with the F2P content, finish the intro missions in the Cosmodrome. New and returning players are semi-regularly upgraded to a new light level floor, but means that you can miss out on the \"learning the ropes\" parts of the game that come with working your way through the New Light quest chain or unlocking different subclasses. [As of Beyond Light, all of the campaign content through Forsaken are not currently accessible. Release order was Red War (launch campaign) > Forsaken > Shadowkeep > Beyond Light > Witch Queen, followed by the upcoming expansions Lightfall > Final Shape.]Eyes up, guardian.Footnotes for people yelling at me in the comments:-All of this is my opinion. Feel free to hold your own and disagree with mine.-I generally enjoy grinding, looter shooters, FPS's, and weird sci-fi space magic. Halo, Borderlands, Warframe, and CoD Zombies are some of my most-played and favorite games.-As far as I can tell, anything that is not strictly subjective in the above is factually correct [as of Season of Plunder, with updates noted throughout. This game changes quite a bit over time, so make sure to do your own research before spending money on it]. If I've missed something, feel free to point it out in the comments and I'll do my best to update this periodically. -This review previously made mention of both content vaulting and weapon sunsetting. These practices have both been discontinued as of Season of Plunder. However, it is not clear at this if or when power capped or vaulted may return/be uncapped, if ever.-----------------TL:DR: It's good. Not perfect, but really good. And since it's free, you can get a really good sense of if this game is for you without paying for any of it. You can play almost any activity solo pretty easily except for a handful of endgame activities. If you're overwhelmed at first, just play through the Cosmodrome missions while you get your feet under you, or ask a veteran player for help.-----------------Sites to use (List was compiled at Shadowkeep launch, but most of it should still be relevant/useful) Beginner's Guide (Current as of Beyond Light) - https://www.bungie.net/en/Help/Article/49007The DTG Subreddit - /r/DestinyTheGame on Reddit - https://www.reddit.com/r/DestinyTheGame/Destiny Item Manager (mange your inventory from your browser even while in-game, essential to avoid unneeded trips back to the tower) - app.destinyitemmanager.comDestiny 2 Checklist (Lists out everything to do as well as when it resets in-game) - www.d2checklist.com/Light gg (Database of in-game items, useful for looking up random rolls) - https://www.light.gg/Braytech org (Lots of overlapping features, but I really like their maps) - braytech.org/Datto (Destiny Youtuber / 24:02 Raider who posts lots of useful/educational content, including exotic guides) - https://www.youtube.com/channel/UCkmAjbIecTIjTQctolYeuDwIf you've played D2 on another system, check out the CrossSave page (https://www.bungie.net/7/en/crosssave) on the Bungie net official site respectively to get all of your content and progression moved over to Steam.Story Recap up through Shadowkeep (Spoilers Destiny 1 / D1, and D2, obviously) (My name is Byf on YouTube: The Complete Story of Destiny! From origins to Shadowkeep (Timeline and Lore explained)) https://www.youtube.com/watch?v=9mbDXvDNqTU (Lore is one of the things that this game can be so frustratingly about - all of these other stories are so good but really hidden from the player, either because you missed them or they're not properly told to you in-game)\t\t\t\n", "\n\r\n\t\t\t\t819 people found this review helpful576 people found this review funny\t\t\t\t100\n\n\n\n\n\n\nRecommended\n3,614.0 hrs on record\n\n\n\n\nPosted: 22 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit's cheaper than meth but will ruin your life just the sameshoutouts to simpleflips\t\t\t\n", "\n\r\n\t\t\t\t910 people found this review helpful5 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n230.7 hrs on record\n\n\n\n\nPosted: 7 November, 2021\n    Follow my Curator Page if you want to see more of my reviews!   Love–hate relationshipDestiny 2, an action MMO set in a single, ever-evolving world, beckons you and your friends to partake in its adventure, all at no initial cost. It presents a multitude of captivating dungeons, raids, and an exceptional PvP experience, though it comes with an array of paid downloadable content (DLCs). Sum-Up  Pros Cons           1. Exceptional Gunplay, Class Variety, and Movement Mechanics        2. Outstanding Dungeon and Raid Design        3. Distinctive Armor and Weaponry          1. Paywall for Substantial Content        2. Solo Gameplay Tends to Be Tedious        3. Toxic PvP Player Base        4. Content Vaulting Woes        5. Dismal Matchmaking Experience    Bugs & Issues Specs           - Issue with reviving        - Ghost melee        - Server instabilities           - i5 10400f        - 2070 super        - 32GB RAM        - 1080p 280hz monitor    Rating: 7/10. It's a commendable game, but not without notable drawbacks.   Is it worth buying? Starting for free, it's a good deal. To explore more, expect to spend $80+ on DLCs. Worth it for dedicated Destiny fans, but casual gamers might consider other options.   Content & Replay Value: Story replayability is low, but PvP and raids offer over 100 hours of quality content, making it a satisfying choice for those who truly enjoy the game. Pros1.Gunplay Par Excellence:The gunplay is a symphony of power and precision, delivering impactful, satisfying shots. The handling feels robust, and there's an unmatched thrill in sniping an opposing guardian. While there's room for some balance improvements, the core gunplay is undeniably excellent.2.Dungeon and Raid Mastery:The dungeons and raids seamlessly blend puzzles, combat, parkour, and epic boss battles. To conquer a raid, communication is key, particularly when your team comprises friends. However, with random team members, prepare for potential chaos.3.Exquisite Exotic Perks:Destiny 2 shines through its exotic perks, offering a wide spectrum of abilities that can revolutionize your playstyle. From health restoration on melee kills to reflecting projectiles while sliding, these exotics enhance replayability and experimentationCons1. DLC Dependency:Although the base game is free, accessing endgame content and unique gear necessitates investing in DLCs. Playing Destiny 2 without these feels like munching on plain fries without salt – possible but significantly less satisfying.2.Lone Guardian's Lament:For those without friends in the Destiny 2 universe, navigating endgame content can be an arduous task, often marred by random teammates who may not be on the same page. Playing Destiny alone can become monotonous, and the solo experience is, for some, mentally taxing.3. PvP Pandemonium:The broader Destiny community may seem welcoming, but the illusion of friendliness crumbles in the crucible of ranked PvP. The prevalence of entitled, non-communicative players who vent frustration after underperforming can sour the PvP experience.4. Content Vanishing Act:Destiny 2's practice of \"vaulting content\" – removing previously paid-for content with the promise of potential reintegration – is deeply frustrating. It's a surefire way to alienate players, as entire planets vanish, extensive storylines disappear, and certain gear becomes unobtainable.5. Matchmaking Mayhem:Destiny 2's matchmaking can be bewildering, leading to situations where you and your friend face opponents with thousands of hours of experience, while your teammate barely contributes. Serious gameplay requires pre-made teams. Bugs & issuesGhost melee attacks and unreliable revives are a source of understandable frustration. In critical moments, these issues can lead to unexpected defeats, causing irritation, anger, and even disappointment. TechnicalWith an i5 10400f, 2070 Super, 32GB RAM, and a 280Hz 1080p monitor, you can comfortably run Destiny 2 at mid-to-max settings, maintaining an average of 180fps in PvP. While occasional drops to around 140fps may occur, stability issues are rare. A decent PC setup should provide smooth performance.Verdict: Good, but not greatDestiny 2 offers a thrilling and enjoyable PvP experience, complemented by unique armor and weapons, as well as outstanding dungeons and raids. Yet, the game's drawbacks are too prominent to overlook, warranting a 7/10 rating. It's good but not without significant flaws.    Follow my Curator Page if you want to see more of my reviews!    \n", "\n\r\n\t\t\t\t1,079 people found this review helpful18 people found this review funny\t\t\t\t172\n\n\n\n\n\n\nNot Recommended\n501.0 hrs on record\n\n\n\n\nPosted: 13 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBefore I start this review, I want to make something clear. This comes from a place not of hatred, but of love. Destiny is a game near and dear to my heart and it angers me to see the way Bungie has handled it. I know they can do better.I've played the Destiny series since year 1, Destiny 1. I've been through its highs, its lows, and everything inbetween this game I love. I've seen content droughts, content surges, content drops and flops. I've seen this game rise... and fall.It's time I faced facts, I stop huffing Copium, and be truthful; despite being with this game for years, I genuinely can't recommend it to anybody. Not in the state the game is right now. This isn't just another user complaining about a there not being new content to play constantly without any droughts, but as a player genuinely concerned for the direction Bungie is taking the game, the way the past and recent DLC have been handled, how they've monetized this game, and how they've treated their veteran playerbase.I bought the $100 Special Edition back when this game first released. All that content I bought with my hard earned money. Within a year $100 worth of content turned free to play. $100 for me turned into $0 for the average player within one year. I received no compensation for buying the game so early except an Emblem. An emblem. Not a potential for a free season pass when the seasons first started, no refund for my money, nothing. Where is this content now? Gone. Not a piece of it is still in the game. My compensation for this content leaving? Nothing still.Forsaken, the best DLC they've released for this game. The DLC that brought D2 from being a ♥♥♥♥♥♥♥♥ to being a great, relevant game with a good story tacked on it? Wiped from this game's code.The game may be \"Free to play\" but you'll sink hundreds of dollars for DLC, seasonal passes, and now separate dungeon passes worth as much as your average season pass. It's too much money to ask for people that Bungie can and will wipe from the game's code in a few months time.Yes, the content they do bring is fun, but drip-feeding us the same content for months without any relevant changes is just not a fun game to play. What is there to do anyways? We have:Raids, high quality but the same ones every timeStrikes, fun but repetitive after years of getting so little new onesDungeons, similar problems to the above, fun but repetitive from lack of varietySeasonal content, not worth doing anything but the current season unless you're trying to follow up with the game storyCrucible with a ♥♥♥♥♥♥ tryhard meta and hardly any new mapsGambit, a gamemode they've basically given up on with maps they've removed from the poolSeasonal events, fun but the same damn thing every seasonNone of these feel fresh after years and years of doing the same ones and watching old favorites get sunset from the game.And it's not like Bungie can't look back at D1 for inspiration; Sparrow Racing League is something players have been clamoring for, it'd be something fresh that Bungie can use to entice players to stay in the game. Bungie has gone on record stating that \"by the time they've designed an SRL map for Destiny 2, they could have made several strikes maps\" which to me states that A: they aren't willing to put in the effort for player experience and B: aren't willing to make several strike maps worth of content at once.And getting new players into Destiny? The most painful experience I've tried to do. This game's onboarding experience is horrible, mismanaged, and held back by half the content being locked behind a paywall. From friends I've tried to get into the game, the new player experience is:OverwhelmingConfusingNo sense of clear directionAll the cool stuff is locked behind paid dlcWhy was I put into this random mission when I booted up the game (seasonal mission you start with at every season)Any many more comments that made them not want to play the game.I know this review was basically a rant about how I feel this game is going with no clear rime or reason, jumping from topic to topic, but I just want to see this game thrive the way I know it can. Because Bungie has shown to be a competent company with quality products, but I'm just not seeing that right now.And i also want compensation for the $100 I watched vanish in the span of a year.\t\t\t\n", "\n\r\n\t\t\t\t1,572 people found this review helpful385 people found this review funny\t\t\t\t84\n\n\n\n\n\n\nRecommended\n1,716.8 hrs on record\n\n\n\n\nPosted: 8 February, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSimultaneously the best and most disappointing game youve ever played.\t\t\t\n", "\n\r\n\t\t\t\t815 people found this review helpful224 people found this review funny\t\t\t\t44\n\n\n\n\n\n\nRecommended\n6,827.4 hrs on record\n\n\n\n\nPosted: 24 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe perfect description of a toxic relationship\t\t\t\n", "\n\r\n\t\t\t\t3,827 people found this review helpful3,156 people found this review funny\t\t\t\t45\n\n\n\n\n\n\nRecommended\n3.2 hrs on record\n\n\n\n\nPosted: 5 October, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhen you look down you can see your legs\t\t\t\n", "\n\r\n\t\t\t\t1,127 people found this review helpful13 people found this review funny\t\t\t\t173\n\n\n\n\n\n\nNot Recommended\n1,038.7 hrs on record\n\n\n\n\nPosted: 28 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUntil the senior leadership team (SLT) and Pete Parsons resigns, I see no point in continuing to play this game.SLT are solely responsible for the current state of Destiny that has been slowly simmering up until this point. Few Examples here:- A downright terrible and offensive Lightfall expansion (that cost $50 at launch BTW)- Lack of consistent ritual content, it took HOW MANY YEARS AND EMPTY PROMISES to get more Crucible maps? - The past two or so years have had issues with power creeping and loot feels less and less meaningful each season. Why bother chasing new stuff? its too late to address this now.- Seasonal content structure is stale and boring. People are tired of playing boring seasonal activities that irrelevant and throw away after a season. This has been a recurring thing since Season TWO.- Nobody at Bungie can decide if the non endgame content should be hard or easy. Constant whiplash of buffs and nerfs, its impossible to keep up. - Predatory monetization and over abundance of micro transactions. $50 expansions with $50 deluxe editions. $20 armor sets. Like when is enough?- Inconsistent quality of story telling and plot delivering. How can this be some sort of epic conclusion when the past 9 years have seen one good campaign (The Witch Queen) and everything was mediocre to good at best? Hell, before Beyond Light, a large chunk of the story telling was in lore books hidden away. No matter how The Final shape ends up, good or bad, will it feel fulfilling? Hell no!- The lack of the new player experience. This has been a problem since they vaulted a bunch of content in Beyond Light. Its been over 3 years since that happened HOW is there STILL no adequate new player experience? People have been asking for this and we still have yet to see anything meaningful.I could keep going but this is off the top of my head. I'm so tired of the \"we hear you\" and promises that never get fulfilled. SLT could have led their team of very talented developers to fix and address the game's core pain points. But they are too busy ignoring their own team's feedback and player feedback. Instead, they are figuring out what the best way to further monetize and exploit players for more money is. I will no longer support Destiny or Bungie until their SLT is gone. They think they know what is best for the game but they have zero idea what is needed for a healthy state of the game and refuse to change. And when their vision fails, they layoff the people who implemented their vision instead of taking responsibility. How is that fair? Destiny is one of the best examples of a \"what if\". So much missed potential due to a few individuals who seek profit and money over anything else. Look at what happened at 343i, they cleaned up shop and Halo Infinite is slowly and surely getting into a better spot. Thats what happens when you put the person who led the fix of the disastrous Master Chief Collection as studio head.I love this game. I hate saying this as if its some sort of +1 over other people to make my opinion worth more than others, but up through Season of the Deep, I was playing every single season / content drop since the Destiny 1 beta (except season of the worthy). But I am SO tired of the constant whiplash of good times and bad times, so its time to stop for good. It shouldn't have to be this way. I have met some great people playing this game and it sucks I cannot continue to play Destiny with them. Some of my favorite gaming moments and memories are from this game. But in its current state, stay away from this game, especially new players, there are way better ones out there that respect your time.\t\t\t\n", "\n\r\n\t\t\t\t1,313 people found this review helpful1,066 people found this review funny\t\t\t\t134\n\n\n\n\n\n\nRecommended\n2,484.4 hrs on record\n\n\n\n\nPosted: 8 February, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThey fixed an issue where players enjoy the game\t\t\t\n", "\n\r\n\t\t\t\t584 people found this review helpful266 people found this review funny\t\t\t\t41\n\n\n\n\n\n\nRecommended\n1,121.8 hrs on record\n\n\n\n\nPosted: 8 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits like coke but costs more and gives you depression\t\t\t\n"]