["\n\r\n\t\t\t\t2,659 people found this review helpful5 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n2,683.4 hrs on record\n\n\n\n\nPosted: 25 October, 2013\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've been playing Path of Exile since 2011 closed beta and it's remarkable how far the game has come purely from crowd funding.  The passion of the userbase is equally matched by it's developers.  They've shown throughout the years to constantly improve and tweak the game with regularly scheduled content additions.  I still feel I don't know everything there is to know about this game, and that isn't changing any time soon.  Path of Exile is an incredibly complex and rewarding game that is definitely worth your time.Outside of having an absurdly intricate skill tree and a fantastic crafting/currency system,  the other large appeal of this game is the end-game.  Most ARPGs fail to offer incentive to continue to play your character after you've exhausted the content.  Usually this just comes in the form of a easily attainable level cap or grinding the same final zone of the game at length.  Instead, in POE you are given item drop instances, as described by the developers: \"Maps can drop as normal, magic, rare or unique with higher rarity Maps yielding more items. Using a Map item opens six portals to the area, which can each only be used once. Like most other items in Path of Exile, Maps have mods that change their risks and rewards. Map mods can affect the size or complexity of the level, monster packs, monster properties or even alter characters while in the level. Players can modify Maps themselves using their currency items. For example, you can use an Orb of Transmutation to turn a normal Map into a magic Map, or use an Orb of Alteration to reroll its mods.\"It goes to say that each and every map is a different experience, with room for countless variation in modifiers letting you push the limits of your character.  Not all characters are equal.  You will find that some characters that excell in early progression have difficulty in the end-game and visa versa.  Each character I've made has informed the next which is critical in a game that rewards experience and skill.And if that wasn't enough, POE offers alternative ARPG experiences in the form of daily race events which are time based leveling with unique modifiers that you won't see in the real game like 'Turbo Mode'.  Moreover some of these races have entirely unique content like Descent: Champions or Endless Ledge which offer players the ability to win special art reskins of legendary items for the leagues of their choice.All in all POE is a truly exciting game and a breath of fresh air for the genre.\t\t\t\n", "\n\r\n\t\t\t\t428 people found this review helpful466 people found this review funny\t\t\t\t68\n\n\n\n\n\n\nRecommended\n5,452.4 hrs on record\n\n\n\n\nPosted: 4 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFinally completed the tutorial, good game\t\t\t\n", "\n\r\n\t\t\t\t477 people found this review helpful315 people found this review funny\t\t\t\t41\n\n\n\n\n\n\nRecommended\n3,991.2 hrs on record\n\n\n\n\nPosted: 9 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI still don't know what i'm doing.\t\t\t\n", "\n\r\n\t\t\t\t300 people found this review helpful28 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n4,837.1 hrs on record\n\n\n\n\nPosted: 12 December, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAt the time of writing this review I have 2498 hours put into this game. You should consider playing Path of Exile if: 1. You liked Diablo 2, but find Diablo 3 underwhelming and the end game too boring and simple. 2. You like ARPGs3. You like games in which there are several tasks at any time you can spend your time on (crafting, farming, trading, theorycrafting, etc.) 4. You seek a balanced game where there are numerous viable builds and only your creativity with the houndreds and houndreds of items and skill gems limits you. 5. You want to play a game that is constantly updated and balanced with large content additions all the time, including a major expansion every year. 6. You're looking for a game that is truly free to play. All purchasable stuff is cosmetic, with the exception of some quality-of-life upgrades, which are not necessary in order to enjoy and play the game. Path of Exile has a lot more \"depth\" to it than other ARPGs on the market. The skill system, where you can mix-and-match between skill gems; the unique items with special and sometimes build-enabling stats, and the end game map system all contribute to a game that takes something simple and turns it very interesting. Personally, I cannot recommend this game enough. I have played WoW, Diablo, LoL, CS, HS, HotS, SC, and many other games for countless hours, but no game has ever kept me interested for the amount of time that Path of Exile has - it just keeps getting better, and the developers communicate a lot with the community in order to continue to improve the game. BUY IT!!! No, wait, it's free.\t\t\t\n", "\n\r\n\t\t\t\t995 people found this review helpful1,334 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n964.1 hrs on record\n\n\n\n\nPosted: 15 November, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you don't have a phone this game is for you.\t\t\t\n", "\n\r\n\t\t\t\t965 people found this review helpful709 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n15,434.1 hrs on record\n\n\n\n\nPosted: 5 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI like to take a break from PoE every now and then and play a couple hours of life.\t\t\t\n", "\n\r\n\t\t\t\t311 people found this review helpful41 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n521.9 hrs on record\n\n\n\n\nPosted: 17 March, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMost expensive game on Steam.I spent USD 50 *after* playing it for the first time 10 hours straight!Not because I had to. But I wanted to.Many people on steam may think that 10 hours of consecutive gaming is no big deal. But not for me. I’m almost 40. Have a wife, 3 kids, and a demanding job. On any day if I can do 2 hours of uninterrupted gaming, I’m in bliss.POE is that good.I don’t know what took me so long to find this game. I went into this game completely blind. No reviews. No gameplay videos. No guides. It is newbie friendly enough that I could move along the progression. Yet complex enough that I kept wondering what are all these interesting things all around. It makes me feel like a little kid visiting another continent for the first time. Everyone and everything are the same, yet interestingly unique and different.It has the right about of min-max, complexity, and grind. Yet it has flexibility and freedom to truly do whatever I want!So yes. The most expensive game on Steam. Not because I had to. But I wanted to.\t\t\t\n", "\n\r\n\t\t\t\t579 people found this review helpful399 people found this review funny\t\t\t\t77\n\n\n\n\n\n\nRecommended\n203.7 hrs on record\n\n\n\n\nPosted: 7 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCosts less than $100k+ a season to max out your character.\t\t\t\n", "\n\r\n\t\t\t\t499 people found this review helpful11 people found this review funny\t\t\t\t73\n\n\n\n\n\n\nRecommended\n407.1 hrs on record\n\n\n\n\nPosted: 11 September, 2020\nTL;DR: Go play the campaign, it's great! So after 400 hours I think it's finally time I reviewed the best ARPG in the market, this will be a long review, but if you are a Single Player person, or coop player at most, that wants to try Path of Exile(PoE) for the first time, then this review is for you. So as a Diablo 2 player that played it single player and coop, I always liked ARPGs, and as it happens to all of us, Path of Exile shadow looms large over the genre and your curiosity eventually gets picked up by it. You probably have the same fears as me.  \"Always online... is it multiplayer? it's some kind of MMO where I have to do dungeons with other people?\" Luckily the answer is no.  \"It's free to play, surely it's designed in a way to force you to pay to complete the campaign\"Believe it or not, this is another No. You can complete its lengthy 10 act campaign without spending a single coin in the game. You even can complete it with all the characters and not pay a single dime. And if you don't want to play with other people you aren't forced at any time to do so. The microtransactions are mostly cosmetics, and extra space for the stash isn't really necessary for the campaign. Now you probably see the crazy amount of hours of some people in the reviews and think  \"Wait I have a life besides this game, is the campaign that long? I have to dedicate my life to the game?\"  Well... here is where it gets complicated.PoE's campaign can take you around 60+ hours if you clean all the zones, do all the side-quests and hear all the dialogues. It's structured in a way to avoid the classic \"win the game 3 times in Normal, Nightmare and Hell difficulties\" so that here the difficulty escalates as you progress through all the 10 acts. So if you want to play casually just once a week to unwind and kill some monsters it's great! They really nailed how to sidestep the repeated playthroughs of the genre. Kudos to the team. \"Wait, what about that crazy skill tree? I don't want to read a wiki or a guide, I just want to play!\" The gigantic skill tree may be intimidating but you have to think that the game just dumps the (passive) skills of different classes in one screen, that's why it seems daunting. Imagine if Diablo 2 dropped all the skills of the 3 trees of each character in one screen... PoE's skill tree is the result. At first just focus on the path closest to your starting point (varies depending each class). Then, when you are comfortable with the game, you'll start to see other ramifications and possibilities. So feel free to experiment as you level up, try crazy combinations and see if it fits your playstyle, the great thing about it is that you can do some pretty varied builds with it. Active skills are another matter that I can't fit here due to the max char count of steam reviews. \"Ok, yes, but you have 400+ hours what did you do after winning the campaign?\" Here is where PoE gets problematic...I played the Atlas of Worlds, PoE's Endgame. Which is basically a gigantic map with something like 150 levels connected between them. What I like about it's that it has a clear goal with it's own story related to it. It's not just killing mobs to get better gear, and so on, where you feel like the horse constantly chasing the carrot. Here you have to get better gear to kill the final(s) bosse(s) of the game. Previously, these were two ancient beings that created the Atlas (or something like that) and always appeared from time to time randomly and gave the end game some really interesting backstory. Now, PoE being a Game as Service kind of game, things get changed up. Sadly the Atlas changed and I don't find it as interesting as in the past with the new bosses (Conquerors of the Atlas).  I think it's possible to access the old bosses but it requires doing something special and it's not integrated into the Atlas like the current bosses. But it still retains interesting aspects and mechanics that you should try all the same. It's quite unique.Another problem with the endgame is that the difficulty escalates quite steeply. And the way you play the campaign becomes almost obsolete. Your build will probably need adjusting. And here is where a lot people go searching for \"popular builds\". This part is up to you. But if you are an old fart like me that doesn't understand where is the fun in copying a build; then the game will get unforgiving and will tire you before you complete the endgame. It becomes a grind the more you progress (I reached tier 10 levels out of 14 or 15 tiers, half the Atlas i.e.). Most people just look up a guide, copy a build from said guide, and even get the items needed for the build trading them with other players, so no looting, just farming currency. Yeah I know, kids these days right? I personally don't get any fun from equipping a player in an ARPG by farming currency and trading instead of earning your loot killing difficult bosses. Or by copying someone else's character. You can play like me and ignore the \"social\" aspect, and without reading any build guides. But the endgame doesn't seem designed for that as I said before since the Atlas becomes quite difficult. You will need hours upon hours to reach a good understanding of the mechanics, it's nice to discover the intricacies of it, but the game may burn you out before you master it. The good part of PoE being a Game as Service is that there is always new content as an excuse for you to go back and try a new character.  \"I heard there is new content/expansions/leagues all the time, what's that?\" A league offers a new mechanic that is present as you play the campaign. This gets integrated with it's own theme and you can get cosmetics by completing it's own set of challenges. If you have something resembling a life and other hobbies you can forget about completing all challenges. You have three months to complete everything before the next leagues comes out and the new mechanic gets incorporated in the standard game. If you want to play at your own pace I recommend trying a league once and then you can continue in the standard game once the league ends. If you want to try different characters, going with a new one with each league isn't a bad idea. But again forget challenges, they are only for the hardcore audience that complete everything in two weeks (probably less). If PoE isn't your only game or hobby after work, then the 3 months space may be too little.   \"The story? How is it? Should I listen to the NPCs?\" For ARPGs standard, it's good. It has some highs. Some parts I recommend hearing/reading notes are the Labirynth backstory (a dungeon you have to complete without dying to earn points and make a \"Specialization\" for you character) and Daresso's story with the levels in the Colosseum. Also Kitava's story in the last act as you learn it's origin is good. But my favorite is the Labyrinth backstory of why it was created and all the rest that I won't spoil here. \"Any final advice fellow old-and-not-very-social-player?\"  The game economy is based on trading items. No gold. So for this at least, I do recommend a quick check of the wiki for the different \"horadric cube formulas\" so you know what to put in the merchant window to obtain certain currencies.  If you decide you want to trade the system isn't very intuitive. I once put some items in a premium tab with a fixed price to see how the trading worked. Some months later I logged in PoE's webpage to see I received a PM like two months back. Sorry random stranger!If you end up hooked by the endgame despite it's problems. For the love of god search an \"item filter\" you'll thank me later. \"You wrote a lot\" I know. Sorry. If you read up to here I hope this helped you to have a better understanding of PoE and what to expect at the different levels of the game.\t\t\t\n", "\n\r\n\t\t\t\t195 people found this review helpful4 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n759.1 hrs on record\n\n\n\n\nPosted: 9 July, 2023\nA Detailed Look Into Path of Exile: Is it worth playing?Short Answer: Yes. If you can get through the very steep learning curve, Path of Exile (PoE) is a phenomenal game. PoE is a true gem within the ARPG genre with an overwhelmingly intricate skill tree, gem combinations, wonderful 10 act story, vast and atmospheric world packed with lore. The game's complex nature, and continuous updates create an addictive and immersive experience, with seasons also resetting every few months to allow for new content.Long Answer:Path of Exile stands as a true masterpiece within the action role-playing game (ARPG) genre, delivering an unrivalled depth of gameplay, a vast and intricate world, and a relentless pursuit of perfection by its dedicated development team at Grinding Gear Games. With its uncompromising complexity and endless possibilities, Path of Exile offers an addictive and rewarding experience that will captivate ARPG enthusiasts and challenge even the most seasoned players.Skill TreeOne of the defining features of Path of Exile is its remarkable skill and character customisation system. The game offers a staggering skill tree, known as the Passive Skill Tree, that is a marvel of complexity and depth. With thousands of nodes to explore, players can create truly unique characters by meticulously planning their path and selecting the passive skills that suit their desired playstyle. This level of customisation ensures that no two characters are alike and opens up a world of strategic possibilities.Unique Gem SystemPath of Exile's skill gem system is another stroke of brilliance. Instead of using a traditional class system, players can socket active skill gems into their gear, allowing them to gain new abilities and modify their playstyle. This gem system, combined with the extensive support gem system that enhances and modifies active skills, provides an incredible level of versatility and experimentation. Whether you prefer to unleash devastating spells, wield massive weapons, or become a master of traps and minions, the possibilities are virtually limitless.Player-Focused EconomyThe game's economy is a complex web of trade and crafting, which further adds to the depth and immersion. Path of Exile features a barter-based system, where players trade items and currencies with each other. The currency items themselves have diverse uses, such as crafting or modifying gear, making the economy a dynamic and constantly evolving aspect of the game. This player-driven economy fosters a strong sense of community and encourages interaction and collaboration within the player base.Story & ImmersionPath of Exile's dark and atmospheric world is teeming with lore and secrets. The game's gritty art style, detailed environments, and haunting soundtrack create an immersive experience that pulls you into its dark fantasy realm. The diverse locations, from sprawling cities to foreboding dungeons, are beautifully designed and provide a sense of exploration and discovery as you unravel the mysteries of the world.Player ContentGrinding Gear Games has demonstrated an unwavering commitment to its player community. The development team consistently releases major expansions and updates that introduce new content, mechanics, and challenges. These expansions not only expand the game's storyline and lore but also introduce fresh gameplay experiences that keep the game feeling fresh and exciting. The dedication to improving the game based on player feedback is evident, with frequent balance adjustments and quality-of-life enhancements ensuring a continually evolving and engaging experience.Multiplayer AspectsThe cooperative multiplayer aspect of Path of Exile is seamless and well-implemented. Players can team up with friends or join forces with others through the game's matchmaking system, allowing for exciting cooperative play and the sharing of strategies and loot. The endgame content, such as the challenging maps and intricate boss encounters, from unique map bosses, to pinnacle uber bosses like Maven & Shaper, provides a true test of skill and coordination for groups of adventurers.If you're seeking an ARPG game that offers limitless possibilities, huge rewarding learning curves, and a captivating journey through a dark and treacherous world packed with lore, then Path of Exile is the game for you.If this review helped you, please drop it a like as it took me a while to create and it also helps other players to see a detailed non-bias review. If you really loved reading it, feel free to also follow me on Twitch @angrysquek. \n"]