["\n\r\n\t\t\t\t918 people found this review helpful26 people found this review funny\t\t\t\t42\n\n\n\n\n\n\nRecommended\n2,796.1 hrs on record\n\n\n\n\nPosted: 21 June, 2017\nEDIT: Overall, Brawlhalla has changed drastically since the release of this review. A lot of the information here is no longer correct and there are new gameplay features, dash being the most important. I certainly still feel that it is far too easy to avoid and/or delay interaction between yourself and the opponent, but it would be disingenuous of me to pretend the specifics of this review are still accurate. Although I am giving this game a positive review, I must say that it comes with a massive disclaimer. If you just play Brawlhalla with your friends and never take it seriously, you will likely enjoy yourself. However, if you ever get good at this game and play at a decently high level, Brawlhalla's glaring failures as a fighting game will become so unignorable that your desire to play it will steadily decline till you're on the subreddit crying about the passive float meta like everyone else. All of the reviews - including the negative ones - are ignoring the real problems with this game, and it's something I have thought about for a long time. So, I'll try to explain my reasoning as best as I can and briefly include the reasons why I still consider it worth downloading despite its enormous flaws. On the surface, Brawlhalla is an entertaining party game, provided you have some friends to play it with. So, if the only thing you're looking for is a simple game to kill some time (read: 1500 hours) with, download it. It is very easy to play and you are practically guaranteed to pick it up quickly regardless of your fighting game experience. Aside from being easy to play, it is also free to play and only cosmetic items cost money, so it is easy to get into as well. There are a good number of modes for you to play with your friends to prevent it from getting stale. You can level up your characters and unlock new colors for each few levels, so there is some degree of progression and playing a lot of one character can feel slightly rewarding. It also helps that a potato could likely run this game. While I do consider this game's positives enough to make it worth downloading, that’s just about all the positivity I have to share. As someone who has played and seen this game played at a very high level for many hours, I can confidently say that Brawlhalla is a fundamentally flawed mess. I'm not going to complain about the toxic community, or the netcode, or matchmaking, or any of the stuff you see other reviews complaining about. I'm only going to talk about the game's core mechanics and why it fails competitively. Brawlhalla has a dodge mechanic that grants virtually instant invincibility and makes you unhittable for nearly half a second. Dodging has very low risk because it has only 0.97 seconds of downtime and it is difficult to punish unless your opponent can predict exactly where you will dodge. You can dodge in 8 directions at any given time, and if you are running you can dodge twice in succession. When the iframes from the dodge end, you are able to jump or attack almost immediately, which is one of the main reasons why it’s so ridiculously safe. You can also jump in any direction 3 times, and once you're in the air you can quickly fall to the ground to get all your jumps back and continue hopping around. This combination of instant invincibility on a 1 second cooldown and an insane amount of aerial freedom results in a passive, floaty meta where playing optimally means avoiding making any approaches. Usually, making the first attack means risking being punished, whereas dodging or floating away is safe and can potentially put you in a position to punish a whiffed attack. Because of this, it often feels like you’re chasing your opponent rather than fighting them. Seriously, playing this game feels like you're in space with how effortlessly you can float around and avoid your opponent. Constantly approaching will get you killed faster than a lone cripple in a collapsing, burning building. Sometimes, salty players will run away from you in ranked just to troll you and you will have a very hard time catching them. Yes, this is a problem with the community, but it shouldn’t be possible in the first place. A key reason this happens is because dodging is a stupidly easy way to escape pressure. Any time you get hit you can just dodge in one of eight directions and reset the match to the neutral phase. Brawlhalla’s neutral phase is reminiscent of two kids hopping around on a jungle gym endlessly until one kid falls and hurts themselves (in this case, hurting yourself would be equivalent to approaching). Another issue that ties into dodging and movement is wall camping. It’s possible to wall camp almost endlessly and force your opponent into a disadvantage if they want to approach. Players have won tournament matches by abusing this. A mechanic was introduced that stops you from getting your jumps back after touching the wall too many times, but it's rather forgiving and you only need to touch the stage for a few frames before you can resume wall camping. Once you get comfortable with movement in this game, it’s incredibly easy to dance around on the wall for as long as you want. If you’re reading this and you don’t play Brawlhalla, you might be thinking that all the problems I’ve listed thus far could be addressed by nerfing dodge in some capacity. Unfortunately, the entirety of Brawlhalla has already been crafted and balanced around this awful mechanic. Certain weapons are better at punishing dodges than others, with some weapons capable of dealing massive damage on a precise dodge read. A considerable dodge nerf would mean that these weapons would benefit immensely and quickly become meta. The only way I can imagine this game’s passivity problem being fixed would be a colossal rework of dodging, jumping, and probably every weapon in the game as well. Understandably, the developers don’t know what that rework should be and how to conduct it. They’re trying to fix the game’s passive float meta by applying band aid fixes that ultimately do very little to address the huge, overarching passivity problem Brawlhalla has always had.  The other day, I told myself I was going to play ranked with the only intention being to win, which meant playing fully passive and not caring what people thought of me. I quickly reached top 50 in the world doing this. Almost nobody gged me and plenty of people complained about my playstyle in post game chat. Admittedly, although I am never toxic to anyone regardless of how they play, I don't blame a single one of those people for their anger. Brawlhalla, when played at a high level, is legitimately one of the most frustrating fighting games to play in existence. Just imagine losing to someone after they avoided approaching you, wall camped, or outright ran away from you for the entire game. Considering this, it’s no wonder why Brawlhalla’s community is a cesspool of toxicity and noxious, salty fumes. As much as I want to give this game a negative review, I cannot justifiably do so. Most people who play this game will stay at a basic, casual level and never even notice or be forced to encounter the serious passivity problem this game has. So, despite my frustration with Brawlhalla, I am giving it a positive review. My recommendation would be to play with your friends and avoid taking this game too seriously. However, the prevalence of the passive float meta is noticeable as early as high platinum/low diamond, so be very forewarned and prepared to deal with it if you intend to play this game for many hours.\t\t\t\n", "\n\r\n\t\t\t\t216 people found this review helpful54 people found this review funny\t\t\t\t8\n\n\n\n\n\n\nRecommended\n0.1 hrs on record\n\n\n\n\nPosted: 16 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDevs, please add Walter White\t\t\t\n", "\n\r\n\t\t\t\t168 people found this review helpful47 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n1,094.3 hrs on record\n\n\n\n\nPosted: 2 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI want to jump off of a building\t\t\t\n", "\n\r\n\t\t\t\t176 people found this review helpful304 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n100.3 hrs on record\n\n\n\n\nPosted: 1 August, 2017\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThrowing the gun gives you more range than actually firing it.\t\t\t\n", "\n\r\n\t\t\t\t230 people found this review helpful107 people found this review funny\t\t\t\t31\n\n\n\n\n\n\nRecommended\n408.1 hrs on record\n\n\n\n\nPosted: 16 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIt's one of those games where you'll say, \"I hate this game\", and then immediately hop into another match.\t\t\t\n", "\n\r\n\t\t\t\t138 people found this review helpful53 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n498.4 hrs on record\n\n\n\n\nPosted: 12 July, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnon-visible form of self harm\t\t\t\n", "\n\r\n\t\t\t\t152 people found this review helpful62 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n50.1 hrs on record\n\n\n\n\nPosted: 13 September, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t>man like smash>man has no switch>man play brawlhalla>man satisfied\t\t\t\n", "\n\r\n\t\t\t\t137 people found this review helpful65 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n668.8 hrs on record\n\n\n\n\nPosted: 27 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tplay if you are a masochist\t\t\t\n", "\n\r\n\t\t\t\t169 people found this review helpful37 people found this review funny\t\t\t\t8\n\n\n\n\n\n\nRecommended\n5.6 hrs on record\n\n\n\n\nPosted: 2 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpls add walter white\t\t\t\n", "\n\r\n\t\t\t\t177 people found this review helpful36 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n1,035.0 hrs on record\n\n\n\n\nPosted: 13 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIt's one of those games where you'll say, \"I hate this game\", and then immediately hop into another match\t\t\t\n"]