["\n\r\n\t\t\t\t1,241 people found this review helpful884 people found this review funny\t\t\t\t129\n\n\n\n\n\n\nRecommended\n99.3 hrs on record\n\n\n\n\nPosted: 17 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1. load in2. find can of beans3. man puts gun to my head and verbally assaults me in foreign language. 4. beans stolen5. cry10/10\t\t\t\n", "\n\r\n\t\t\t\t1,724 people found this review helpful212 people found this review funny\t\t\t\t322\n\n\n\n\n\n\nRecommended\n2,311.9 hrs on record\n\n\n\n\nPosted: 30 November, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was looting the barracks in Zelenogorsk when I hear a gate being opened behind me, I turn and see a well-equipped player dealing with a zombie. I have a gun in hands and the advantage, but my entire current playthrough has been rather peaceful, so i opt for a non-violent solution. I duck behind the corner of a barrack and yell over direct chat that I don't want to kill him, and i circle around a stone wall trying to avoid line of sight. He answers, but it is intangible. I can't see him anywhere but I assume he went to the barracks. (1st person server btw) I try my best to not get in an awkward position and run up into the second floor of a house overlooking the military site. By the time I get there i can see that he has indeed closed the door in the prison building.The reason i was looting military sites was to find some AK74 mags. That was my entire reason for being there. I'd trade my M4 for a couple of those. I think about the chances of being killed versus the chance of him might having such a mag for trade. I know it's risky, but ♥♥♥♥ it. I run up to the prison building and say I'm friendly and just wondered if we could do some trade.He accepts and tells me to come into the prison with my gun put away. This smells rotten eggs all the way to Rify, but I'm determined that my friendly intentions will serve me well.I enter, he is pointing at the door with an AUG. It's when i get closer to him that i see a second man with an AUG in the staircase. I explain what I'm trying to get and mid-sentence, a friend of theirs come in. He was likely watching the entrance. After a little meet&greet the say 'sorry, don't have any mags'. I say that's okay, and we agree that we wont go the same direction afterwards lest we run into each other again.I drop a black skull balaclava that i wasn't using as a token of gratitude for the friendly encounter and I'm on my way to Mishynko. Half way there, somewhere in the forest, I'm shot in the leg. Pants ruined, but legs not broken. I very briefly get some vietnam-level flashbacks to the time my roommate taught me the basics of ARMA and combat, and I jump behind a tree instead of just turning around. I count down from 10 and regain my breath. My M4 is equiped with an ACOG, and the shooter must have been about 100-150 meters away.I peek from the tree and see a man getting down on the ground by a bush. There's no peaceful solution to this conflict. My breath has gone down and I brace myself. peaking a second time with my rifle and shoot three rounds.One of them hit.I wait 4 seconds for him to likely have gotten behind a tree of his own to bandage. I start making a wide arch around him, moving as quickly and safely i can while preserving breath. I finally get to him and see he's unconscious.That's when i noticed it was the third guy from before, donning a black skull balaclava. I'm angry, but not disappointed. this is the nature of the game. While i still have him alive and able to hear me, all i can get myself to yell was \"I TRUSTED YOU\" before I shot him. Looting his body, I find 3 ak74 mags, an ammo box full of the right ammo, an LRS and some decent stores of food. All in all, most intense thing I've had happened the last few months.\t\t\t\n", "\n\r\n\t\t\t\t810 people found this review helpful768 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n13.1 hrs on record\n\n\n\n\nPosted: 14 April, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPretty fun, but very sad. Met a Russian guy, we became friends, even with a language barrier. We played with each other for a while. Then I got shot in the head. And I never got to see him again. If you're out there man let me know. I miss you.\t\t\t\n", "\n\r\n\t\t\t\t822 people found this review helpful502 people found this review funny\t\t\t\t73\n\n\n\n\n\n\nRecommended\n69.6 hrs on record\n\n\n\n\nPosted: 21 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t>Wake up on beach>Run past 2 people with machetes LARPing as cannibal Amazonians>Miraculously escape>Meet 55 year old guy with 2 kids in the background who gives me bandages>Follow him around for an hour>Gets his head taken off right in front of my eyes while telling his kids to shut up>Take his gun and have it jam right as I try to shoot the attacker in the back of the head>Dead instantly>Wake up on beach again and watch the machete men chase another fresh spawn hurling slurs the whole way10/10 \n", "\n\r\n\t\t\t\t564 people found this review helpful298 people found this review funny\t\t\t\t54\n\n\n\n\n\n\nRecommended\n2,613.0 hrs on record\n\n\n\n\nPosted: 14 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game taught me how to socially interact with people and how not to be taken advantage of. It also taught me how to commit murder, steal, and gas light people into thinking I am to be trusted.\t\t\t\n", "\n\r\n\t\t\t\t941 people found this review helpful1,325 people found this review funny\t\t\t\t556\n\n\n\n\n\n\nRecommended\n60.0 hrs on record\n\n\n\n\nPosted: 15 November, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI entered a house, desperate and hungry, looking for some food. I heard some footsteps outside.The guy said \"hey\", and entered the house.I said \"hey\" back.He hit me with a hammer.This was the beginning of a beautiful tale... the tale... of the Shoe Gang.I ran out of the house and up the street as far and as fast as I could. I stopped and turned around to see if I was being followed by this crazy hammer man. I stood there, hungry and demoralised.Then there was a voice... \"Behind you, behind you\"! Out of nowhere and in all his glory, another player... apparently much friendlier than my previous encounter.I told him what had happened in town. He charged off... \"Let's get this mother ♥♥♥♥♥♥\".Armed only with my ten fingers curled into balls, we ran at the Hammer Man, who after seeing our number had doubled, decided to take a more diplomatic approach.He apologised for hitting me with his hammer, and explained he simply wanted my shoes for his friend. Little did he know that I had just found the most pristine pair of shoes in the house where we first met.They were my shoes now.Agreeing to put our differences aside, the three of us teamed up in search of the finest shoes for the Hammer Man’s friend. We searched high and we searched low, but there were no shoes to be found. Finally, we met up with the shoeless man, whose shoes certainly were in a state of disrepair. Unable to tolerate the toes of the bare footed any longer, the four of us left town and made our way across the countryside.Sometime later, we encountered another survivor. He had a nice hat, but we weren't there for hats. He was clearly uncomfortable, and he was right to be, as the Hammer Man had been stashing a secret pistol this whole time. We were explaining our need for shoes when the Hammer Man went for the kill.Unknown to the survivor, the gun went to the back of his head. Hammer Man pulled the trigger. He completely missed the shot. Listening to the Hammer Man’s accent he appeared to be French, which for me, an Englishman, explained his inability to handle a firearm at 3 centimetres.The Hammer Man pulled out his primary hammer and bashed the survivor over the head. It was terrible to witness, and mentally scarring. Utterly traumatised, the rest of us piled in with our fists. We were careful not to hit his shoes, but it turned out that he too was wearing worn footwear. However, it was enough, and our friend fitted the loafers over his aching toes.The four of us marched on. The fields of Livonia seemed to stretch forever, and the rain began to fall. We found an old abandoned house, apparently half-shelled but yet still standing. One of the boys lit a fire in the fireplace.It was beautiful.We properly introduced ourselves. Bonds were formed. Shoes were discussed.It was a moment cut short. My saviour in town announced that his shoes were now unfit for purpose, and so our thirst for shoes was far from satiated.After much searching, my new friend had to go, leaving myself, the Hammer Man and his friend to fend for ourselves. We moved on... shoes won't wear themselves.The rain gave way and we pushed on, the scent of leather driving us through the forests. The three remaining members of The Shoe Gang took part in some fishing. We sat round a fire and cooked, and we discussed our shoe filled fantasies.We moved on and day began to turn into night. Darkness was our environment. Nature began to stir and the sound of wolves filled the air. It didn't take long. We were outnumbered. Our shoes were worn out, and they were upon us in the blink of an eye.Hammer Man was the first to fall, flailing his gavel relentlessly as the beasts took him. I attacked the alpha wolf with a big stick which only seemed to anger him. Soon everything began to fade, the blood loss was traumatic and I slipped into darkness. Many hours had passed with my new friends, and my last memories were of them dying.Darkness came. Silence followed. A loud ringing in my ears...The wolves killed us all. I have no doubt that they took all of our shoes.\t\t\t\n", "\n\r\n\t\t\t\t655 people found this review helpful58 people found this review funny\t\t\t\t32\n\n\n\n\n\n\nRecommended\n1,130.0 hrs on record\n\n\n\n\nPosted: 9 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPut it on sale so my friend can buy it and play with me :D\t\t\t\n", "\n\r\n\t\t\t\t1,578 people found this review helpful179 people found this review funny\t\t\t\t245\n\n\n\n\n\n\nRecommended\n932.5 hrs on record\n\n\n\n\nPosted: 7 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was looting the barracks in Zelenogorsk when I hear a gate being opened behind me, I turn and see a well-equipped player dealing with a zombie. I have a gun in hands and the advantage, but my entire current playthrough has been rather peaceful, so i opt for a non-violent solution. I duck behind the corner of a barrack and yell over direct chat that I don't want to kill him, and i circle around a stone wall trying to avoid line of sight. He answers, but it is intangible. I can't see him anywhere but I assume he went to the barracks. (1st person server btw) I try my best to not get in an awkward position and run up into the second floor of a house overlooking the military site. By the time I get there i can see that he has indeed closed the door in the prison building.The reason i was looting military sites was to find some AK74 mags. That was my entire reason for being there. I'd trade my M4 for a couple of those. I think about the chances of being killed versus the chance of him might having such a mag for trade. I know it's risky, but ♥♥♥♥ it. I run up to the prison building and say I'm friendly and just wondered if we could do some trade.He accepts and tells me to come into the prison with my gun put away. This smells rotten eggs all the way to Rify, but I'm determined that my friendly intentions will serve me well.I enter, he is pointing at the door with an AUG. It's when i get closer to him that i see a second man with an AUG in the staircase. I explain what I'm trying to get and mid-sentence, a friend of theirs come in. He was likely watching the entrance. After a little meet&greet the say 'sorry, don't have any mags'. I say that's okay, and we agree that we wont go the same direction afterwards lest we run into each other again.I drop a black skull balaclava that i wasn't using as a token of gratitude for the friendly encounter and I'm on my way to Mishynko. Half way there, somewhere in the forest, I'm shot in the leg. Pants ruined, but legs not broken. I very briefly get some vietnam-level flashbacks to the time my roommate taught me the basics of ARMA and combat, and I jump behind a tree instead of just turning around. I count down from 10 and regain my breath. My M4 is equiped with an ACOG, and the shooter must have been about 100-150 meters away.I peek from the tree and see a man getting down on the ground by a bush. There's no peaceful solution to this conflict. My breath has gone down and I brace myself. peaking a second time with my rifle and shoot three rounds.One of them hit.I wait 4 seconds for him to likely have gotten behind a tree of his own to bandage. I start making a wide arch around him, moving as quickly and safely i can while preserving breath. I finally get to him and see he's unconscious.That's when i noticed it was the third guy from before, donning a black skull balaclava. I'm angry, but not disappointed. this is the nature of the game. While i still have him alive and able to hear me, all i can get myself to yell was \"I TRUSTED YOU\" before I shot him. Looting his body, I find 3 ak74 mags, an ammo box full of the right ammo, an LRS and some decent stores of food. All in all, most intense thing I've had happened the last few months.\t\t\t\n", "\n\r\n\t\t\t\t842 people found this review helpful136 people found this review funny\t\t\t\t68\n\n\n\n\n\n\nRecommended\n70.1 hrs on record\n\n\n\n\nPosted: 10 September, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVery Positive @ $15. Mostly Positive @ $25. Negative @ $45.\t\t\t\n", "\n\r\n\t\t\t\t375 people found this review helpful10 people found this review funny\t\t\t\t59\n\n\n\n\n\n\nRecommended\n1,416.4 hrs on record\n\n\n\n\nPosted: 2 August, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA review from a non-competitive, casual player.From what I can gather, this game has two types of players/two types of ways to play.  The first is the competitive 1st person shooter type, who likes to travel alone or with a group of trusted friends, picking on all the other players in a dog-eat-dog environment.  I am not one of those guys, so I play on a newb server with other very casual players.  As an introvert, I often play alone and like to choose when I interact with others.  DayZ is ideal for me.  I play on a newbs/noobs only server, not because I suck at the game, but because I don't like the hassle of chasing my corpse or starting over every time I die.  As a new player, I enjoyed the scrounge-for-survival aspect of the game.  It was suspenseful, and it is good I play on a friendly server because there were times when I was begging for food or medicine.  I've also played 7 Days to Die and while the midnight raids were exciting to defend from, I really enjoy the realism of the arma platform this is based off of.  Okay, so zombies, wolves and bears aren't too smart - but they still surprise me once in awhile!After running around awhile learning how to play and how to best equip my character in terms of gear (which there's a big variety to choose from in clothes, gear, guns) I was able to save enough money to buy a ♥♥♥♥♥♥ car.  (My server has money and cars that don't fall apart after hitting a street sign, which is good, because as I said, I don't like to chase corpses - or in this case, replace what I've worked hard to buy/build/collect.)  The car was a force multiplier for me.  I could throw a tent or some building supplies in it and build a base.  At first, I just roomed with others who knew how to build bases, then started building my own.  My first bases were simply houses in game with the doors and windows boarded up as necessary, with a gate/door and a code lock.  Mind you, the server I play on has LOTS of mods.  Vanilla DayZ is much more limited, and is really just survival.Anyway, with a base, I had a place to store the prizes I found in my scavenging, and the car allowed me to drive around to hard-to-get-to loot locations and also to help others.  The vendors are WAAAY across the map from each others, so new players could often use a lift.  The map is HUGE!  (Charnaris)  Now, as an experienced player, I've learned to enjoy the occasional wipe by Bohemia or the server owners to put new stuff in the game for us.  The initial rat-race when a server wipes to grab your favorite base location and get some rare loot before it becomes rarer is fun.  I enjoy grinding for a car right away so I can help others, as when there's a wipe, everyone is starting out again.  But as an introvert, it's easy to get lost on the map alone too.  I can choose when I interact with others without feeling guilty for ignoring people like in WoW where people are EVERYWHERE.  Conclusion: I am an old man.  I play games to escape and chill.  I have nothing to prove to anyone.  So, playing on newb servers with lots of mods to add variety is my bag.  The fun for me is helping new people and the endless scavenger hunt to find my favorite rare gear.  There's no levels, or OP weapons or anything like that in the game, so no one is 'god' compared to another player.  The experience you have as a player is what separates you from other people, not your bling and flashy avatar.  I would recommend it for people who want a realistic survival game.  But remember, if you do go PVP, just expect you'll die and have your corpse looted and be surrounded by adolescent idiots.  You may have to hunt around for the server you feel most comfortable in.  I would recommend everyone look for a noob/newb server to start, or if you want to start out and learn hard-core, play vanilla on a PVE server.  I enjoy variety.  My server has 70 mods currently.  But it's also easy mode, so I can listen to lectures and music while I play.Hope this helps! - Peiper \n"]