["\n\r\n\t\t\t\t12,614 people found this review helpful9,273 people found this review funny\t\t\t\t2,507\n\n\n\n\n\n\nNot Recommended\n53.4 hrs on record\n\n\n\n\nPosted: 11 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'd rather buy WinRAR\t\t\t\n", "\n\r\n\t\t\t\t4,832 people found this review helpful581 people found this review funny\t\t\t\t159\n\n\n\n\n\n\nNot Recommended\n39.7 hrs on record\n\n\n\n\nPosted: 2 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t This abomination is why youtube should have kept the dislike button\t\t\t\n", "\n\r\n\t\t\t\t6,079 people found this review helpful1,741 people found this review funny\t\t\t\t308\n\n\n\n\n\n\nNot Recommended\n57.8 hrs on record\n\n\n\n\nPosted: 19 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI pre-ordered the gold edition , I am an idiot 10/10\t\t\t\n", "\n\r\n\t\t\t\t2,233 people found this review helpful112 people found this review funny\t\t\t\t79\n\n\n\n\n\n\nNot Recommended\n52.0 hrs on record\n\n\n\n\nPosted: 17 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis is the game that  FINALLY taught me never to pre-order again.\t\t\t\n", "\n\r\n\t\t\t\t3,186 people found this review helpful87 people found this review funny\t\t\t\t190\n\n\n\n\n\n\nNot Recommended\n60.1 hrs on record\n\n\n\n\nPosted: 14 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tValve this game is a scam,  allow us to refund ffs.\t\t\t\n", "\n\r\n\t\t\t\t12,209 people found this review helpful262 people found this review funny\t\t\t\t1,076\n\n\n\n\n\n\nNot Recommended\n48.1 hrs on record\n\n\n\n\nPosted: 16 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLets launch an all star game . Promote it like crazy , knowing you have a BF hard core group who will buy but the newbies on the block get sucked into the hype . We all find out its is the worst BF released to date incomplete, bug ridden , laggy  mess. even the simple thing of the quality of the textures is 2nd class. Whats going on ? oh and with in months your smashing the price down by 34% as no one is buying it anymore . Are you still trying to work out why this is ? read the reviews here. Sell the franchise to someone who cares please EA . You don't care anymore and have milked enough out of what was originally a classic game that we would all spend 100s of hours on.  Yes i have been here since the first one so many great memories of such a great game back then . Its been ruined. I'm out. I write very little reviews but had to this time.  Do I recommend = No\t\t\t\n", "\n\r\n\t\t\t\t9,239 people found this review helpful1,435 people found this review funny\t\t\t\t473\n\n\n\n\n\n\nNot Recommended\n173.2 hrs on record\n\n\n\n\nPosted: 6 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBy the time it’s 100% finished it will $9.99. So wait for that.  It is the best out there for now.\t\t\t\n", "\n\r\n\t\t\t\t1,536 people found this review helpful555 people found this review funny\t\t\t\t153\n\n\n\n\n\n\nNot Recommended\n54.8 hrs on record\n\n\n\n\nPosted: 29 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'll put about as much effort into my review, as the devs put into this game.---Edit:Ok credit where its due, they have improved this a lot. Would I recommend it? Eh... on sale sure. I've put in about as many hours per dollar I spent on it so it was worth it now that it's been improved upon. But Battlebit is 100% better and cheaper.\t\t\t\n", "\n\r\n\t\t\t\t11,801 people found this review helpful761 people found this review funny\t\t\t\t1,385\n\n\n\n\n\n\nNot Recommended\n32.1 hrs on record\n\n\n\n\nPosted: 8 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI spent $109.99 and didn't refund to save you wasting your money.The good:- Portal might be good some day.The bad:- No classes- Wide open maps with no cover- Maps are too big and turns the game into a running simulator- No scoreboard- No changing squads- No changing teams- Awful hit registration- Awful random bullet deviation- Broken hover tank that can scale walls and harder to blow up than a tank.- Bug that won't allow you to re-deploy when you die. You have to leave the game.- Bug that will show your team mates as enemies and they can knife you to death- Only 22 weapons, of which 2 are actually good.- Attachments unlocked that are cosmetic only.- Some attachments do the opposite of what the description gives.- XP disabled in custom portal games- Attachment progression disabled in AoW Solo / Squad matches.- Crashes and disconnects- Persistence data error that makes the game unplayable.- Only two modes on 7 maps for AoW that feels like you are playing wide open fields.- Control points in breakthrough mode on top of skyscrapers what can't be captured because there are 11 vehicles on top.- Hit registration, or lack there of. You will dump an entire clip into an enemies back to have them turn around and kill you.- You can get in a vehicle and shoot and kill yourself because the animation still has you outside of the vehicle.- Crap FPS on the highest end systems. Changing the settings makes virtually no difference.- No stats page- No server browser- Lobby disbands after every game, no carryover- No distinctions between factions except the glow stick colors. Soldiers around the world wear glow sticks to make themselves unseen to the enemy. Sometimes you see the Betty White specialist kill the other Betty White specialist who is then revived by the Betty White specialist.- When you spawn in you are forced into an animation of chambering a round that you can't avoid. If you spawn near an enemy, you are dead.- Not nearly enough destruction.- Can't change the scale of the UI, or the zoom of the minimap.- No all chat- No bullet damage on hit, this goes for vehicle hits too.- Finding yourself on the map or the mini-map can be... challenging.- You can't dive under water but...- You can fall through the map- Portal- No single player campaign that was left out to focus on the multiplayer.- No spectator mode- No community servers- No test range- No 3d spotting- No contextual leaning- No crouch sprinting- No scope zeroing- No tiered or paused reloads- No melee weapon choices- No thermal optics in the future- No Claymores- No first person takedowns which are different based on positioning.- No naval vehicles- No gunner direction indicator- No TV missles- No vehicle kill assists. Do 95% of the damage... Well, too bad.- No in-game VOIP at launch- No static weapon emplacements- No infantry focus maps. You will get farmed by vehicles.- UI is...well...interesting- Impossible to play with more than 3 friends.There is more, but I'm tired of typing. Take it for what you will.\t\t\t\n", "\n\r\n\t\t\t\t3,622 people found this review helpful931 people found this review funny\t\t\t\t320\n\n\n\n\n\n\nNot Recommended\n20.0 hrs on record\n\n\n\n\nPosted: 30 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was a fool when I bought No Man's Sky day one.I was a fool when I bought Fallout 76 day one.I was a fool when I bought Cyberpunk 2077 day one.I was a fool when I bought Battlefield 2042 day one.I am just a fool. Do not be like me.\t\t\t\n"]