["\n\r\n\t\t\t\t861 people found this review helpful497 people found this review funny\t\t\t\t81\n\n\n\n\n\n\nRecommended\n368.2 hrs on record\n\n\n\n\nPosted: 15 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've been playing for 3 Hours and its already been 16 hours\t\t\t\n", "\n\r\n\t\t\t\t305 people found this review helpful4 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n292.2 hrs on record\n\n\n\n\nPosted: 22 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\there's one important things before u start playingalways make a backup everytime u done playing, just in case ur save is gonego to:Program Files (x86)\\Steam\\userdata\\1077671946 then make a copy 1446780 folder somewhere saveif ur save gone here's the way u fix it1 - Delete 1446780 folder from Program Files (x86)\\Steam\\userdata\\10776719462 - Copy and paste ur backup 1446780 folder to Program Files (x86)\\Steam\\userdata\\10776719463 - Then go verify ur MHrise4 - Restart ur device 5 - Done\t\t\t\n", "\n\r\n\t\t\t\t428 people found this review helpful256 people found this review funny\t\t\t\t36\n\n\n\n\n\n\nRecommended\n75.6 hrs on record\n\n\n\n\nPosted: 2 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI LOVE KILLING ENDANGERED SPECIES\t\t\t\n", "\n\r\n\t\t\t\t223 people found this review helpful145 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n370.3 hrs on record\n\n\n\n\nPosted: 26 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMany monsters think they can outsmart me with combos and stuns.Maybe.But i am yet to find monster than can outsmart normal ammo 2.\t\t\t\n", "\n\r\n\t\t\t\t578 people found this review helpful180 people found this review funny\t\t\t\t27\n\n\n\n\n\n\nRecommended\n457.0 hrs on record\n\n\n\n\nPosted: 17 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYou can put cats into submarines to get honey for you\t\t\t\n", "\n\r\n\t\t\t\t599 people found this review helpful279 people found this review funny\t\t\t\t32\n\n\n\n\n\n\nRecommended\n396.8 hrs on record\n\n\n\n\nPosted: 30 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI like to brutally murder animal species for a cool hat.\t\t\t\n", "\n\r\n\t\t\t\t168 people found this review helpful\t\t\t\t17\n\n\n\n\n\n\nRecommended\n107.4 hrs on record\n\n\n\n\nPosted: 29 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNow that I've hit endgame (again) for Rise, it's time for some *SPOILER FREE* thoughts from a veteran MonHun boomer, someone who's stuck with this franchise since the OG game on PS2.This game is overall fantastic, and the biggest reason for that to me is the added mobility. Never before has MonHun's gameplay been this quick and stylish, and it's all thanks to the addition of the Wirebug mechanic. Those who've stuck with these games since pre-World know how much commitment the movement has taken until recently, the purposeful clunkiness to them that was involved in older titles, it was part of what made those older games so difficult in comparison. But now if you whiff a swing (with a Greatsword, for example), there's nothing but a short cooldown to keep you from not only pulling yourself into another swing, but also closer to your target. It all feels incredibly satisfying.That brings me to the topic of difficulty. This game is VERY easy for experienced players, I'd wager its no more difficult than vanilla World, even. Just like in World, there's a lot of options for hunters to take advantage of and forgiveness that makes playing Rise an absolute breeze for the most part. If you happen to get punished by a monster and take a rough hit, you can just yank yourself out of further harm's way and into a better position to heal up thanks to the Wirebug, like a get out of jail free card that happens to be on a cooldown. Even the monsters themselves are incredibly scaled down compared to their older iterations to the point where previously notorious ones aren't nearly as adrenaline pumping to fight as they once were. It's my hope that Sunbreak aims to alleviate this issue in some regard.I also hope for a hefty amount of content with that expansion, which is the only other issue I have with Rise. It's got more than World's base release, but it's still rather lacking. It's hard to ask for a content-rich MonHun post Generations Ultimate, as I'm 1000% sure we'll NEVER have a release as expansive as that until maybe a decade or two from now. It's going to take A LOT of work just to bring previously existing monsters into a brand new game that involves brand new mechanics and such, so I pray to the Capgods that they're up to the task.That being said, while I do miss the ball crushing difficulty and the vast amount of content of pre-World titles, it in no way keeps me from coming back to Rise even after I've topped up my hunter nearly to her limits. It's just too fun to play, and I felt the same with World. Despite all of these complaints, I've put hundreds of hours into both of these recent titles.Whether you're a brand new hunter or coming from World and its expansion, or if you're a veteran not stuck in the \"glory days\" as some would put it, I wholeheartedly recommend picking up Monster Hunter Rise.\t\t\t\n", "\n\r\n\t\t\t\t239 people found this review helpful133 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n386.5 hrs on record\n\n\n\n\nPosted: 23 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpros: -fun gamecons: -jyuratodus is still in the game\t\t\t\n", "\n\r\n\t\t\t\t426 people found this review helpful137 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n291.7 hrs on record\n\n\n\n\nPosted: 19 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t288 hours of dog drifting\t\t\t\n", "\n\r\n\t\t\t\t2,326 people found this review helpful851 people found this review funny\t\t\t\t240\n\n\n\n\n\n\nRecommended\n70.0 hrs on record\n\n\n\n\nPosted: 12 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo handler\t\t\t\n"]