["\n\r\n\t\t\t\t885 people found this review helpful27 people found this review funny\t\t\t\t137\n\n\n\n\n\n\nNot Recommended\n1,628.2 hrs on record\n\n\n\n\nPosted: 3 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAlthough it has been almost a month since I quit this game, I'm going to write this review in the hope that new players will have a basic understanding of what they are about to get themselves into. Not saying that you shouldn't TRY the game (it's free so why wouldn't you), but I hope that by the time you reach the point in the game where you feel like you need to swipe your credit card or start feeling the need to keep playing the game even at the cost of neglecting your real life responsibilities, you'll be able to make an educated decision on whether you want to keep p(l)aying or break yourself out of the vicious cycle that is Lost Ark's gameplay loop.TL;DR Lost Ark is a well-polished game with amazing action combat, fun classes, and stunning visuals. However these pros are only meant to draw players in whereby they will fall prey to the dev team's intentionally predatory pay-to-win mechanics, slog through hours of doing the same repetitive tasks on six or more characters every day, get verbally abused or gatekept by a toxic elitist community, or get randomly banned from the game for no reason. This game is not intended for your average Joe who holds a 9-5 day job and only has 2 hours on average to play games every weekday; it is targeted to either single rich people who have no other responsibilities or dependents and can afford to throw truckloads of cash at the game, or single poor people who have no other responsibilities or dependents and can afford to play this game for 16 hours every day.Korean MMOs are notorious for their top tier gameplay, stunning visuals and graphics, punishing amounts of grinding, and pay-to-win mechanics designed on the philosophy that rich people should always dominate poor people in every aspect of life. Lost Ark unfortunately is no exception to this doctrine. As a new player, upon starting the game you will immediately be wowed by the game's fantastic graphics, polished zones, and fun action combat. But don't be fooled; you are the fish that the devs want to catch and the pretty graphics and amazing gameplay is the bait that they use to hook you in. The story of this game is mediocre and is mainly just generic medieval fantasy garbage that you've likely seen in many previous MMOs or other RPG games. The bad guys of the world are even just generically named as \"demons\". After reading through a few lines of story dialogue you will very soon become lost and confused with regards to where the story is going and eventually you'll just end up skipping the majority of the quest dialogue.The early game from level 1-50 mostly consists of you following the main story quest while doing countless numbers of generic \"kill X\" or \"fetch X\" side quests. In between there are dungeons that you will both run through as part of the main story or optionally as part of a side quest. These dungeons are well designed, but unfortunately you won't be able to team up with anyone to run them because the early game is completely devoid of real human players. Your only companions at this point are the hundreds of bot trains that run around each zone with impunity.Reaching level 50 as a new player will likely take anywhere between 8-40 hours of gameplay, depending on whether you're speedrunning through each zone or taking the time to stop and smell the roses. Once you hit level 50 you'll enter what the game refers to as \"Tier 1\" of progression. There are currently three tiers of progression: 1, 2, and 3 (the current highest tier). This is where you will establish your daily routine for the rest of your Lost Ark, which will consist of doing your daily two Chaos dungeon runs, daily two Guardian runs, daily three Una's tasks (which are again either \"kill X\" or \"fetch X\" quests), and weekly three Una's tasks (which are again mostly just \"kill X\" or \"fetch X\" except scaled up).The progression from Tier 1 to Tier 3 has been streamlined since the game release but is still quite a chore to slog through, especially since at this point in the game you are unlikely to have encountered a single human player. Guardian runs are nearly impossible to solo as a new player and will basically be unplayable as there are no human players to run them with. Chaos dungeons are just braindead solo instances where you mash as many buttons as you can to kill as many mobs as possible while picking up loot. You will log in to do your dailies but once your dailies are done, your vertical progression for the day is capped and there is nothing you can do except wait for the next day for your dailies to reset.For the next 50-100 hours you will slog your way from T1 to T2 and T2 to T3 by doing the same repetitive daily routine of chaos dungeons, fetch quests, and kill quests. The whole time you won't meet a single real human player until you reach T3. But T3 is also where the real grind starts. You thought what you were doing up until this point was repetitive and boring? Nope, you're in for the grind of your life. This is also the point at which the predatory pay-to-win mechanics of this game start to show. Upgrading your gear is RNG-based, and as you go higher not only does the chance of succeeding drop significantly lower, but the cost of each upgrade attempt skyrockets to the point that farming your dailies on a single character will not be enough to make any sort of meaningful progress in a reasonable timeframe. You will have two choices at this point: 1) create alt characters and push them to T3 so you can farm more dailies on each character (daily rewards are per character, not per account) to get more materials to upgrade your main character; OR 2) pull out your credit card. Most players will do a combination of both, resulting in them not only spending an unhealthy number of hours playing the game every day but also an ungodly amount of money on the game just to overcome the artificial barriers put up by the devs preventing you from participating in the best content that Lost Ark has to offer, which is the Legion Raids.By the time you progress far enough in the game to meet the minimum requirements to run your first legion raid, you'll find that nobody wants to take you because the majority of players in this game are already far ahead of you and don't have the patience to teach you the raids, which are actually quite challenging and require you to fail a few times so you can practice. After all, the players that still play the game at this point are hardcore gamers who have 20+ alt characters that they need to farm dailies on every day, so every minute that they spend teaching you and not farming their alts is a minute where they are not making gold. The barriers to playing the most fun content in this game are so high that it is impossible for anyone to surmount them unless they play with a large dedicated group of friends or are willing to empty their entire bank account.If you still have not quit the game by now you will most likely be forced to when AGS (the publisher of Lost Ark) permanently bans you for violating their code of conduct. The ban will happen randomly and without warning, your appeal will be automatically denied, and no explanation for the ban will be given. This is because Lost Ark has the worst infestation of bots and RMTers that possibly has ever existed in an MMO up to this point, and AGS is so incompetent that their efforts to lessen the problem have only ended up making things worse. Legitimate and innocent players get banned on a daily basis while blatant RMTers who have been around since the game's launch stream themselves buying out the entire Lost Ark economy in broad daylight and still go unpunished. All of your time, effort, and money invested in the game gone in an instant with no chance to get it back.By all means, try this game out but don't let it hook you in. It's worth a few hours of your time but nothing more.\t\t\t\n", "\n\r\n\t\t\t\t689 people found this review helpful182 people found this review funny\t\t\t\t47\n\n\n\n\n\n\nNot Recommended\n233.8 hrs on record\n\n\n\n\nPosted: 14 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorst community in gaming. Everyone you match with acts like the fate of the universe hangs within the balance of finishing a raid in 2 minutes flat and not 2 minutes and 15 seconds. It's as if they have something super important to do afterwards like play lost ark for the next 14 hours straight while seething/hating every second of it.\t\t\t\n", "\n\r\n\t\t\t\t5,125 people found this review helpful81 people found this review funny\t\t\t\t587\n\n\n\n\n\n\nRecommended\n2,101.3 hrs on record\n\n\n\n\nPosted: 14 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAs someone who has played the RU version for 1000hrs+ and have leveled two characters legit and boosted 8 of them (to 50) my two cents about the topic:+ The game is a fun journey from start to the endgame. The leveling process gets a bit dull, but on your first character it's manageable.+ The start of the endgame is quite fun. When you first hit 50 there's a lot 'island quest' storylines to complete, reputation quests to unlock, new guardian fights/new dungeons/new raids to experience, some 'sea events' and other 'timed events' to check out. Progression feels pretty good and smooth (until you gear gets around +9, the +10-+15 upgrades are significantly 'harder' to succeed => More fails => More costs => Way slower progress).+ The equalized arena PvP is fun although very CC-heavy and takes a little learning curve to get into. However the rewards are quite poor beyond the 'weekly' ones, so unless you are really into PvP you probably won't spend a lot of time playing it. The ranked PvP is only TRUE SOLO QUEUE, so no premades (which is pretty fun for solo players!).What does this actually have to do with potential P2W and 'forced alts'?+ Kinda tricked you with the topic. The game is a fun journey even before you need to think about spending.To the actual topic:+ Once you hit your first progression wall (starting from +9 / +10 upgrading) you'll start to see yourself being handicapped by various resources. It might be materials (drops from limited daily dungeons/daily quests etc.), it might be shillings (daily dungeon/daily quests/'limited' cube dungeon), or it might be gold (weekly dungeons/weekly raids/weekly quests). To get through this wall you'll either need to just take it slow (log-in and do your daily/weekly things) or go faster (start making alts that allow you to farm more of the aforementioned) or go super fast (start top-upping with $/€'s and turn that into gold to get the resources needed for the upgrade gamble).+ 'Taking it slow' is around 1-2 hours each day for your 1 character+ 'Going faster' is around 1-2 hours each day for your 1 character + 1-2 hours or so per WEEK per alt character+ 'Going super fast' is only limited by your bank account <- beware though getting to 'max gear' as soon as possible removes many gaming goals you might have when 'taking it slow' or 'going faster'Now there are other monetizations that boost your progression in various ways but these are laid out in other posts and are not that significant. Basically with 50$ you'll get all the permanent things you'll ever 'need' and then you have the option of running the recurring 'crystalline aura (sub)' for extra benefits. The only thing I'd raise as a 'must-have' is the pet which is around 5-10$ and it's ACCOUNT WIDE, so you'll only need one of them. The reason for the pet is auto-looting, which is a major convinience for your daily dungeon running (the pet picks up the constant loot pinata from the daily dungeons instead of having to run around furiously smackin the loot button). Pets are also given out through events so you are likely to get one for free sooner or later.TLDR; The game is a fun journey from 1-50 regardless of whether you spend a single dime or not. When you get to the mid-late game (of the current patch) you'll either take it slow (1 character), go faster (alts) or you go super fast (spending $/€'s). \n", "\n\r\n\t\t\t\t2,137 people found this review helpful78 people found this review funny\t\t\t\t267\n\n\n\n\n\n\nNot Recommended\n3,749.7 hrs on record\n\n\n\n\nPosted: 27 December, 2022\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI know what you're thinking, \"Dude, you played the game for almost 2000 hours, how can you not recommend the game?!\" Well, that's the funny thing about this game. You don't really realize what you're getting into until you reach the true endgame. I'll try to be brief and precise about the important issues. First off, the game is fundamentally pretty damn fun. The combat is fun and the visuals range from pretty good to gorgeous. There are plenty of systems that are kind of annoying and there's certainly lots of rng and things to grind at in the game, sometimes frustratingly so. But where I really hit a wall and felt my will to continue completely fade away was the endgame upgrade system. This is where most people realize just how pay-to-win the game is.I reached ilvl 1475 on my main with relative ease, all things considered. I was happy about that considering the extremely low success rates. But once you get into raiding and acquire some relic gear, this game becomes very punishing.. but not the good kind of punishing, the kind of punishing where you can almost hear the sound of laughter coming from somewhere. But, it isn't coming from your friends, or other players, no, it's coming from the devs. They're laughing at you. \"Look at this loser\" you hear them say, \"he failed his 60% chance to upgrade his relic quality, and when he got it the second time, it only went up by 2%. HAHAHAHA, what an idiot\".Now I could clarify, but it would take forever. Just know that this is just one of many upgrade systems in the game, and it's very expensive and very depressing. Plus the game wants you to do this for several pieces of gear across all your characters. Having multiple alts is also encouraged to help aid your main with materials and gold. Unless you completely whale this game and spend thousands of real dollars each month, you will struggle without alts. This makes the game quite repetitive after a while too. The last thing I want to talk about is one of the many currencies in the game called Pheons. This straight up made me quit the game entirely. If they removed it, I might consider coming back. I remember saying to myself \"Instead of subjecting myself to this, how about I just don't, quit, and live a happier life?\" So I did.. at least for a while, i'll explain at the end. I don't think the devs realize how much this currency is destroying their player retention...Basically, Pheons are a currency that you need to purchase most things and ALL important things on the player market/auction house. They are VERY expensive to purchase outright in the store, and the devs give out insultingly low amounts on rare occasions. You need a lot of them, You will always need them as the game gets updated. Dealing with this currency made me feel like someone had their hands around my neck, squeezing just hard enough to keep me alive.In conclusion, I didn't like how this game made me feel anymore. Pheons and just thinking about cutting an ability stone make me want to alt-f4. Overall, this game started to feel like I was dredging through an alleyway full of heroine addicts trying to sell me some smack and hang out with them. ♥♥♥♥ that. Admittedly, I still fire it up from time to time to enjoy some combat, but I could never take this game seriously the way it is.Oh, and the game's bot problem is severe and will probably never be fixed.*edit: Just wanted to add some more context to this. At review time, I hadn't played for 3-4 months. I played a little bit more recently to check in on things, try out the new classes, and check out new skins. The economy appears to be getting worse though. Gold and prices on the auction house have more than doubled, Pheon's are still in play, items are becoming more scarce, bots are still everywhere, and island instances are completely dead. I want to play this game, but It's not worth it. As new games and MMO's come out this year, I imagine more people will leave and move on. Thanks for reading.\t\t\t\n", "\n\r\n\t\t\t\t1,322 people found this review helpful27 people found this review funny\t\t\t\t168\n\n\n\n\n\n\nNot Recommended\n2,003.0 hrs on record\n\n\n\n\nPosted: 2 October, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI’m going to write this review in the hope that new players gets a basic understanding what they’re gonna get into. At the time of writing, I stopped playing the game almost 2 weeks ago. Today I logged in to take a snapshot of my character screen (like a souvenir) then I uninstalled. This is going to be a thumb-down from someone who have spent 2,000 hours in this game... yeah, I’m going to be *that* kind of person for once.Lost Ark is a game that gives you a lot of thing to do but you’re not going to particularly enjoy it. If I have to give an honest opinion about how much I enjoyed Lost Ark in the 2k hours I’ve played, I’d say maybe 20% was fun while 80% was a waste of time. The game WANTS you to waste that time so that you get to the good part.Reminder: I’m writing this for NEW PLAYERS. So, existing players who gonna read this and comment (I won’t disable comment, criticize within reason) just keep in mind that your/our experience from launch and the experience of someone new today is going to be a stark contrast.The story is just your average MMORPG shtick. Very likely you’re going to stop paying attention at the poor English localization half hour in the game and you’ll start mashing your G key (thus the meme you might have seen already). You’re going to press G for the next 12 hours or so if you’re fast and you don’t get too sidetracked. Else you’re looking about 15 hours of G-spamming.The story is not compelling, you get an occasional cool cutscenes which pretty much tells you everything you need to know then you are sent on your way to do the tedious of story question: Go to X, speak with this NPC, spend 1 minute to go to Y, Speak to this NPC, go back to X and speak with that NPC again, rinse and repeat ad-nauseam.You do the above for 12 – 15 hours before you hit “Tier 1 gear” at which point you start shifting in what’s gonna be your daily routine for the rest of your Lost Ark career.The progression from T1 to mid-T3 is going to be brutal for you. It’s a dead zone, YOUR dead zone. There’s only bots wherever you’re going and the content you can do barely has players to help you with. This is literally going to be a phase where you’re going to spend roughly the next 100 hours (realistically it’s going to be closer to 200 hours) to get in a decent spot in T3. “Decent spot” is an always moving target as the game gets new content and the playerbase keeps moving forward. How tedious it’s going to get there all comes down to how merciful (or in touch with the playerbase) the dev is feeling is feeling at that time.As you settle in your daily routine, you’re gonna realize how much RNG is involved in various aspect of the game and how much of it purely waste your time in a way you’re not going to enjoy. Imagine an important item locked behind a collectible that have a low chance to drop three times every week. You might get it on your first try, you might end up getting it on your 20th week (it’s a thing: ask anyone about the “Moake” hell and how group of friends gets their item drop while others are still left behind after 3 months still killing the same boss).Gold is going to be your most valuable currency but the one you farm is going to have trash value. Why? Bots. Oh that Schoolgirl skin you see people walking around in? You can get it in the cash shop for $40 OR you can spend 45,000 gold to purchase it in the auction house. What? You’re only making 3,000k gold week? Well, tough luck! Save for 15 weeks and hope that inflation, caused by the disgusting amount of bot, is not going to make the price rocket to 60k by the time you get your 45k. Oh, you can’t even save that gold because you actually need it to hone your weapon, armor, to purchase mats, to buy dungeon/raid chest, etc, etc. Guess you’re out of luck!Bots are rampant. About 4 months ago, I thought bots were at the worse point (looking at the price of RMT) but oh boy how wrong I was. RMT price is currently half of the price of what I thought was the worse point 4 months ago. What does that mean? The current of the game in terms of botting/RMT is TWICE as worse as the time that I thought it was worse. Inflation is at an all time high.If you still manage to push through all these barriers and somehow manage to get your character high enough for the end-game raid content then congrats! Also; tough luck. No one gonna take you in their raid. The game is such a huge time sink that there’s very few who are willing to spend the time to fail with you in a raid because you WILL fail and you HAVE to fail to learn but the likeliness of having 7 other people who are either happy to teach you or fail with you is so low that you’re going to be spending quite sometime in the party finder just to go nowhere.This game was fun back when it launched. Having a huge group of actual people running beside you in-world was such a breath of fresh air. It was fun, everyone was learning, everyone was talking. The current new player experience is a dead zone that I don’t wish upon anyone. The end-game is brutal once you reach it not because of the content difficulty but mostly due to how you’re going to get filtered out. Everything in between is a huge waste of time aimed at squeezing play hours from the players.\"Lost Ark respect your time.\": So we were told, turns out it doesn't.\"Lost Ark is alt friendly.\": When the game foundation is built upon having multiple characters, this statement is far from the truth. There's so much things to do to make this game alt friendly but dev outright refuse. One of the biggest offender is materials such as Shards which are character bound. If this was an alt friendly game, Shards would never be bound. Neither Guardian/Destruction/Leapstones would have been bound.Lost Ark doesn't respect your time and is possibly one of the worse case of botting I have ever seen in an online game.\t\t\t\n", "\n\r\n\t\t\t\t654 people found this review helpful12 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nNot Recommended\n3.5 hrs on record\n\n\n\n\nPosted: 14 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGiving inactive users game bans that show on your profile (lucked out and saw it was happening before I received one, but have seen the screenshots). Game removed from my account, terrible business practice.\t\t\t\n", "\n\r\n\t\t\t\t613 people found this review helpful17 people found this review funny\t\t\t\t68\n\n\n\n\n\n\nNot Recommended\n5,510.4 hrs on record\n\n\n\n\nPosted: 2 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLobby/Gatekeeping Simulator. Rushing content to catch up to Korea was such a great idea. Look at the player base from when the game was released to now. Support drought, gatekeeping, the toxic environment, the works. If you plan on starting this game now, don't. Endgame has become a circle jerk of the 1%, competing for MVP status and who has the shinier weapon. Unless you're friends with one of these guys, do not expect to get accepted anywhere. This is coming from a solo player (no static or interaction with guilds) that's spent a fair chunk of time and ended up with above-average gear. I'm not entirely \"juiced\" but I can guarantee I'll get into lobbies faster than 90% of players. However, even with the gear that I have, I can still get gate-kept. Only because I haven't spent thousands of dollars to over-gear beyond the requirements for raids, so that they become a mindless damage-dumping fight to skip mechanics. Raiding used to be a fun experience at first but it's become a repulsive environment just to get raids done \"fast\" and move onto the next alt. I'm not feeling burnout, I'm just not as motivated as I used to be when I started.Server merges will not fix anything. Side content has become a joke. This game will literally have to become your part-time job. It will only get worse if Amazon/SGS doesn't do anything about it. Unfortunately this review will just get buried among the other reviews, maybe even along with the game eventually. Life expectancy for Lost Ark; no longer than a year. Turn around and don't look back.Thanks for coming to my TED Talk.\t\t\t\n", "\n\r\n\t\t\t\t2,081 people found this review helpful213 people found this review funny\t\t\t\t174\n\n\n\n\n\n\nNot Recommended\n17.3 hrs on record\n\n\n\n\nPosted: 14 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHOW ARE YOU GONNA ISSUE A GAME BAN THAT APPEARS ON MY PROFILE FOR NOT PLAYING THE GAME???????????????????LMAO??Update: submitted a ticket to appeal my ban and finally got it removed using this link https://www.amazongames.com/en-us/support/lost-ark/contact-us \n", "\n\r\n\t\t\t\t888 people found this review helpful17 people found this review funny\t\t\t\t57\n\n\n\n\n\n\nNot Recommended\n2.7 hrs on record\n\n\n\n\nPosted: 14 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDO NOT ADD THIS GAME TO YOUR STEAM ACCOUNT.If you try it out and decide you do not like it, there is a risk they will issue a VAC Ban to your Steam account because your account as low playtime and is \"at risk\" for potentially being used by bots. There are thousands of unwarranted bans already hitting players who have not played in months. Do not ruin your ability to play other games on Steam by risking playing this!\t\t\t\n", "\n\r\n\t\t\t\t999 people found this review helpful49 people found this review funny\t\t\t\t78\n\n\n\n\n\n\nNot Recommended\n782.4 hrs on record\n\n\n\n\nPosted: 29 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have read stories about people getting false bans, but never thought it would happen to me until it did. Got perma-banned for \"cheating\", tried to dispute it, they wouldn't tell me the reason and sent an automated email response instead. I have never cheated (I don't even know how?!) or bought gold or anything. I've just been playing everyday, enjoying with my family and my boyfriend. I even recently decided to support the game and put in real money to buy skins.The fact that they took my money and then banned me a couple days later for no reason is enough to turn me off from this game. If anything, THEY are the ones committing fraud, not me... It makes me really sad because I only got to enjoy having my character wear a cute pink swimsuit for a couple of days. :(Also this game is not friendly to new players (hell, I've heard even new players are getting banned for no reason). I have a lot of hours, but I didn't play the first couple of weeks when it was released and I still feel behind. Imagine just starting the game now. The beginner areas are all full of bots and some co-op quests that new players need to do are all devoid of any players. (Gesbroy is the worst),Thanks AGS for robbing me of my money and my happiness. It sucks that they're the publishers because the game itself is really great. The graphics are nice, I generally enjoyed the story line, and was enjoying the horizontal gameplay (mokoko hunting is the most satisfying thing). It's just sad that this is happening to innocent players. Take this from an avid player who tried her best to contribute positively to the community: Save yourself the heartache and don't invest as much time into this game as I did, only to get abandoned and treated as a criminal and a number. </3\t\t\t\n"]