["\n\r\n\t\t\t\t1,350 people found this review helpful130 people found this review funny\t\t\t\t44\n\n\n\n\n\n\nRecommended\n261.8 hrs on record\n\n\n\n\nPosted: 7 October, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta free battle pass where all the new cosmetics arnt gone forever at the end but insted put back into the gamee???!! what r these devs thinkingg they obviously didnt get the memo to be a greedy company that wants all ur money smhh\t\t\t\n", "\n\r\n\t\t\t\t660 people found this review helpful17 people found this review funny\t\t\t\t112\n\n\n\n\n\n\nRecommended\n127.1 hrs on record\n\n\n\n\nPosted: 14 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRock and Stone, reader, take a moment to read my review : In an era of unyielding greed where publishers release half-arsed games with day-one DLCs, an era where graphics are put before gameplay, an era of toxicity where people are just after their high score and shiny cosmetics - comes one of Steam's most underrated games : Deep Rock Galactic ! Yes I dare say Underrated !A game where you dig ore, and fight bugs . Simple as ? There is plenty of variation, and the developers make sure to periodically add something new to the mix - something new that is not behind any pay-wall or trickery.The moment you buy the game, there is no need to pay for anything else, unless you want to support the developers and get some tasteful , world-coherent cosmeticsGhost Ship Games have created a gameplay loop that is simplistic enough to follow , yet compelling enough that it does not get repetitive . Ever been into one of those co-op games where if one person has the wrong item or load-out, everyone loses ? Well not here, all builds are viable - no cookie cutting required, just point at the bug and shoot at it simple as .These people have put quality and community first and foremost But the most beautiful thing about this game is one simple thing, one thing that I have never seen in an online game in a long time and never to this extend : Cooperation ! You have never seen a game where strangers will work together and help each other quite like this . It's as if going back to the first days of a MMORPG where everyone is just glad to be there and glad to fulfill their roleIn the deep dangerous depths of Hoxxes, you aren't just the employees of a mysterious interplanetary mining corporation, you are not just strangers on a job - you are Brothers You must have played one of those mmorpgs where you just rush rush rush to the next objective ! Next marker, next checklist, next SHINY - when was the last time you danced and slammed ales with your brothers just for the fun of it ?! Well in this game, that is what you do bestThis \"silly game about dwarves\" has more soul into it than most games released within the last ten years , here in the big cold web you can find friendship .If you decide to buy this game, be sure to be the dwarf you wish to have at your side ! Here dear reader, you will find friendship.Be the Dwarf that Karl would approve of !\t\t\t\n", "\n\r\n\t\t\t\t925 people found this review helpful11 people found this review funny\t\t\t\t60\n\n\n\n\n\n\nRecommended\n470.0 hrs on record\n\n\n\n\nPosted: 28 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tImagine paying less money for infinitely more content than most games deliver in their entire lifespanImagine a company supporting a game years after launchImagine premium cosmetics being the only paid DLC in the game, and even those are dwarfed (literally) by the cosmetics in the game for freeImagine a developer truly caring for it's fans and the game they create, all while delivering one of the best coop games I've played since L4DI was happy knowing that Redigit seems to love Terraria just as much as I do, and I never thought I'd see another developer show such respect and love for their gameLuckily I was wrong, and I will happily continue to be wrong so long as Ghost Ship will have meSeriously: buy this gameI've bought dinners more expensive than this game, all to have far less fun\t\t\t\n", "\n\r\n\t\t\t\t795 people found this review helpful64 people found this review funny\t\t\t\t195\n\n\n\n\n\n\nRecommended\n211.2 hrs on record\n\n\n\n\nPosted: 18 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have played this game for a long while with friends and enjoyed every moment of it.My wife, who is new to gaming and generally does not play any type of FPS saw us playing this and was curious about it, so I decided to gift it to her on steam to see if she would enjoy it. I fully expected her to play it for about one or two missions and lose interest, as she generally does not have the knack for playing games that require focus and she doesn't enjoy games that have a gathering aspect.She chose Gunner, loaded into the game and proceeded to unleash hell on bugs, and on our entire team in the process. While she doesn't understand what's going on most of the time, she loves shooting the bugs and always gets excited when Mission Control yells \"SWARM! It's a big one team!\" laughing maniacally as she lobs sticky grenades all over the place. I have made sure that she unlocked the friendly fire perk to try and mitigate the damage she does to her teammates.I have always found this game to be incredibly fun, but now, with my wife in the game, it's hilarious. It's heartwarming to see her enjoying herself and having her come home from work and look at me and ask \"space dwarves after dinner?\" Thank you so much GhostShip for making a game that everyone can enjoy,\t\t\t\n", "\n\r\n\t\t\t\t837 people found this review helpful503 people found this review funny\t\t\t\t74\n\n\n\n\n\n\nRecommended\n277.5 hrs on record\n\n\n\n\nPosted: 26 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've made 4 people buy this game and gifted it 3 timesStill playing solo\t\t\t\n", "\n\r\n\t\t\t\t1,071 people found this review helpful22 people found this review funny\t\t\t\t97\n\n\n\n\n\n\nRecommended\n143.4 hrs on record\n\n\n\n\nPosted: 9 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFor the many issues that other video games may have, DRG has a solution:  Other Games (Problem) Deep Rock Galactic (Solution)   Bored in lobby while waiting for someone Entertain yourself by getting drunk, dancing, kicking barrels, and/or playing Flappy Bird Jetty Boot, all in-game.    Unbalanced classes Classes are balanced and all are similar levels of fun.   My life is already too hard and I want to do something easy. Change the hazard level.   Each round is too long/short. Missions vary in length—you can select one that fits your needs.   Too repetitive. Procedurally generated maps. Multiple biomes with unique flora and fauna. Many different mission types. Mission modifiers (“Warnings” and “Anomalies”). Seasonal events and updates.   Communication with others is too cumbersome. Laser pointer takes care of many basics, like (“go here” or “mine here” or “resupply here”). Often accompanied by relevant voice lines. Of course, you can still type or use voice chat.   Singleplayer is too lonely or too unbalanced. Bosco.    No cosmetics. Plenty of cosmetics. There’s enough there to where you don’t need to spend real money.   Doesn’t fit on my hard drive/SSD. Requires only 3 GB of storage.   Created by a big corporation that:1) Doesn’t care about its players2) Exists for the sole purpose of generating as much profit as possible Developed by a small team that genuinely cares about the game and its players. They are incredibly open to community feedback and have delivered many updates with loads of new content. No ♥♥♥♥♥♥ cash-grabbing pay-to-play mechanisms. Highly recommended.\t\t\t\n", "\n\r\n\t\t\t\t906 people found this review helpful12 people found this review funny\t\t\t\t66\n\n\n\n\n\n\nRecommended\n888.1 hrs on record\n\n\n\n\nPosted: 20 October, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIn a world full of cash-grab AAA titles and half-baked indie ideas, Deep Rock Galactic exemplifies what can happen when a group of talented and passionate people come together and decide to redefine the industry standard of multiplayer co-op shooters.There is a...heart to this game, and its developers, that becomes immediately apparent once you've spent any amount of time in their universe. A fair amount of collectibles exist merely to be brewed into beer, most of which provide no function beyond being silly and entertaining. Management yells at you to stop kicking around (achievement-related) barrels while in the pre-game lobby. After failing a mission, you respawn in a hospital gown and can choose to embark upon the next mission in that getup instead of your usual colorful raiment. The choice is yours as to whether you pet docile, loot-containing bugs...blow them up...or both! There is a button specifically for yelling nonsensical and camaraderie-inducing voice lines.Beyond all of this lies a surprisingly well-balanced framework for your experience in-game that can be tweaked in a multitude of different ways, catering both to those who enjoy a more casual cooperative experience, as well as those who have a deep-seated masochistic streak! With hundreds of hours' worth of functional content to unlock - and even more cosmetics - this is one of the few titles I would deem truly special, and worth just about everyone's time.If you've friends that play? Hop in, grab a beer both IRL and in-game, and you'll have the time of your life. If you don't, well, DRG's community is one of the most wholesome and entertaining that I've experienced in decades of online gaming.\t\t\t\n", "\n\r\n\t\t\t\t479 people found this review helpful8 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n1,024.2 hrs on record\n\n\n\n\nPosted: 11 April, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUPDATED FOR 2023My review is lengthy, so I'll preface my paragraphs with a TL;DR:1. Can I have fun on Day 1? Yes. Jump right in. From Haz 1 to Haz 4 you can succeed with no upgrades or leveling.Just use good teamwork.2. How's the shooting?Most excellent. Some of the most satisfying gunplay I've experienced in years as a shooter-game guy.3.Difficulty?Fair and skill-based. You won't be out-leveling your foes with raw stats here. Aim well and PAY ATTENTION to your environment.4.Classes?Well balanced and uniquely fun.5.World?Incredibly varied and gorgeous. You'll need to learn a bit of platforming to figure out your next jump. Do it quickly, the horde approaches!6. Enemies? As varied as the environments. All dangerous. All fun to shoot. 7. Missions? Enough to keep things interesting and challenging in their own right. 8. Levels, upgrades, grind, and endgame?Leveling is decently fast, and you unlock the fun stuff at a respectable pace as well.You'll acquire everything you want at a decent pace that rewards you adequately for your time. Endgame missions (Deep Dives) are a fun test of personal prowess and your skills as a team!Even after acquiring everything, they remain a fun test of your dwarven moxxy.There is an element of randomness to acquiring the coveted overclocks these missions grant, which can be vexing due to the large loot pool. The devs have implemented other ways to acquire them, and this issue of acquisition has been acknowledged. I don't believe these systems hurt the overall fun of DRG though. As for ways to spend your money further - there's a refreshing lack of GACHA and FOMO involved. There IS a Season Pass system, but it's entirely free, and what you don't unlock (you have several months to do it by filling a big XP bar) gets added to the random loot pool for you to acquire on your own time.Now then, on to my big sales pitch...What I love about Deep Rock Galactic is that this game lacks a lot of the trifling, tedious things most modern games like to throw at you. This isn't an endless quest of RNG loot grinding a la Borderlands. You can pick up and play this without fretting that you're missing out on a full season of shallow rewards, cash shop exclusives, and time limited gear that is only relevant for that month's balance patch.Day 1 presents you with four unique classes which all play differently, with unique guns and terrain traversal tools which synergize between each other to help you mine, dig, and hunt down your objectives. Yes, there is leveling, resource gathering, and upgrades in the form of loadout upgrades and dwarf perks. However, the quest to these is a steady, well paced adventure that encourages you to journey inside ALL biomes, each of which present unique obstacles to traverse. From Hazard 1 (easiest difficulty) to Hazard 4 (highest before unlocking Hazard 5) you can succeed with no perks, upgrades, or even an hour spent on any one dwarf. All you need is situational awareness, a non-toxic attitude, (really, the playerbase is great!) and good shooting.Which brings me to the most important thing - The gunplay is excellent! Every weapon feels and sounds good. You're often asked to aim not just straight ahead, but up, down, at every wall, even the empty air. The enemy is everywhere, and it is endless. A continuous, remorseless horde of jaws and fangs that come from nowhere, in forms as varied as the eerie, sodden, frigid, hellish, and irradiated landscapes you will struggle through to reach either the mission's end - or your own. It can't be understated how integral the terrain is to gameplay. These aren't just randomly generated tunnels with some dips and ledges to make things a little more interesting. The formulae at which terrain is generated spawns places both beautiful yet also steeply treacherous and labyrinthine. You'll need your wits to safely navigate these, and bravery when the swarm descends. You aren't just shooting your way out, you're thinking on your feet as you platform over gaping chasms and vault yourself over erupting fire pits, the horde behind you immolated on the spot where you just were by a magma jet. It's gripping. It's tense... But the pacing is kind enough to offer you enough quiet moments to appreciate the glowing grandeur of towering crystals and glittering salt spires you may freely climb. Best part is it's all destructible. Dig it out into a defensive trench. Drill yourself an escape tunnel to reach a lost friend. Bait your enemies into a meadow of explosive fungus flowers... Or fall to your death down a very, very deep hole. There's a lot of possibilities under planet Hoxxes that require you to adapt quickly and think on your feet with the tools and guns provided to you. Customization is fun. There's an in-game shop with NO microtransactions whatsoever. You spend the gold you earn and the resources you've mined to buy yourself new beards, armor suits, and even skin colors. Along the way the game will also reward you with shinies to uncover in the environments themselves. Cargo Crates to uncover weapon skins, lost helmets with coordinates to backpacks holding armor skins or cosmetic pickaxe parts. You aren't charged an extra dime for any of this. Only a bit of your time and courage. There are DLC packs that are purely cosmetic, and the soundtracks are quite good too! These don't impact gameplay and are just to support the devs!The endgame isn't especially hard to arrive at, but it does require you practice the good habits you've learned along the way. Team work, efficient terrain traversal, and good aim, in a series of longer missions full of double-objectives and heightened enemy spawns. The rewards are Overclocks. Perks ranging from mundane and convenient to lopsided and peculiar. These will either do boring things like increase your ammo - or make your glowing line of plasma spin around like crazy and cut up everything in front of you. They're fun but unnecessary. My advice? Don't treat the endgame like a grind to slog through. Don't look at your upgrades and cosmetics as a checklist. Take the Season as something to nibble on instead of power up.Experience the adventure. Revel in the solid core mechanics which make this an excellent shooter to dive into. Appreciate Deep Rock Galactic for what it is - an honest reprieve from a game genre filled with unrewarding tedium made to wring you of your dollars.\t\t\t\n", "\n\r\n\t\t\t\t517 people found this review helpful11 people found this review funny\t\t\t\t59\n\n\n\n\n\n\nRecommended\n548.0 hrs on record\n\n\n\n\nPosted: 19 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tso with Season 4 around the corner and Overwatch PVE basically cancelled, i would like to leave a review of One of the best shooters in decades.Deep rock galactic is nothing but a masterpiece, a incredible 4 player PvE with incredible lore, Gameplay, customisation  weapons and Dwarves. while everything about this game is awesome, i want to mention the best and most unique things about it.1. The Community, i think it is a fairly easy argument to that the DRG (short for Deep Rock Galactic) Community is one of the greatest, from our collective goals, to our inside jokes, our camaraderie and the never ending \"Rock and Stone!\", which anywhere you look on the internet you can probably find one dwalf shout that line with the most sincerity imaginable, from Green beards to Grey beards we are all working together and  have a nice cold pint, and wait for this all to blow over.2. is the meta, or lack there of; everything is use-able and viable, all classes equally picked, all weapons having usage, all grenades, another tid-bit about meta is how well all classes can work together, to execute unique plans or to turn the geneva convention in to the geneva checklist.3. class diversity, while this could fall into the prior category, i feel like it deserves its own point  all classes have strengths and weakness that other classes can make up and also strengthens their strengths, which you would think would be obvious but it can't be stated how incredible it is.4. Team work, its expected in a PvE but no mater what class, Green Beard to Grey Beards, team work is key to all missions and assignments.5. \"Battle Pass\"; A shunned word these days but i assure you that, in DRG we don't do Payed battle passes here, they are free and offer awesome looking loot and skins, these are all cosmetic and look awesome.Personally this game is a 9/10 if not 10/10Pros|- ROCK AND STONE!- Great gameplay loop- Incredible community - Awesome class dynamic - One of the best PvEs- Unique cave generation and Bug variety- Countless loadout combinations- Able to Tip Floyd the Bartender Cons| - Management doesn't know anything- Elven Spies?!?- A bit repetitive- Double barrel Overclock not buffed yet- People who dont Rock and Stone- Some cheatersNOTE: Since battle passes are free, that doesn't provide Ghostship Games with much post game financial compensation, so if you do like this game and wish to support the devs, the DLC, it is complete customisation Whether your Green Beard or Grey Beard, Scout, engineer, Gunner or Driller; ROCK AND STONE TO THE BONE!\t\t\t\n", "\n\r\n\t\t\t\t664 people found this review helpful94 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n266.8 hrs on record\n\n\n\n\nPosted: 11 November, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLmao. There are gigantic companies producing multiplayer games that cost hundreds of millions of dollars for development time and marketing, and this $25 early access game about mining and killing bugs as a dwarf is the best co-op game I've played in years.Review Update a year and a half later: Tons of updates and a couple hundred hours in and still one of the best co-op games to date. One of my favorite games in general for sure. I just bought a round of beer for my team that made us shart ourselves, then bought another round of beer that made us explode forward like rockets. So we were all flying/exploding around the space station while sharting and yelling ROCK AND STONE to each other while techno played from the jukebox at the space bar. We then threw our mugs at each other, kicked a bunch of barrels into each others faces, slapped the fuzzy dice hanging on the dash of the huge drill drop pod thing you go down in, go out into our cave and immediately die from a gigantic detonator just to go back up and get drunk all over again.2021 Update: ROCK. AND. STOOOOOOOOOOOOOONE.\t\t\t\n"]