["\n\r\n\t\t\t\t3,680 people found this review helpful78 people found this review funny\t\t\t\t727\n\n\n\n\n\n\nRecommended\n322.0 hrs on record\n\n\n\n\nPosted: 26 October, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tJust thought I'd help out with peoples frames by this review, use this command r.VolumetricCloud 0 it removes the clouds, you'll be looking at double the frames, and you can use r.Streaming.PoolSize 0 (unlocks ur whole gpu memory)r.Nanite.MaxPixelsPerEdge 4 (reduces triangles for nanite meshes)r.Lumen.ScreenProbeGather.RadianceCache.ProbeResolution 16 (optimizes lumen)r.DynamicGlobalIlluminationMethod 2  (disables Lumen)r.VolumetricCloud 0 (disables volumetric sky)r.ShadowQuality 0 (disables all shadows)these will help with frames but beleive me, removing the clouds is a frame changer, good luck peeps, also I have 7900XTX 7800X3D cpu and ddr5 6600mhz ram and i get about 90-100 frames on medium-high and when i just remove the clouds i get 190, I've also said the same to tribemates who have alot worse cards and its doubled their frames, hope this helps!\t\t\t\n", "\n\r\n\t\t\t\t2,387 people found this review helpful43 people found this review funny\t\t\t\t365\n\n\n\n\n\n\nNot Recommended\n411.7 hrs on record\n\n\n\n\nPosted: 20 November, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI love this game with everything in me. Honest to god, its one of my favorite games of all time. I have ADHD, and so it can be hard for me to stay interested in a game for a long period of time, but not this one. I can easily sink hundreds and hundreds of hours into this game and it'll always be so much fun. However, there's a serious issue that needs to be addressed. Greed, and Laziness. The developers are fairly lazy. There's bugs in the game that have existed for many many years now. The same bugs in the old game, on the new one. If they built it from the ground up again, how could that be? It seems to me like they got lazy, and started copy and pasting code or something. If you're not sure the remake is worth 40$, rest assured, it isn't. Unless you have a really powerful computer, you're gonna have to end up playing on low settings anyways. A remaster with the same bugs and issues, years and years later. How can you call that a remaster? Disgraceful. We also have to talk about the greed. While i still feel wildcard is greedy, i don't think they're actually that bad. The real problem is their parent company snail games, as well as their server provider nitrado. Snail games is incredibly greedy. They please their shareholders by making pump and dump survival games, that they always eventually abandon. Ark is their golden goose. Its the one they put the most care into upholding. Yet they still ♥♥♥♥ in everyone's cereal, constantly. Don't forget that this remaster was going to be free. There's even been fiasco's in the past where snail games employees get raided, and they just ban the people who raided them off of the official server network. However the greediest of them all, is 100% without a doubt nitrado. Basically to sum it all up, wildcard was in debt and needed servers. Nitrado offered to loan them servers, but they wanted to exclusive rights for server hosting on Ark Survival Ascended. Wildcard obliged, and so now nitrado holds a complete monopoly over server hosting. The CHEAPEST server you can buy is 25$ a month for 20 slots. If you know anything about renting servers, you'll know thats pretty abhorrent. Thats incredibly expensive for servers that run like absolute ♥♥♥♥♥♥♥ anyways. Constant Rubber-Banding, teleporting all of the place, rollbacks, insane amounts of lag so much so offical network is literally unplayable for me right now. I'm supposed to live about 150 miles away from where the server is hosted, yet i always get 150 ping on NA servers. Its atrocious. I know snail games will never change their greedy ways, but i can at least hope the server hosting situation gets sorted because at this point i can't afford to host a server for just me and a few friends. And even if i could, it would suck anyways. If you wanna buy it, i totally get the appeal. But do not support this kind of behavior. Wait till its on sale, or the issues have been fixed. I love Ark, it just deserves better management.\t\t\t\n", "\n\r\n\t\t\t\t1,373 people found this review helpful176 people found this review funny\t\t\t\t120\n\n\n\n\n\n\nNot Recommended\n275.0 hrs on record\n\n\n\n\nPosted: 15 November, 2023\nProduct received for free\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI really like that they kept the nostalgia of every single bug from ark survival evolved, takes me back.... like way back all the way to how the game was in 2015 :3 how kind!!- Dung beetles still fall through foundations into the rocky abyss- The alpha and large dinos will still phase through and become one with your dinosaur, trapping them, mauling them to death while all you can do is whistle desperately and cry as they die in front of you.- Official servers still crash and roll back every 15 minutes after playing for 15 minutes so you get to play even more! :)- Official servers also still stutter and lag like i'm stuck in 2015- Dino 'follow' AI still makes me want to scream violently - Fatal Error x 100- Nothing is decaying fully on official so there's thatch and abandoned bases everywhere that no-one can do anything about- Volumetric clouds and fog cannot be turned off in settings so you have to use ~ - Optimisation? no.- The new dino tracking system is just so bugged, i cant get rid of tracked people and the icons fly around the map constantly or theres double icons.- As i was writing this my ptera on follow just clipped through someones base i sat on to gain stamina safely and is now one with their base, trapped, ripped from my arms and into the base of a random. and im sure theres many more i can find if i just play the game for 10 minutes more.This unreal engine update was supposed to be a free upgrade to those who purchased ARK. Then they went back on their word and said they wanted it to be sold for $90 bundled with ARK 2. Then changed their minds again and are selling it for the current price minus ARK 2. We're on track for all expansions to be also, paid content YIPPEE!For a studio that's made well into the millions and still wont fix problems i've been experiencing since 2015. thats a no from me chief. Don't buy this. Glad I got this as a gift, part of the reason i enjoy this game is because it has the potential to be an amazing game to play if they just you know, fixed 6 year old bugs idkEdit: -People can still force crash servers using rocket launchers to roll it back. -If you go into the Alpha dragon fight its invisible and you're stuck there waiting for the timer to count down and everything to die.- People who are not in your tribe or alliance can still sneak into the boss fights with you, raising the difficulty multiplier and waiting for the boss rewards to spawn to steal them ;)\t\t\t\n", "\n\r\n\t\t\t\t3,459 people found this review helpful67 people found this review funny\t\t\t\t381\n\n\n\n\n\n\nNot Recommended\n56.5 hrs on record\n\n\n\n\nPosted: 26 October, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tIt's a shame, but it's in a pretty awful state currently.NOTE: I am going to try and come back to this review as I play more, and update it with the things I do/don't like.It's probably going to be pretty messy but I hope it helps some of you.EDIT 1: Okay, so as it turns out this game is actually even more unplayable than I thought. In 3 hours I have crashed about 7 times, I've updated my graphics drivers and I like to think I keep my PC in overall good health so I can only think it is to do with the game rather than my PC. This game seems incredibly unstable. Playing alone and spamming saves whenever I remember seems to be the only way I can get anything done - because otherwise I will crash and lose all progress from when I last saved.EDIT 1.1: Okay so I haven't been crashing nearly as much anymore. I wish I knew what it was that stopped the crashes, but day 1 I was just getting loads and after a couple days it has improved significantly. Performance is still pretty ♥♥♥♥♥♥ and there are some performance bugs that are quite significant.EDIT 2: So after they released that optimisation patch it *has* helped, but still has a long way to go. I put together a spreadsheet of how much each setting impacts the overall performance.Spreadsheet[docs.google.com]PROS:The most fun I have had in ARK Survival Ascended so far was in the character creator, seeing how truly horrendous I could make my character look. The quality of the character is pretty damn good - although there are quite a few less options for some things now.The game looks phenomenal. Absolutely stunning, it's got to be one of the best looking games I have seen in terms of general landscape and lighting. That is if you can run it, but we'll get to that.The foliage and just all the details in general look really good. Global Illumination does a LOT of the heavy lifting in terms of how good the game looks, which is a shame because it seems to be the most demanding setting.I haven't had the chance to check them all out, but the new buildings look pretty incredible. I love the changes they've made to the style the buildings are in and it does a lot to make things look innately pretty rather than the less than appetising structures in ASE. Especially happy with the change to the wall height - making them square rather than the weird rectangles they used to be.The main menu re-design looks great and works so much better. More settings are exposed for hosting a server locally/single-player which makes it so so much easier to set up the rates and settings you want without having to outside of the game edit a .ini file.Although there aren't many yet, having mods built directly into the main menu and allowing them to be cross platform is great and really improves how easy it is to install/manage mods without messing around with the Steam Workshop's awful UI.CONS:Okay the elephant in the room - this game runs truly awfully. I was worried it was going to be the case, but hoping that all the incredible tech in UE5 such as Nanite would pull things together and make it run alright. But the minimum/recommended specs are a bit of a joke - and the fact it runs awfully even on a top end system from a year or so ago is beyond crazy. I'll leave some numbers below for those interested based on my PC.The in game UI looks good overall - but some aspects are a bit harder to read, and it overall feels a little slower/clunkier. Opening the inventory seems to take more time and that really adds up to be very irritating.Some settings really just seem to hog most of the performance. I can get the game in a pretty good looking state, but it will run at 35fps. If I change General Shadows from High to Medium, I immediately start getting 60fps. This is a shame, because having shadows on anything lower than High makes them look awful. Medium shadows just creates a very visible cut off radius around your character where no shadows are rendered, so everything in the distance just looks totally incorrect. But it's the difference between 30 and 60fps. There doesn't seem to be a way to raise the difficulty/max level past 150 currently. Maybe you can edit an .ini file, but there is no setting that you can change in the menus when setting up a world.You can increase the difficulty by going toC:\\Program Files (x86)\\Steam\\steamapps\\common\\ARK Survival Ascended\\ShooterGame\\Saved\\Config\\WindowsOpening GameUserSettings.ini and underneath [ServerSettings] add OverrideOfficialDifficulty=5The number can be anything, multiply it by 30 to get your max level. So 5 * 30 = 150. If you want max level of 180, use 6.I also can't find a setting to increase the number of dino spawns, I really haven't ran into many dinos.MISC:The new building parts are great, and a lot of improvements have been made to the building system. However I do still think that there are just some incredibly obvious pieces missing. Why are quarter floors added when there's no quarter foundation, or even a half foundation? You are able to place 2 quarter floors in the same square that a foundation would fit in - so surely adding in a quarter foundation which can do the same can't be that hard, right? It really limits the usability of them imo because it doesn't connect nicely to anything.Same with quarter size wall slopes. Maybe I'm the crazy one - but it seems that if you are going to add a building item such as a \"quarter size\" structure, it makes sense to add the entire set of items so that any one of them actually has something to connect to in a way that makes sense and fills gaps left otherwise.Overall - I really wouldn't recommend the game in it's current state unless you have an absolutely insane PC built within the last 12 months.Some rough numbers:For reference - I have a Ryzen 7 5800x, RTX 3080ti, and 32GB of RAM. The game is installed on an M.2 SSD. I run the game at 1440p.The following numbers in no way are a proper benchmark, they are just rough averages for where I happened to be in game at the time I was testing this - but it should give you an idea of what to expect if you run a similar system to me.Epic Settings - No DLSS - 1440p - ~15FPSEpic Settings - Performance DLSS - 1440p - ~25-30FPSMedium Settings - Performance DLSS - 1440p - ~40-45FPSLow Settings - Performance DLSS - 1440p - ~60-75FPSLow Settings - Performance DLSS - 1080p - ~70-75FPSThey've since released an optimisation patch that invalidates these numbers. Check the spreadsheet mentioned above instead for more detailed numbers.I know the game looks phenomenal but I really do think there is more to be done to make this game run better than it does. Most of the reason for the remake was the increase in graphical quality - and when most of your players, pre-existing or not, are not going to be able to use most of the graphical upgrades, it's a total waste and defeats the point.\t\t\t\n", "\n\r\n\t\t\t\t6,387 people found this review helpful2,458 people found this review funny\t\t\t\t709\n\n\n\n\n\n\nNot Recommended\n287.4 hrs on record\n\n\n\n\nPosted: 26 October, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI want to see the NASA pc that this game was tested on before releasing to the publicEDIT: Thanks for all the gifts everyone! Being that this got so much traction, I wanted to edit my review. Although at first the game was literally unplayable, after defeating the login boss and a couple updates later, ARK IS BACK ONLINE. The game has incredibly captivating graphics with a greatly improved depth of view in regards to brightness, saturation and detail. Countless improvements that I could list but I'm not getting paid for this.... needless to say: I'm back on the Ark grind. See you online >:)I would change to recommended, but you have to be a die hard Ark fan to put up with the bugs\t\t\t\n", "\n\r\n\t\t\t\t3,238 people found this review helpful106 people found this review funny\t\t\t\t550\n\n\n\n\n\n\nNot Recommended\n310.2 hrs on record\n\n\n\n\nPosted: 9 December, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI have been a faithful player of Ark (Evolved and now Ascended). I’ve logged over 18k hours on Evolved alone. I’ve always loved the concept of the game and it’s always kept me coming back for more. However, I just can’t recommend this game to anyone because of the developer team at WildCard Studios. I’ve never seen a studio so out of touch with their player base and just so blatantly disorganized and have absolutely no foresight at all. It has just become to frustrating that my tribe and I have finally given up. We’ve sat through hundreds of bugs, delays, unplayable servers, but after this launch it’s just been too much. We were ready day 1, and waited around all day refreshing on PC to be one of the “first” in and try to get a good location. We were lucky enough to get one of the best spots (herb island) on a official server (PVE). Wouldn’t you know it, some how the dev team enabled GOD MODE so anyone could spawn whatever they wanted in. After about 2 hours after launch, they did a complete rollback to day 0 and all was lost for us. By the time servers were back online, we had to log off and never had a chance at getting the island again. Immediately, all of the servers were capped (70/70). They didn’t make NEARLY enough servers for the amount of users attempting to play. It was an insane lack of planning that really makes you wonder how a decision like that could possibly be made. Almost immediately, the servers began crashing hourly. Generally speaking, the first few weeks of any map launch had smooth running servers. It was only after people were established and tribes built mega bases did server performance start to suffer. That wasn’t the case here, as the servers began crashing hourly with a 15 minute roll back over and over daily. Still, we suffered through it. Playing the game 30-40 minutes at a time and tried our best to plan around the inevitable crash and roll back just hoping eventually wildcard would find a solution. This went on for WEEKS with no real resolution. They then made matters even worse when they decided to implement a “join server queue system” that wasn’t really a server queue system but simply an auto clicker that was much slower than any actual auto clicker. This made all of their capped servers (which they all were) way harder to get into. Their logic was laughable, they wanted to save us on “clicks”. All they did was make us have to click more to get around a prompt that made the game even harder to access. The discord was flooded with users pleading to have it removed and of course nothing was done about it. It seems eventually the system works better than previously, although I’m not sure if that’s a case of less players actually trying to get into the servers. The next huge error (IMO) was when Xbox and PS5 launched weeks after release. Our server (Steam) was advancing well. There were hardly any places to build (This is official PVE pillar hell, mind you). We were constantly at server population cap. When Xbox released (and PS5 shortly after) our old server was FLOODED with these players looking to start fresh on a already overbuilt map with players at a much different stage of progression. Overnight, our capped server just become completely unplayable. The console players just kept joining, even though there were boosted “new” servers for them to play on. They kept saying that these servers were impossible to get into so they had to come to the older servers just to get started. It created a HUGE mess. All of the older servers were overrun in days and we all hit SERVER tame cap. We couldn’t do anything during the much anticipated Afterlife event. Turkey trails has now started and we can’t tame, breed, or do anything of worthy progression in the game other than farm materials. The game, now in it’s current form, is completely useless. We should talk about WHY wildcard would launch a game like this. How ANYONE there that it would be a good idea to not include CRYOPODS that help so much with server stability. Now, all of us who were “first in” are paying the price of these laughable decisions. I’ve been playing since release back in 2015. But, I am done at this point. We can talk about the issues above and sure that played a big role in my decision (and my tribemates and tons of other former players I’ve talked to). However, the BIGGEST reason I’m calling it quits is because of the DEV team. Specifically Dollie and Cedric. Cedric is suppose to be the “community manager” and it’s just an absolute joke. He’s rarely active on social media or the discord. Never getting ahead of any issue. Never advocating for the community or keeping us up to date. Go check his X right now and see the laughable amount of information he puts out. This game is an abject failure as a community manager and the fact that he can operate in his role without actually doing his job tells you all you need to know about the managing team behind him. That brings me to Dollie, who loves to masquerade as a community manager when it’s convenient for her. The lack of communication from Cedric pushes Dollie to the front of the “Communication” line (mainly on discord) where she is generally the one answering questions. The issue? She uses it as her personal venting platform where she cares more about her witty 1 liners and shaming the few trolls who say inappropriate comments. She scrolls by hundreds of legitimate issues, recommendations, and even messages of support and targets in on the few 12 year old trolls who are making inappropriate comments. It’s so disingenuous that she does this so she is constantly viewed as the victim, not the thousands of paying customers who are BEGGING to be heard by ANYONE at the company about all of their valid complaints. This is a view shared by EVERY SINGLE player I’ve spoken to about it in game. Don’t be like me. Don’t invent your time and energy into this game. The dev team does not care about you and have no foresight at all. This game will pull you in and then frustrate you to all hell. Take my advice and avoid it.  \n", "\n\r\n\t\t\t\t2,352 people found this review helpful63 people found this review funny\t\t\t\t90\n\n\n\n\n\n\nNot Recommended\n0.5 hrs on record\n\n\n\n\nPosted: 29 October, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis game is dependent on Epic Online Services (EOS) for any multiplayer functionality. EOS is blocked here.That requirement should be mentioned in the system requirements on the shop page.\t\t\t\n", "\n\r\n\t\t\t\t1,293 people found this review helpful80 people found this review funny\t\t\t\t154\n\n\n\n\n\n\nNot Recommended\n132.9 hrs on record\n\n\n\n\nPosted: 27 October, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI love ARK. I have nearly 3000 hours in ARK:SE.ARK:SA runs fine for me the game looks good, and the quality of life additions are really nice.There is no doubt that I will put a lot of hours in ARK:SA too however there is one big problem: Nitrado.Nitrado is a very incompetent company that gained the monopoly over official and unofficial server hosting.Their server performance is terrible and their customer service is awful.ARK is build by communities and Nitrado is ruining it for all those communities.As long as Nitrado is in charge, I will not recommend this game.Edit: Response by Nitrado when confronted that their servers aren't working. Very professional:https://cdn.discordapp.com/attachments/204118603736285194/1167120716001464453/image.png?ex=654cf8de&is=653a83de&hm=00b50d843f9016e1674ca881cf46262926716c88a19c9f87cb1cfc46b19adff1& \n", "\n\r\n\t\t\t\t2,092 people found this review helpful132 people found this review funny\t\t\t\t330\n\n\n\n\n\n\nNot Recommended\n35.8 hrs on record\n\n\n\n\nPosted: 5 November, 2023\nProduct received for free\nEarly Access Review\r\n\t\t\t\t\t\t\t\tEven getting this game for free, because somebody bought it for me... this is such a disappointment. Allow me to list my frustrations with this game, and the company who made it.First and foremost, this game was announced as being free for anybody who bought the first Ark. Then that promise was taken back, we complained, and then the price was increased. What absolute insanity is that?Second: I am an IT technician as my job. My job experience shouldn't be a requirement to get double digit frame rates. What is the point of a UE5 release that runs WORSE than the UE4? I shouldn't have to put console commands in to disable things like the Volumetric clouds or water reflections. Those can be GUI options, as opposed to being soft-locked into a powerpoint presentation unless the average person looks up these optimizations.Third: Speaking of optimization... I think Studio Wildcard needs to go work for Blizzard and Activision. This is roughly an 80 gigabyte game, and that by itself is no big deal. Can anybody explain to me why two days in a row, I've had to patch the game with an 80 gigabyte patch? Are they developing each patch from scratch? Are they trying to 'create a new game' from the ground up, every time they find something to fix? 'Oh! Hey, John... I found a small math error in the spawn algorithm' -Hapless employee.'Start development over then. Do your job better.' -John, presumably the manager.Forth: Minor points here, but some of these really, REALLY bother me. Everything in the game has shifted in the color scheme, it used to be a fantasy wilderness that wasn't too special. It sort of hit the feeling of 'I have no complaints, or praise. This is functional.' Now? Everything is tinted with a 'Press + to Defecate' color. Also, there was a decent balance of 'wilderness' and 'video game' in the UE4 version of Ark. What do I mean by this? One word: Vegetation.Forth-point-five: Vegetation. Plants. Shrubs. EVERY SINGLE PATCH OF GRASS CAN BE LOOTED FOR FIBER. Now I know what you're thinking, 'Bob... how is MORE lootables bad? Isn't that more materials to use?' Yes, you're partially correct, it is more materials to use... but this 'Press E to gather plant fiber' crap that is everywhere, even on top of the resource caves underwater. It just makes herbivores or fiber gathering animals a pain in the ass. This problem is minor, I know, but Ark already had a problem with Fiber and it being one of the most abundant things, and now it's actual a problem.Fifth: Deva Vu. I'm willing to go back and update this review if I end up being wrong, but I'm calling it. All the DLC's will be re-released and Wildcard will most likely expect us to pay for them again. I take back my earlier statement though, Wildcard should apply at Bethesda. They make barely functional games, which end up being good RPG's, and the constant re-releasing of old content and making people pay for it again.DO NOT BUY THIS SCAM.\t\t\t\n", "\n\r\n\t\t\t\t407 people found this review helpful4 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nNot Recommended\n284.3 hrs on record\n\n\n\n\nPosted: 21 December, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tIts a beautiful game but its a re-skin of the old game, the mods are better on ASE and since Nitrado doesn't really want you to run your own servers, they added additional option to find \"player servers\" to force them out of que and only show Nitrados and if you do run your own server they will add a game server query and a live link to your INI files without your consent, on top of a trace utility being added as well under the radar just kinda gives me bad vibes and shady practices.\t\t\t\n"]