["\n\r\n\t\t\t\t3,860 people found this review helpful46 people found this review funny\t\t\t\t642\n\n\n\n\n\n\nRecommended\n81.6 hrs on record\n\n\n\n\nPosted: 25 February, 2023\nSum-UpIn-depth analysis further down.🟩 Pros🟥 Cons- A vast, detailed and impressive recreation of Hogwarts and its neighboring regions, packed to the brim with locations to discover, collectibles and activities to clear. A Potterhead’s wet dream made manifest.- Varied and satisfying combat system that constantly opens up new opportunities as you learn more spells, and stays fresh, engaging in the long run.- Excellent customization possibilities, featuring a myriad of cosmetics and skins, other than your very own customizable ‘base’ to furnish by hand at leisure.- Exciting progression that portrays your growth as a wizard (or witch) rather well, giving you new tools and utilities to access previously-locked content and areas.- Solid roster of side characters; most of them are likable / unique enough, and incredibly, their writing isn’t complete garbage - kudos to that.- Excessively repetitive open-world activities in the long run, that create bloat and annoyance for those who want to complete all side activities.- Combat balance issues with potions, ‘healing spam’ and unforgivable curses: especially when upgraded they prove overpowered and make most fights quite too easy.- Most named foes and quest bosses (but not all) are just normal enemies on steroids, that don’t vary in mechanics and don’t have unique behaviors.- Some inconsistencies with lore and character behavior. Example: if you use unforgivable curses in public or during quests (with witnesses), nobody will give a damn.- Underwhelming finale that doesn’t really reflect the importance of what you accomplished, and doesn’t give any detail about how your actions influenced other characters afterwards.🟨 Bugs & Issues🔧 Specs- Significant frame-drops inside Hogwarts when transitioning between different sections, and also in specific places throughout the castle, regardless of settings.- In some cases, fall damage doesn’t register on enemies.- 3900X- 2080Ti- 32GB RAM- SSD- 1440pContent & Replay Value:It took me 82 hours to complete Hogwarts Legacy, taking considerable extra time to clear all optional content and find around 90% of collectibles / secrets on Hard difficulty. I don’t see a reason to replay the game once finished, except achievement hunting, as the content is linear.Is it worth buying?Yes, especially if you’re a fan of the saga. This amount of content and quality are more than fair for the proposed 60€ price, expected from an AAA release.Verdict: GoodRating Chart HereBy far the best game ever made based on this franchise, but not a masterpiece by any means. Fans of the series will almost certainly like it, but it’s still drawn back by its issues.Follow our Curator page, Summit Reviews, to see more high-quality reviews regularly.https://steamcommunity.com/sharedfiles/filedetails/?id=2936728702In-DepthSetting & WritingHogwarts Legacy takes place in the iconic Wizarding World setting created by J.K. Rowling, at a time far before Harry & friends were even born. You’ll play as a fifth year student in the titular magics academy, admitted this late because of unspecified ‘special circumstances’. The virtual rendition of Rowling’s works is nothing short of exceptional, with not only Hogwarts itself, but also its environs (like the town of Hogsmeade or the dangerous Forbidden Forest), all recreated faithfully and down to the most minute details. Of course, some things will differ from movies and books, with the game being set in the 1800s. The main story follows the classic ‘manifest destiny’ archetype, where your custom-made character will discover hidden potential that ties them to a greater purpose. Despite some genuinely memorable characters and some interesting side- and main-quests, the overall narrative can’t help but fall a little flat and stale, especially towards the ending phases. Nonetheless, many enjoyable adventures await you. Notably, there are no romance or love/hate dichotomies in the relationships you have with side-characters, as your choices will always end up in pretty much the same results during questlines.Exploration, Collectibles & SecretsThe world is vast and visually magnificent, peppered to no-end with points of interest that often hold collectibles, currency or other utilities. Initially on foot, and later on with the iconic enchanted brooms and even flying magical creatures, you’ll be able to explore at leisure and clear the enormous amount of side-activities. A good portion of these, however, will prove inaccessible until you gain the right spells or abilities, in a sort-of ‘metroidvania’ fashion that promotes meaningful backtracking. Fast travel and an item-highlighting spell prove invaluable in saving time while exploring. Collectibles are mostly cosmetic, enabling the customization of both your wizard and your own private room once you unlock it, to suit various styles. Most dungeons and locations have additional puzzles or hidden paths that often lead to collectibles or extra resources; exploration feels rewarding, with a genuine sense of mystery surrounding each new point of interest you’ll find. Despite that, most dungeons and locations play out in the same way, and become repetitive in the long haul.https://steamcommunity.com/sharedfiles/filedetails/?id=2933385898Combat System & BossesMagical battles use spells as sole means of offense and defense. Usually against multiple enemies at once, sometimes supported by allied NPCs, you’ll have to time your protection spell right in order to deflect incoming attacks, or dodge-roll away in case of unblockable ones. Enemies are varied and range from magical creatures to dark wizards and goblin soldiers, to name a few. Some of them may be weak to specific charms, others have shields you can break by using specific spell categories (damage, utility, movement) or other special abilities, like immunity to certain effects. Combat feels engaging, well-paced and is more than a little gory for this universe’s standards, death will be far more common than in the movies or books. The way you can combine spell effects to your advantage and use the environment further adds to the base system, while the amount of passive upgrades with item traits and spell-related talents you can gain progressively add another layer of depth. In late-game however you’ll become overpowered between potions, passive traits, talents and endgame spells - so much that supposedly fearsome dark wizards will prove little more than a nuisance due to power creep.Quests, Minigames & ChallengesQuests usually involve retrieving something, talking to a specific NPC, solving a treasure hunt based on visual clues, getting the solution to logic-based puzzles and more, depending on the case. While some side-quests are unique and memorable, most will be fetch chores or dry open-world shenanigans that you’ll have to repeat over and over in the same fashion. Less, but more meaningful and unique quests would have been better than this bloat, for sure. Challenges are paramount in unlocking unique bonuses like increased inventory capacity, many cosmetics, and even unique passive upgrades to equip in gear pieces. They often require you to slay X of a specific enemy, finish X of the same activity, and such “long-term” goals. Some of them are a massive grind and will only give you the 25th pair of gloves you don’t need, or other cosmetics that aren’t worth the effort.\t\t\t\n", "\n\r\n\t\t\t\t1,239 people found this review helpful15 people found this review funny\t\t\t\t35\n\n\n\n\n\n\nRecommended\n137.2 hrs on record\n\n\n\n\nPosted: 19 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttake your time on the story mode cuz when you finish it it makes doing 100% of the game very boring. do a mission, then just explore and roam the world.\t\t\t\n", "\n\r\n\t\t\t\t702 people found this review helpful57 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n10.8 hrs on record\n\n\n\n\nPosted: 1 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe fact that you can't pause the game during cutscenes and conversations, is very frustrating. The cinematics are long (and sometimes exhausting). If your baby wakes up, If your phone rings, if someone's at the door, if you need to take a pan out of the oven... you can't pause the game! What's the deal with that? Put a pause feature! We have the technology!\t\t\t\n", "\n\r\n\t\t\t\t431 people found this review helpful6 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n26.0 hrs on record\n\n\n\n\nPosted: 7 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA very fun but not perfect game:What I liked:- You don't need to know every Harry Potter book/movie before playing Hogwarts Legacy to get immersed into this world- Hogwarts and its surrounding areas are built in high detail and provide an awesome atmosphere- Exploration is fun, as the world is believable and well designed- The combat system seemed unusual at first but I ended up loving it. Might actually be one of my favourite mechanics of all video games I played: It is fast paced, dynamic and (at first) challenging, but once you get the hang of it, the fluid combat is just satisfying- Some of the quests were really funWhat I didn't enjoy:- After an interesting start, the first third or first half of the game felt repetitive and somewhat tedious: To learn Spell X you talk to professor Y but he or she won't teach it to you unless you do some basic fetch quest type of tasks first. Learn the spell and repeat the process over and over again- This way of storytelling repeated all over the main quest line. The main quest itself would have been several hours shorter, if the people you need information from would just give it to you. Instead, you often end up having to do them some favors first or do preperation work. This does in fact make sense and wouldn't be an issue, but after a few hours you start to notice this repeating pattern. (The second half of the game is more interesting in my opinion)- The game would have benefited from more depth in terms of RPG mechanics. Meaningful choices, more interactions in the open world. The majority of NPCs in the game are just for decoration (e.g. generic students all over the castle) but only a small amount actually has a purpose for the quests. \n", "\n\r\n\t\t\t\t2,624 people found this review helpful1,315 people found this review funny\t\t\t\t340\n\n\n\n\n\n\nRecommended\n49.2 hrs on record\n\n\n\n\nPosted: 13 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDeek thinks you should be proud of all the potions you’ve brewed.\t\t\t\n", "\n\r\n\t\t\t\t6,275 people found this review helpful820 people found this review funny\t\t\t\t389\n\n\n\n\n\n\nRecommended\n57.4 hrs on record\n\n\n\n\nPosted: 11 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYou can pet every single cat\t\t\t\n", "\n\r\n\t\t\t\t2,359 people found this review helpful718 people found this review funny\t\t\t\t229\n\n\n\n\n\n\nRecommended\n23.4 hrs on record\n\n\n\n\nPosted: 12 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tShadow wizard money gang, we love casting spells\t\t\t\n", "\n\r\n\t\t\t\t6,636 people found this review helpful121 people found this review funny\t\t\t\t1,499\n\n\n\n\n\n\nRecommended\n89.3 hrs on record\n\n\n\n\nPosted: 10 February, 2023\nA dream for every Potterhead and those who want to become one!Spoiler free Review!Sometimes games are getting released with way too much hype. Forspoken, as an example, would be such a game. Either is it because of bad optimization or misinformation by the studio, the disappointment can end up being immeasurable for people who already pre-ordered these games, or people who have those games on their wishlist for months. Sadly, we had a lot of those lately. Don't even get me started with license games in general....Hogwarts Legacy, on the other hand, shows that sometimes the hype train can be true.I don't usually pre-order games anymore, but the premise of being the best game based on the fantastic world of \"Harry Potter\" made me buy it in an instant.The following review won't contain any spoilers! I also want to mention that I am not even close to the end of the game, because I have way too much fun exploring.Also I know about the controversy, but it won't be part of my review (Not even as a meme!).https://steamcommunity.com/sharedfiles/filedetails/?id=2929913613Story:So far so good. It starts off with a generic \"You are the chosen one!\" scenario, but it is going to get better and better the further you go. You just have to trust me on this one, because I don't want to give away too many information. All I can say is that the story fits the HP universe very well. If this game would be a book I wouldn't be able to stop reading it until the very end.Gameplay:Overwhelming, would be the right word. There are so many mechanics in this game it is amazing and exhausting at the same time.First off you have the exploration part, where you can move around freely and explore every inch of Hogwarts and its surroundings. I tell you there is a lot to discover and to collect. Mysteries that need to be solved, locks that need to be picked and information about special places that need to be gathered. The amount of collectibles are insane and you will most likely spent hours over hours getting everything to 100%. The puzzles you can find are very well-made and solving them is fun.Then you have your main quests and side quests. I really love the side quests in this one, because they involve your fellow students. You learn to know them a bit better every time and the most of the quests are very creative.Also: You don't get exp by fighting enemies! You get exp by discovering new locations, doing mini games or other things like that.If you want to get from one point of the map to the other, you can also use the \"Floo powder\" fast travel service, or use your good old broom! I prefer the last one. It just feels great to fly around and enjoy the world. It might even sometimes happens that I just fly around aimlessly just for fun.  Decorating, Crafting and Fantastic Beasts are going to be part of the game as well. But it would be way too spoilery to mention anything more! The Combat:What would be a wizard/witch without a magical wand. Most of the time you might be using it for puzzles, lighten up the area or scanning your surroundings, but the further you go the stronger enemies you have to face. Good that you start to learn attack and defense spells very soon. There might just be a handful of them, but the key is that you can combine them. Hit an enemy with 3 basic spells, pull it towards you, hit 3 more times, set it in flames, push it back and hit it ones again. Different combos cause different effects, combining them makes them stronger. You learn those combos as well, but you are also free to experiment on your own. Fighting the enemies also never gets old. Some of them might have shields and you need the right spells to break through them and others can only be dealt with when they get attacked by fire. For your defense you can also use a shield spell or dodge roll out of the danger zone. It should be clear that you can't really deflect a power attack by a troll. It has something of a Souls-Like, because it also comes with a parry button and more.The further you go the further you can upgrade your spells as well, for extra effects and power.As a sidenote: You also don't need to fight most of the time, if you don't want to. There is always the option to sneak past enemies, or silently stun them.The RPG Part:There is not that much RPG in this game as I hoped it would be (And this is my only negative point.). I feel like that you don't really can control most quest/story outcomes. In dialogues you can be mean or friendly, but there is not as much difference in both as I wished it would be. You might get more Gold out of a quest by asking for a better reward or by blackmailing, but that also doesn't fit your overall appearance during cut scenes. I mean you can create your own character and choose the house you want to join and also have a skill tree, but thats about it.I just want to throw in that the voice actors are doing and amazing work! The Atmosphere:Just wow!  Hogwarts alone is gigantic and it feels amazing to get lost in all those beautifully handcrafted and unique halls, rooms and dungeons. The living paintings, the ghosts and the students running around in the halls is so atmospheric. The neighboring villages and landmarks do the same trick. You maybe want to walk all the way to Hogsmeade and drink Butter beer, just to lose yourself in that weird looking, but fascinating architecture of the buildings. Don't even get me started with the Forbidden Forest and other locations, you would be able to recognize from the movies and books.The Graphics:I play this game on a mix of medium to low, on my I7 4790 and my 1060 6 GB and the game still looks amazing. As a passionate screenarcher (screenshoter) I won't be able to make any good screenshots in the game, but just for playing it is more than enough. The fps are stable and I never noticed any pop-ins or any texture loading. The Unreal Engine 4 does a wonderful job and just shows how good it can still be (Compared to UE5)!The Soundtrack:Simply magical!https://www.youtube.com/watch?v=NAesuW6qZU8I also love that they mix new composed songs with the soundtrack from the movies. It just feels right!Conclusion:You know you want it! For me it is already GOTY. Not a single game in the last months kept me so occupied. Now if you excuse me I have to collect more things for my potions and maybe get lost on my way in a random ruin hunting for treasure. \n", "\n\r\n\t\t\t\t1,602 people found this review helpful31 people found this review funny\t\t\t\t70\n\n\n\n\n\n\nRecommended\n37.6 hrs on record\n\n\n\n\nPosted: 11 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonly thing wrong with the game is no quidditch really hoping for a dlc just for it.\t\t\t\n", "\n\r\n\t\t\t\t2,173 people found this review helpful430 people found this review funny\t\t\t\t270\n\n\n\n\n\n\nRecommended\n23.1 hrs on record\n\n\n\n\nPosted: 14 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessor Garlick. Nuff said.\t\t\t\n"]