["\n\r\n\t\t\t\t7,309 people found this review helpful47 people found this review funny\t\t\t\t1,148\n\n\n\n\n\n\nNot Recommended\n1,652.9 hrs on record\n\n\n\n\nPosted: 18 August, 2023\nEnough is enough.  I love this game to death but jesus christ is CA doing everything to change my mind.  I didn't complain when the game released in a poor state.I haven't complained about the rare patches.I haven't complained about the lack of communication from CAI didn't complain about the constant new bugs in said patches.I didnt complain about the price of the new DLC. BUT the audacity to go out and practially say buy the DLC or we put your beloved game in the ground is making me so ***** furious.I have been a bystander and taking this ♥♥♥♥ for far too long. It's time to stop, I've had enough of your ♥♥♥♥ CA/SEGA, Whoever is more responsible. Most of us are. Start respecting your customers.\t\t\t\n", "\n\r\n\t\t\t\t2,029 people found this review helpful21 people found this review funny\t\t\t\t449\n\n\n\n\n\n\nNot Recommended\n20.0 hrs on record\n\n\n\n\nPosted: 1 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAs a preface, I like the core game...but...SO WHAT DID CREATIVE ASSEMBLY DO (this time)?-They have increased the amount of cut content in their games, for which they profusely apologized and then did not make up for. Make no mistake, they fully intend to try this again as proven by years of experience Total War: Three Kingdowms and Total War: Rome 2.-People here often forget the dual nature of the main current sticking point. They have decreased the content amount for DLCs AND raised their prices simultaneously. They are claiming rising prices. No specifics, just vague pointing towards 'economy, inflation or something I dunno'.-They have issued a veiled threat to players essentially alluding to the discontinuation of the game's development if WE do not meet THEIR sales quota as if we are their employees that have to take it from them. They also managed to slip in a dangling carrot in front of the more easily manipulable players, citing all the wonderful content they have planned. If only we would gobble up their products without question.Here is the direct quote from them:\"this is the business reality of supporting WARHAMMER III and ensuring we’re able to offer the years of extra content that are currently planned.\"SO CAN WE BACK UP THEIR CLAIMS OF INCREASING PRICES?No, not really. CA basically employs a lot of dirty tricks meant to 'maximize profits'. The issue with this incredibly tired, disproven, short-sighted thinking is that it simply doesn't work. And it never has.But to expand upon my point, here are some circumstances to consider:-CA has numerous critiques on Glassdoor about the low salary compared to other players in the industry.-They put a third party anti-tamper solution into their game called Denuvo. This DRM technology has a proven track record of slowing games down by increasing the millisecond time for frame generation as well as decreasing the FPS of games. Sometimes even by 30+ percent. A game like TW 3, which already has a pretty steep system requriement, this is an uncalled for. Also, CA could have taken the money and give it to developers instead of Denuvo. Clicking the End Turn button should not be dreaded.-CA, a studio founded in 1987, employing 882 people (as per Wikipedia) and being bought by Sega in 2005, received a 5 million GBP grant from the UK government that is meant for startup companies. -Their parent company Sega also keeps receiving the VGTR, the Video Games Tax Relief (20 million GBP per year), that they have then used to wipe out the corporation tax bill of CA entirely since 2014-Also, jsut to see what companies we are talking about, here are their revenues:Sega revenue (2022): 3.14 billion USDCreative Assembly revenue (2021): 62 million USD-CA sold over 22 million copies in the Total War series by 2018 (according to Sega themselves after TWWH 1 and 2), I invite you to extrapolate from partial information where they may stand now.-Wholesale workstation and hardware prices have gone down after the post-pandemic chip shortage is over.-(1st. EDIT as requested by Dance Commander) CA actually tried to put the Red Shell advertisement program into their launcher. While the original public optics all stated that Red Shell is simply an advertisement tool, it later turned out to be the textbook definition of a spyware software. Here is an excerpt from the 2018 Polygon.com expose:Begin quote - \"...the spyware sells itself as a means for video game makers to “uncover where their players come from through reliable attribution.” It “matches” whether players with Red Shell installed on their games visited a market’s campaign, whether Facebook and Twitter, YouTube, a web page or others.To do this, Red Shell has to follow what users are doing outside of the game. But the company said it does not collect any player’s personal information, and only collects information about their browsers and devices “for purposes of attribution.” \" - end quote.On a personal note, I would like to point out that Red Shell:-never actually disclosed what data/datapoints they are collecting-when requested for this disclosure, they did not do it (in direct violation of GDPR)-Red Shell never asks you for your consent to run and you cannot opt out-Red Shell runs even when the game doesn't -Several ad blockers doesn't even let you go to their webpage without first being warned of it's contentsCA, after the public outrage, decided to remove it from their launcher. But they did try it, don't forget that. (end of 1st. EDIT)-(2nd. EDIT by me) After reading comments I would like to address some of them here. I won't just fling the \"shill\" tag around as it is reductive and doesn't advance the conversation.\"dude...get a life, these games cost a lot\": Formulating a critical opinion about something someone cares about is considered a bad thing just because it costs a lot of money to make? That is not a healthy mindset. By this logic I should just worship the makers of Star Citizen becuase they managed to sink a country's GDP into their half-baked shambling horror? Also, 2006 called, they want their insults back.\"What a great review that says basically nothing about the game it is purportedly a review of\":A game review doesn't only have to be about the end product only. Sometimes, some events may require a peek at the workshop where it is made in or just warn other potential buyers about the full scope of a situation around a game. Making sure others are more informed before making a purchase is what this community is supposed to be about. I won't apologize for that.\"Denuvo does not effect SSD's\":Indeed, you are correct. I did not do proper due diligence and check the date on several analyses I have based my statement on. Denuvo has since transformed their modus operandi and altered their process from excessive I/O operations, to certain 'custom event-based triggers'. Deleted that section, thank you for noticing. (end of 2nd. EDIT)IN CONCLUSION:Dear Creative Assembly and the two gentlemen who wrote that explanation/apology on the Total War blog. Game development is a service industry in the end of the day. If you bring a good product, people will buy it without questioning it. Furthermore, they will keep buying it for the foreseeable future as there is no stronger marketing tool in the walrd than word-of-mouth. That is of course unless the quality drops. Your studio will not be the first to experience what it is like to reach the point where people will just not care about your product enough.Furthermore, even if you start shipping good content again at reasonable prices, the stink of your decisions will taint that as well.Please do not fall into this downward spiral, it is getting very boring and I feel like I am Jeff Goldblum from Jurassic Park counting on his fingers:-company makes good product-company expands upon good product-non-creatives start dictating how to make product more profitable-non-creatives start bringing out charts and the Book of Drity Tricks-product suffers-more non-creatives are brought in to remedy a creativity-driven problem-parent company has enough-parent company demands more money-non-creatives bust out the Codex of Dirty Tricks-product dies and no one at the helm knows whyI leave it to everyone's discretion where CA stands in this process.P.S. (on a more cynical note):CA, pull yourself together, cut out the people making these decisions, pay your valuable employees from the freed up money and return to formula to flourish again. Also, please remove Denuvo, it is just a burden. Give that money to your developers instead.\t\t\t\n", "\n\r\n\t\t\t\t5,979 people found this review helpful498 people found this review funny\t\t\t\t863\n\n\n\n\n\n\nNot Recommended\n119.6 hrs on record\n\n\n\n\nPosted: 27 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\"The right to discuss is a privilege—it is not an entitlement you earn by playing the game\" - CA's PR departmentUnfortunately I lack the proper Free Speech(TM) DLC to post an accurate review of this game.\t\t\t\n", "\n\r\n\t\t\t\t1,595 people found this review helpful19 people found this review funny\t\t\t\t159\n\n\n\n\n\n\nNot Recommended\n1,157.6 hrs on record\n\n\n\n\nPosted: 18 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBefore I start ranting I want to say that I wouldn't have posted any review, definitely not a negative one before Creative Assembly's recent statement.Lord packs for Warhammer I - £6.99Lord packs for Warhammer II - £7.99Lord packs for Warhammer III - £19.99Race packs for Warhammer I and II - £14.99Race Packs for Warhammer III - £19.99Creative Assembly released a statement yesterday (17th August) to the effect of \"we're raising our DLC prices because of inflation and if you don't buy it we will cut support even for already planned DLC\". What's the rate of inflation again? How many millions did CA turnover in the last year alone? I've bought every single DLC for all three games up to now, as many on discount as possible as well as all three base games on discount, but started to get sceptical with the Champions of Chaos release especially after the state that game three released in, it was literally unplayable for me and many others at the time. How did it pass QA at that point? Anyway after some deliberating I decided that Champions of Chaos was fair value. Four legendary lords and a bunch of new Chaos units, I like Warriors of Chaos alot so I thought it was one of the better DLCs. Chaos Dwarves was right on the edge of the boundary of pricing for me, but I enjoyed it and got a fair amount of hours from it. I decided this upcoming DLC is just too far, £19.99 retail for a lord pack is crazy.Add to this the fact that we don't get quality of life updates such as bug fixes unless they're released along side a paid DLC is just sad. It has been three months (25th May) since we last had a major patch. After the release of that patch Nakai could no longer recruit Kroxigors, modders in the community fixed that almost immediately, but CA decided fixing a bug as significant as this, especially for a paid DLC character was not worth the time, until the next upcoming patch about three months later down the line.CA are wasting the potential for this game/series for the sake of trying to increase short term profits, I don't know if they can ride this out for the next two weeks until Shadows of Change releases as they're obviously under immense pressure. With their current stance I think they should be very worried not just about Shadows of Change, but also Pharaoh and Hyenas, although alot can happen in the coming weeks or months.Whilst I'm here and this is minor compared to the other problems, they never added back in the Chaos Undivided soundtrack that was in both game one and two. Of course community modders did though. On YouTube \"Chaos Undivided - Dynamic (Total War: Warhammer Soundtrack)\" if you don't know what song I'm referring to. Imagine your favourite faction without their soundtrack. A detail some people might not care about, but I think it shows CAs lack of attention to some of the aspects that made this series so good.Something that I absolutely hate about this game are the sieges. Towers on the walls that only shoot outside of the settlement? Fine, it makes sense. Towers lining the inside of settlements with 360 degree angle of fire, unlimited ammunition and if they are destroyed then they can be rebuilt. It is probably the one aspect of the game itself that I hate.For now I will leave this review as it is, hopefully something gives, the community for this game would be much happier if the pricing model for DLC was more sensible and didn't feel like we were being kicked in the balls. Regular updates with quality of life improvements and bug fixes not only alongside paid DLC would be very much appreciated, but I don't expect CA to do this.People can do whatever they want with their own money, but for now I want to suggest people hold off giving more money to Creative Assembly just to see if their attitude towards their consumer base changes to a more positive tone.If you want to add a comment to this review then feel free.Update 1st September -I appreciate the comments and everyone who took the time to read my and others reviews. After two weeks since leaving my initial review there still has been no communication from CA about the backlash from the community, apart from their default marketing campaign. They obviously went all in, as I write this the new DLC has already dropped out of the top 10 after being there very briefly and is now sitting around 16th. For anyone who doesn't know, the top 10 is based off of revenue generated, not amount of units sold. It was always going to get fairly high due to the excessively high price, but to see it already starting to fall is no surprise as not so many people are buying it. I would imagine they now wont sell many more units of this DLC.As for the new patch with the improved AI, well, I started a campaign as Khazrak and it is a steam roll. In battles the AI will have most of their 20 stack prioritise warhounds that will kite them around the entire map. The AI has been pretty bad for a long time now, but this is the worst and most easily manipulated I have ever seen it. They have made this game way too easy, I shouldn't be happy to be surrounded by enemies knowing that I can easily farm them all and will not lose a battle, let alone the campaign.CA's behaviour has convinced me to not only not buy this DLC, but also to not buy Pharaoh. Maybe the next DLC will be regular price, but for now this review stays indefinitely negative. My suggestions are fix bugs regularly, atleast once a month, every two weeks could be ideal. Balance passes, take care of the details like units being in the wrong rosters, soundtracks missing (WoC, Beastmen, Norsca) etc. Finally adjust your DLC model. Silence and the Fury, Shadow and the Blade, Twisted and the Twilight, Warden and the Paunch, that is 4 WH2 DLCs off the top of my head that came with 2 lords and 1 FLC lord. Now in WH3 we still get 3 lords but you took the FLC one and put it into the paid DLC, that doesn't warrant a 150% price increase.If you read all of this then you must be a masochist :)Update 14th December -It's been about three months since I last updated this review and so many people in that time have upvoted my review so I wanted to say again thanks for taking the time to read my long winded rant.Alot has happened around TW in the last three months, Hyenas was cancelled, Pharaoh had an awful launch and CA/Sega have obviously felt the consequences. As of the statement that CA posted today, they are dropping the retail price for Pharaoh, refunding current owners part of the price they paid and now the upcoming DLC for Pharaoh will be free. I do approve of them doing this, we all knew Pharaoh was a Saga title, it's retail price always should've been £25-35. I can't help but still be cynical though, this seems like an off-ramp for CA/Sega regarding Pharaoh. I think they want to see if the playerbase increases significantly with the new changes before committing too much.Now about Warhammer. Shadows of Change is going to get a 'major' update next year, by the wording in CA's statement it seems the £19.99 retail price for lord packs is sticking. I think we all have to wait and see if this 'major' update will justify that price. In SoC's current state I didn't even purchase it at £13 when it was on sale at a third-party seller recently. They are really going to have to add alot and improve the quality to justify their pricing. They're really playing a dangerous game in my opinion, but value is what matters. The next thing is, will I consider buying SoC before Thrones of Decay has released? I want to see the quality of the game's development increase and I want it to be consistently high quality. SoC could be revised and become the best DLC, but what if ToD at £19.99+ is another mess like SoC?But what's more important at the moment is the current state of the game. The AI is in a new awful state, the game is too easy. The hotfixes are appreciated but please CA, the AI needs more attention before more DLCs come.\t\t\t\n", "\n\r\n\t\t\t\t1,942 people found this review helpful38 people found this review funny\t\t\t\t94\n\n\n\n\n\n\nNot Recommended\n331.8 hrs on record\n\n\n\n\nPosted: 18 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\"Give us money, or we'll kill Warhammer 3\".Kill it.\t\t\t\n", "\n\r\n\t\t\t\t779 people found this review helpful3 people found this review funny\t\t\t\t93\n\n\n\n\n\n\nNot Recommended\n163.8 hrs on record\n\n\n\n\nPosted: 30 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCreative Assembly has decided that going to war with their playerbase is the best option in light of recent failings, poor marketing, anti-consumer practices, and outright hostile Community Management here on Steam. What was once a thriving studio and series has become a collection of broken promises, aggressive sales tactics, and outright threats on the community.While currently in the process of trying to walk all this back the damage has been done. DLC prices have increased while content has decreased. When concerns of this were raised the community was quite literally told to buy it or support would be dropped. When it was pointed out that support doesn't really exist due to the continuation of major bugs, broken AI, and gameplay balancing issues the response was to ban people. When it was pointed out that making a Hero Shooter with Hyenas was a terrible idea and the community wants Rome 3, Empire 2, or something along those lines again the community is told to shut up and get in line. Hyenas has been canceled to the tune of millions in losses and jobs cut. Somehow the problem in all this is the community.When Pharaohs got announced it was met with a criticism and push bask as a reskin of Total War Troy and pushing a Sagas title (smaller budget, scale, and price) as a full scale Total War release wasn't at all what the community wanted.Bare in mind during all this CA dropped support for Three Kingdoms because despite selling well and getting good response it wasn't big enough for SEGA/CA so they killed the project. Apparently a team of just 20 people work on Total Warhammer content now and CA's studio size has been reduced by 40% with hostilities continuing towards the community though CA is trying to walk it back with a non-apology once they got enough push back for banning mod creators on Steam which locked them out of updating their mods or even uploading new ones. Guess CA realized it wasn't the best idea ot remove those actually helping their game.I'm 100% in support of boycotting CA products until this sort of stuff is addressed and the community given the respect it deserves. I've been playing Total War games since the original Shogun hit store shelves back in 2000. There was a time when I held out hope we'd see Shogun 3 but these days I question if studio management and SEGA will allow the studio to continue long enough to release another game let alone something the community is actually interested in playing. Been over 10 years since Rome II released and since then it's been calls for Rome III, Shogun 3, Medieval III, and Empire 2 yet beyond the Total Warhammer releases they've largely missed the mark for bringing something new the community wants. Three Kingdoms had its success but CA and SEGA weren't happy with fan spending so despite being from 2019 the project is dead, buried, and forgotten about. Oh and CA is quick to blame Steam for their harsh treatment of the community. As someone who has moderated discussion boards on here before for games that's a load of crap. But CA is used to shoveling crap to fans so it is on brand. RIP Creative Assembly.\t\t\t\n", "\n\r\n\t\t\t\t1,722 people found this review helpful15 people found this review funny\t\t\t\t77\n\n\n\n\n\n\nNot Recommended\n218.1 hrs on record\n\n\n\n\nPosted: 18 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHow dare you to threaten your community after so many years of support?Nice PR statement guys, really well done. I'll get your DLCs for -75% in few years, if game is even playable at that point.\t\t\t\n", "\n\r\n\t\t\t\t2,534 people found this review helpful54 people found this review funny\t\t\t\t78\n\n\n\n\n\n\nNot Recommended\n297.1 hrs on record\n\n\n\n\nPosted: 27 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOh, you want to ban people from the steam forum for criticising you CA? Here, have a bad review!\t\t\t\n", "\n\r\n\t\t\t\t2,107 people found this review helpful110 people found this review funny\t\t\t\t84\n\n\n\n\n\n\nNot Recommended\n886.1 hrs on record\n\n\n\n\nPosted: 28 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe right to positive reviews is a privilege.\t\t\t\n", "\n\r\n\t\t\t\t2,651 people found this review helpful145 people found this review funny\t\t\t\t82\n\n\n\n\n\n\nNot Recommended\n42.7 hrs on record\n\n\n\n\nPosted: 26 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe end times have begun my friends\t\t\t\n"]