["\n\r\n\t\t\t\t350 people found this review helpful28 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n39.4 hrs on record\n\n\n\n\nPosted: 15 March, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy dads favorite game. Blood cancer took him away. I just want to say thanks to Wargaming for giving him his best days in life\t\t\t\n", "\n\r\n\t\t\t\t443 people found this review helpful17 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nNot Recommended\n2,726.0 hrs on record\n\n\n\n\nPosted: 4 May, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFantastic game, ruined by a greedy developer.Here's the problem. I've spent time and money on this game and the developer just took away almost everything I invested in one update. Please read carefully and BE WARNED.I was just in-game looking at one of my favourite tanks. It's a tier 8 premium. Premium meaning I spent enough REAL MONEY on this one tank to buy a full console game for example. Seems crazy but I really like this game. And I like this tank so much that I spent even more real money on a fancy paint job, just to make it look pretty. But I'm just looking at it, not playing it because my tank has been robbed.I've been driving this tank for awhile now, FULLY EQUIPPED and able to go head-to-head against any other tank on a level playing field. And this is not the only tank I've spent money on. Some players spend hundreds even thousands of $$$ on this game. But it's genuinely a great game and few of us regretted it until........update 3.8 happened. My tank. ALL my tanks have been robbed of their equipment.Under the guise of improving the equipment system (which was in no way broken) they have taken away all my equipment, paid for in game currency. To re-equip my tank for peak performance I have to wait for newly-imposed TIMERS to run out which will take MOST OF A MONTH! Or, I can pay even more REAL MONEY to get it now. Don't forget I already paid plenty REAL MONEY for this tank and now they're asking for more, just to get back what I had already.Sounds awful right? But this is not even the worst part. I have a garage full of tanks, we all do. And this update has taken away 100% of our equipment on all tanks and gave us enough compensation (in the form of a brand new alternative currency) to buy only 12% back. Yes, we did the math.To get the rest back we need to grind all over again, and again we did the math. It will take ACTUAL YEARS for many players to recover what they ALREADY EARNED but was taken away. In extreme cases, up to a decade.The more TIME and MONEY you invest in this game is more that the developer can take away from you at any time. That is the bottom line here. So think carefully before playing this game and especially before you spend money on it.\t\t\t\n", "\n\r\n\t\t\t\t154 people found this review helpful31 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n3,563.0 hrs on record\n\n\n\n\nPosted: 22 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy grandpa's favorite game. Testicular cancer took him away. I just want to say thanks to Wargaming for giving him his last best days in his life\t\t\t\n", "\n\r\n\t\t\t\t277 people found this review helpful18 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nNot Recommended\n6,983.1 hrs on record\n\n\n\n\nPosted: 10 October, 2020\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've played this game for over 6 years now, and I'm finally going to write my FINAL review of this game.This game... used to be very fun. (It still is at times). But now... it's not that fun anymore.WG really only cares about the money at this point, this game used to be very fun but now it's just another P2W game.The matchmaker of this game is so trash at this point, that your only way of winning is using OP tanks or even going further by using OP tanks in a platoon. (Like Smasher platoon, T22 platoon, Obj. 252U etc.)And to get those OP tanks, you ofc need to spend a sh*t load of money to get those tanks.This game used to be fun, it really was, but now because all this P2W sh*t it really isn't that much fun anymore.You can already tell from how many players are starting to quit the game (or the amount of players who have already quit the game in the last year or so).So at THIS point of the game, no, I would not really recommend this game (unless you're willing to spend a lot of money that is), I myself am a F2P player and I don't really win that much anymore just because of the trash matchmaker.WG really need to fix their matchmaker and care about their customers, I mean it.\t\t\t\n", "\n\r\n\t\t\t\t116 people found this review helpful34 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n465.6 hrs on record\n\n\n\n\nPosted: 17 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1. Play the game2. Lose to P2W tanks3. Play the game again.4. Rant about the outdated and horrible matchmaking it offers5. Lose 9/10 of your matches6. Uninstall the game.7. Live a good life.\t\t\t\n", "\n\r\n\t\t\t\t133 people found this review helpful55 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n427.5 hrs on record\n\n\n\n\nPosted: 21 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis community, collectively, has a lower IQ than bag of rocks.\t\t\t\n", "\n\r\n\t\t\t\t183 people found this review helpful16 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nNot Recommended\n844.0 hrs on record\n\n\n\n\nPosted: 5 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t644 hours of my life wasted. 200 euros of my hard earned money wasted. The faith I had for the community is gone. And all of this because of some \"very\" simple reason.My general PoV:The maturity this game once had is dead and now it's just a shell for kids who like to spend 300 euros per month on the premium tanks they make every once or two weeks where they are still not getting creative with the fake names. Competitiveness left when tier 10 premium tanks were added and more and more offers appeared in the shop. Most serious people left the game as soon as they saw where it was heading but I stayed like the sucker I was 2 years ago. The sad and cunning trap these games have is that they make you think your effort in the game counts towards something and if you stop playing you will lose it. After getting 2 tier 10 tanks and a notable amount of premium tanks I came to the realization that the grind is just endless, there is no endgame even if you complete all tech trees, because they will just keep adding more tanks to keep people in the game. I've uninstalled and reinstalled the game about 4 times and every time I played it again was in the hope that for once I could have fun. I'm not one of those salty kids who keep blaming their own team when they die first, but the competitive matchmaker and the matchmaker overall don't care about player skill, only for the tank you have. So it's very easy to get matched with someone that has 30-40% WR only because he has a shop tank so that the teams would have a relevant amount of diversity in terms of tank types. The \"endgame\":The meta of this game is either a tech tree tank that takes 4 months to grind or a tier 10 premium tank that occasionally appears in the shop for about 75 euro. It's not like they sell these tanks to fulfill their upkeep costs, but it seems more like milking at this point. I've seen it in many other games and I know what it feels like. 90% of the people you will find as your teammates are toddlers and in a game that requires communication to win makes it clear you can't really depend on someone like that who will just go die only because he didn't want to do what you told him, he lacks common sense and so does the community at this point. The youtube community:Most YouTubers I've seen playing this are not really having fun of it, it may seem like they are having fun but what they had when they first started making videos was gone after a while and was replaced with an advertisement puppet. All this of course is nothing but my pure opinion on what this game has become. Conclusion:It could have been something great if we didn't stick at the mobile plan, because it's the universal truth that free mobile games want to milk your wallet in the end and that's an unhealthy practice at pc gaming. I have found a better community than this at a more fun game of which I won't mention because I'm not an advertiser. If you want a good game and community just look elsewhere, because, \"You picked the wrong house, fool!\".\t\t\t\n", "\n\r\n\t\t\t\t417 people found this review helpful356 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nNot Recommended\n0.1 hrs on record\n\n\n\n\nPosted: 9 November, 2016\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWargaming: Hey, we should put our games on Steam. People would like that right?Steam Players: Yes, we want World of Tanks on Steam!Person: See? They want it.Wargaming: Okay!Person: Alright so we just need to set up our pa-Wargaming: Put the mobile game on there.Edit: Someone explain to me why World of Warships is on here in full glory but World of Tanks isn't??\t\t\t\n", "\n\r\n\t\t\t\t57 people found this review helpful7 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n1,166.7 hrs on record\n\n\n\n\nPosted: 29 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBefore I start, I wish to apologize if I make any grammatical errors, English is not my first language.In short, this game is a nice fun game to play if you are interested in WW2 and later era tanks or this type of gameplay.Now, for the long version.The game is a 7v7 pvp game,  and there are two gamemodes. The first is encounter where the objective is to either eliminate the entire opposing team or capture the base. The second is supremacy, it is similar to the first gamemode, however there are multiple bases to capture, and capturing one or all, wont automatically make you win, instead your team will get points per base captured, destroying an enemy tank will reward you with points and remove points from the enemy. Eliminating the entire enemy team is also an option. All of this will take time at maximum of seven minutes per game, however it is quite rare that a match would last this long.The goal of the game is to grind tanks lines. There are currently eight nations to chose from; The United Kingdom, America, USSR, China, Pan-European (Multiple European nations in one which will lead to an Italian tank, but more tanks from the previous nations would be added here.), Japan, Germany and France. All of these nations have their own playstyle, so make sure you start with the right nation for you. When you do select a nation, you will be given a tier one tank, your goal is to move up the tiers to get that sweet shiny tier ten. But, to go up the tiers, you need experience to upgrade the tank, then get more experience to get the  next tank. How do you get experience? By simply playing the game. Even if you lose you will still get some, bur far less than if you win.The action, is very intense. You only have a certain amount of hitpoints, and once you lost some, you can not get them back, and dying means game over for you, and back to the garage. What makes the action intense is that skill is at play (And luck too). There are tactics to be used, like hull-down and sidescraping to throw off your enemy and make their shells bounce of your armor. These thing you will learn in due time, it is not as hard as people make it out to be, all you need is the right tank, and time.There is a tank for everyone;Light tanks: Fast, nimble, deadly and no armor, their job is to spot the enemy, flank and help out their teammates who are in a sticky situation thanks to their speed. However, they have no armor, and one HE shell, (a shell that has a hard time penetrating but when it does it deals much more damage than normal ammo) and a huge chunk of your health is gone. So play smart, and be effective.Medium tanks: Jack of all trades, one of the hardest tanks to master since you need knowledge on everything. There are mediums tanks with less armor, weaker guns and better speed, or vise-versa. Heavy tanks: Big, heavy and slow. As the name suggest, these are the heavies of fpss. Their job is to soak up the damage with their large hitpoints and return the love with their big guns. However, they are quite slow, so they easily fall victim to circle of deaths, so make sure you are never alone.Lastly, tank destroyers (TD for short): Usually turretless, but have great guns. Turretless TDs have very restricted movement so they are best at the back of the team since they are very easy to get behind and delete them, however they make up for it for their great gun which can pack a lovely punch. There are currently 2 lines which have a turret, and one differs from lightly armored to heavily armored. The game also holds events, which if you follow the instructions, you will get rewards, and sometimes if you are lucky, even a premium tank.The graphics of the game are only getting better, and keep in mind this is originally a mobile phone game, so the graphics can not be all that great, but with some updates, they are trying to make the game look nicer. This is a plus for me, since the game actually looks nice, and if you have any device, you can guarantee that you will run it.Since I got into the game because of my interest in WW2 tanks, I can safely say that most tanks are historically correct. Currently from the hundreds of tanks, which are not fictional, I only found one tank that is not historical. But, even so, it is a huge joy to take command of a Tiger 1 or the infamous Maus.But, there is not a game which is perfect.The game sells premium tanks for real money, which are quite powerful, and some are OP. The company also sells loot boxes for a chance to get the reward, which people labeled the game as \"Pay 2 win\". Look at the price of the game, yeah, it is a free game, so how would they make money if they did not make appealing offers? Some tanks are powerful, but there is not a tank that does not have a weakness. And besides, all the tanks which you can get for free, are powerful and fun in their own respective way. You can play the game without spending a dime, but at the cost of taking a while to move up the tiers.Overall, I think this game is a great game and fun at that. The community takes the game too seriously which does make it less enjoyable, but simply turning off the chat helps. If you are interested in tanks and have a low end device, install the game, it is small so it does not use up a lot of space. If you are not interested in tanks but what I mentioned here sound appealing, do not be afraid to give it a try, like I had said, it is free, so you would be losing nothing. I hope you had found this review helpful, this is my first time, so I apologize if I had done any mistakes.\t\t\t\n", "\n\r\n\t\t\t\t65 people found this review helpful\t\t\t\t1\n\n\n\n\n\n\nNot Recommended\n238.8 hrs on record\n\n\n\n\nPosted: 10 November, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUnfortunatelly this game represents new way of gaming. Instead of providing you with proper content that keeps you entertained for hours they try to captivate you inside of casino like events and lootboxes, create habits in you via many in-game actions that provide you with various bonuses but only in case you are active daily and/or pay some money. Game tries to force habits on players so that they return daily. This is reinforced by introducing various tanks (like Annihilator) that are simply much better than the other vehicles (speaking from position of Annihilator owner).On top of this Wargaming is simply unable (or does not want) to introduce a proper matchmaking. You end up either in team that owns opponent or you are in the team that gets completely owned, there is no middle-ground for the most part. I would really like to see games where players act tactically and help each other but for some reason that does not happen here or very rarely. This pattern repeats on several Wargaming games.The game is good overall but matchmaking ruins all the fun + you can feel how badly company wants your money on every corner. WoT Blitz cunningly and silently wants to become your drug, but then fails to entertain you after a while.\t\t\t\n"]