["\n\r\n\t\t\t\t993 people found this review helpful31 people found this review funny\t\t\t\t298\n\n\n\n\n\n\nRecommended\n5,554.9 hrs on record\n\n\n\n\nPosted: 28 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI am a senior citizen with a severe immune disease and this game allows me to have my own adventure weather it is a desperate battle with mutants or just walking through the woods gathering herbs. It keeps my mind active and I look forward to the next days adventures. You people did an outstanding job putting this game together as you did with Skyrim, Fallout 76, and several other games that I have played. I sing your praises and recommend you very Highly when ever I talk about PC games. I hope were together for many years to come. Bethesda Is Very Outstanding!!!Sincerely and Thank You for Your GamesMardahl-Mark\t\t\t\n", "\n\r\n\t\t\t\t475 people found this review helpful216 people found this review funny\t\t\t\t27\n\n\n\n\n\n\nRecommended\n16.9 hrs on record\n\n\n\n\nPosted: 28 January, 2022\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t Fallout 4 is not a game where you go find your son. It's a game where you start out looking for your son and then promptly forget about him.\t\t\t\n", "\n\r\n\t\t\t\t757 people found this review helpful35 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nRecommended\n2,481.2 hrs on record\n\n\n\n\nPosted: 26 March, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreetings: My grandson talked me into trying Fallout 4. I'm an older player (65) who enjoys video games. I am very impressed with the game overall though I do wish I didn't have the CTD's and other issues with the game. But the ability to do the kind of building along with the post war setting has been a lot of fun. Being able to enhance the game through the modding system is very nice as well and gives you more hours of play as you find new things to try. I have spent hours buidling and actually restarted the game now 4 or 5 times trying out different things. I do use quite a few mods and I'm sure the contributes to the CTD's etc in the game. I thing Bethsadia has done a great job presenting this game. I played the original Fallout many years ago. Having learned how to make video's of the gameplay and posting on youtube (mostly for my grandson to see my settlements) has been a nice side benefit of playing fallout. I would recommend the game and using mods...just do all you can to ensure things are loaded correctly.\t\t\t\n", "\n\r\n\t\t\t\t456 people found this review helpful64 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n659.5 hrs on record\n\n\n\n\nPosted: 29 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThere is only one son in this game I care about and that's Dogmeat.\t\t\t\n", "\n\r\n\t\t\t\t765 people found this review helpful24 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n168.1 hrs on record\n\n\n\n\nPosted: 23 October, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'll keep this short.If you want to play an excellent role-playing game where you can create a truly unique character and feel like your decisions have real consequences. Where every decision counts and you are constantly being presented with those decisions. Where factions, tribes and groups have a real impact and significantly affect the world;Play Fallout: New VegasIf you want to play an excellent looter-shooter with finely honed and extensive crafting systems that allow you to have full control over your customisation. Where you don't have to rely on VATS for shooting and weapons feel satisfying to fire/swing. Where power armour is true to its name and really is powerful but also realistic;Play Fallout 4These are two very different games and which one you should play is down to what you want to experience. Fallout: New Vegas is one of the best RPGs ever made but has terrible shooting mechanics and its looting systems are lacklustre. Fallout 4 has excellent mechanics and has one of the best looting and crafting systems in the RPG genre but its storytelling is rather linear and your choices are limited and often quite inconsequential.That's my two-penny's worth\t\t\t\n", "\n\r\n\t\t\t\t334 people found this review helpful68 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n201.0 hrs on record\n\n\n\n\nPosted: 3 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyou'll probably spend more time modding the game than actually playing it\t\t\t\n", "\n\r\n\t\t\t\t2,581 people found this review helpful57 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nNot Recommended\n260.1 hrs on record\n\n\n\n\nPosted: 29 August, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCreation Club, aka: Selling mods.You know what's smart? Selling mods. That totally worked out fine on the Xbox and Playstation. It also worked out extremely well on PC when they shoved it in for Skyrim. You know what else went well? How well recieved it was for modders who cashed in. The modders got so much respect and had no problems what so ever.You know what especially didn't happen when paid mods were introduced to Skyrim? The \"mod store\" sure as hell didn't get spammed with duplicate mods and random people trying to cash in on other people's work, work that was free prior to paid mods(And which was taken down and transfered as paid mods as soon as paid mods became a thing). You know what else didn't happen? The \"mod store\" also wasn't infested with a bunch of useless waste of time, cash grab, ♥♥♥♥♥♥ \"mods\" that some ♥♥♥♥ threw together in five minutes. /sarcasmSeriously, I'm so fed up of the games industry right now. We've got season passes, \"remasters\" of games that are only a year or two old, a bunch of microtransactions not included in season passes(While being sold and released during the season pass' life), we're also seeing the advent of multiple season passes, not just a single season pass per game but upward of three or more season passes for a single game being refreshed every six ♥♥♥♥♥♥♥ months. On top of this? We've got lootboxes. Lootboxes upon lootboxes in literally every single game being released these days which ranges from ♥♥♥♥♥♥ cosmetics which used to be free and unlockable to full on items to make your weapons better(Like the old days of P2W in F2P MMO's). You know how far they've gone now? Lootboxes, paid boosts and \"legendary\" units/items only obtainable through lootboxes, in single player games. Yes. Single player games now have RNG(Basically gambling) lootbox ♥♥♥♥♥♥♥♥ in them that give progression boosts. ♥♥♥♥. This. ♥♥♥♥.Now, the absolute worst of it is the fact that what was once free is now paid(Which seems to be a very common trend these days in the €60 \"Triple Ayy\" games industry). This is content that makes Bethesda's games what they should have been on release and adds a bunch of QoL improvements that should have been in the game on release and haven't actually been developed by Bethesda. Bethesda make the worst inventory systems and have done for years now. It's always been up to the community to fix it and make sense of the ♥♥♥♥♥♥ organisation in inventory across all Bethesda games. Now, with paid mods, you'll be expected to pay €2-€5 for a simple inventory QoL fix. Like, wtf?! You can't justify this crap. Let's also not forget the fact that there's no gaurentees that these mods will be supported in the future. So, say you buy a mod. Your game gets updated. Your mod breaks and the modder who created it doesn't update the mod. Tough ♥♥♥♥. You're SOL and just wasted your money and, possibly, your hundreds of hours game save that relied on a mod to work. Congrats, you've just paid some random ♥♥♥♥♥♥♥ and Bethesda to ♥♥♥♥ you in the ass and take away hundreds of hours of gameplay away from you.And then you have the whole ♥♥♥♥♥♥♥♥♥♥♥ defending this crap and saying \"Oh, but these things won't be paid mods!\" but they will. They absolutely will. Give all this ♥♥♥♥ time and before you know it your favourite inventory mod or travel mod or whatever the hell you like will shift from free to unsupported unless you pay. Then we've got the precedence of what it sets for future titles where this ♥♥♥♥ is baked into the game and there will be no way to support mods outside of it, as in Bethesda and other companies will lock down these games so they can not be modded without using their service. I don't need to explain just how much of an impact that will have on PC gaming. Just remember the amount of freedom as PC gamers we will lose when files and sections of games are locked behind some Single Player DRM which only purpose is to stop people from installing mods outside of the built in \"service.\"Just remember that everything that was said five-ten years ago about microtransactions came true. Every. Single. Thing. Now every game has microtranscations. Now every MP game has ♥♥♥♥♥♥♥ in-game shops to buy skins, weapons, boosts and whatever the hell else. Now every game has a ♥♥♥♥♥♥♥ season pass. Now most -- at least -- have locked DLC or \"microtransactions\" gated on release unless you \"pre-order\" or pay extra for this ♥♥♥♥. Just as it was with microtransactions and the warnings we had about that ♥♥♥♥♥♥♥♥ ten years ago it's going to be the exact same with paid mods. If this ♥♥♥♥ sails, in two to three years time we're going to see DRM for mods(Which is already a thing from the Skyrim paid mods fiasco btw) in every single mod, the mod scene move from being as open and dynamic to allow people to create what they want and enjoy to a more business orientated system which caters to those who make, basically, FotM content. What will happen then? No more breakouts like Battlegrounds, survival genres, nothing because every single modder and their mother will be trying to cash in on flavour of the month ♥♥♥♥♥♥♥♥ content with not a single bit of original thought between them.This is not good for gaming. This kind of content should never have paywalls blocking entry other than the initial purchase of the base game. If a mod really goes beyond and sets a game aside then it should be up to the developers/publishers of said game to reward the modder, not have others pay for it.This is not good.\t\t\t\n", "\n\r\n\t\t\t\t348 people found this review helpful186 people found this review funny\t\t\t\t29\n\n\n\n\n\n\nRecommended\n52.6 hrs on record\n\n\n\n\nPosted: 26 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFound a kid in a fridge. Sold him into slavery. 10/10\t\t\t\n", "\n\r\n\t\t\t\t773 people found this review helpful176 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n278.3 hrs on record\n\n\n\n\nPosted: 21 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInstalled 85 mods .... Completed every quest ..... Built myself a sweet home .... took me nearly 250 hours of pure fun. But well ... another settlement needs my help, so excuse me I have work to do.\t\t\t\n", "\n\r\n\t\t\t\t430 people found this review helpful31 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n4,668.2 hrs on record\n\n\n\n\nPosted: 10 October, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYeah, I've played it for a little bit.In all seriousness: this game has divided fan opinions, but in short: if you don't mind losing some roleplay aspects in exchange for more modern take on combat and a metric crapton of things to do, then I'd recommend this game for you. I think this game should be reviewed by listing the good, the bad and the mixed things individually:The good:+ By far the most detailed, vivid and interesting game world so far. The Commonwealth has a wide variety of different areas to explore, from urban ruins and blasted forests to swamps and the horrifically irradiated Glowing Sea. The game world is also nicely seamless, so there aren't many loading screens outside of interiors and major settlements.+ The combat is so much better than in the last two games. For example, you can now throw grenades and mines without having to put down your current weapon, you can swing your gun to bash anyone that gets too close, and you're no longer forced to wait until the reload animation is finished before you can switch weapons or access your Pip-Boy. In general, the combat also feels much more fluent and intense.+ The new crafting and settlement systems are very extensive (if not very realistic). You can upgrade your weapons and armor as you meet the perk requirements, but you can also use the system to make some rather atypical ones - things like  laser autoshotguns, plasma flamers or, say, an automatic long-range carbines - without breaking the game balance. The settlement system can be used to build anything from a small personal safehouse to full-sized towns with it's own stores and services.+ As mentioned before, there's a whole lot to do. The base game has plenty of side quests, and there are four possible factions you can side with - one of which allows you to spare two of the others if you so please. Each faction has it's own side missions, some of which can be repeated as many as times as you want in a new location. You can play multiple sides pretty far into the game, too, if you're undecided or want to collect several paychecks at once. There's also a new miscellaneous objectives system, which lets you keep track of minor tasks and clues you've come across.+ The game has a decent degree of unpredictability to it. Random encounters from Fallout 3 make a return, and most generic location-specific enemies have randomized equipment and loot every playthrough. Just about every enemy also has different stronger variants, which may replace \"regular\" enemies depending on the player level.+ The game looks and sounds really good. The graphics have been updated, but Bethesda also redid every animation from scratch. In general, almost everything from weapon animations to character movement feels natural and smooth. New Vegas had terrible voice acting for all but few characters, but luckily that mistake was not repeated in FO4: almost every character that talks has good or great voice acting (Deacon and Elder Maxson are good examples of the latter...but see the the first point of Mixed section). The soundtrack deserves a special mention, too: you can tell it has been done with love.+ For a Bethesda game, Fallout 4 is surprisingly bug free. Of course, there's still a fair amount of them, but they tend to be visual/acoustic rather than crashing or game-breaking issues. I don't think I've had more than a few major cases during my playtime that I haven't caused myself with mods, which is pretty impressive considering how complex the game is.The bad:- The new dialogue system is definitely a step back from the last two games. You only have four dialogue choices every time, but the biggest problem is that each of them only have a brief description rather than the full line, which sometimes may be something else than you'd assume. You'll very likely want to fix the latter with mods.- The base story is somewhat lackluster. The new dialogue system severely restricts the amount of lore and background information that is conveyed to the player, so the underlying plot (particularly faction histories and motives) feels rather undetailed in the end. Other than that, the lack of lore is mostly fixed in form of notes and terminal entries, but it'd always be better to hear if from characters themselves.- Lip syncing doesn't seem to be Bethesda's strong suit. Guess that's the trade-off of having tens of thousands of voice lines in the game.- In contrast of the previous games, there are only a couple of S.P.E.C.I.A.L. skill checks in the game (aside from Charisma, of course). This feels like a huge unused potential, considering that in the previous games abilities like Intelligence and Perception allowed alternative approaches to many situations.The mixed:* The player character is voiced in Fallout 4. Both male and female voice actors tend to excel in sarcastic/humorous situations, but the rest is generally in the decent-enough category. Many would have preferred the silent protagonist, and I can see why.* Bethesda has made some retroactive changes into the canon - some good, some bad. For example, I personally love how power armor works in this game, but some other lore detail changes (which I will not spoil) seem to pointlessly contradict the previous games. Luckily, the bad retconning is limited to minor details only.* Creation Club. Like most of the world, I'm against paid mods, but fortunately you're by no means forced to buy anything. In fact, they seem to give out skins and other small stuff for free every week or two, so you can still reap some of the benefits without actually having to support the business practive whatsoever.In the end, I don't think I can give this game a rating that applies to everyone...so let me put it this way:If you prefer more in-depth roleplay, then you might be better off sticking to New Vegas and Fallout 3.If you don't mind that and the flaws listed above too much, then you'll probably find this game to be either 8 or 9 points out of 10. For what's it worth, I've certainly enjoyed it.\t\t\t\n"]