["\n\r\n\t\t\t\t1,008 people found this review helpful44 people found this review funny\t\t\t\t74\n\n\n\n\n\n\nRecommended\n1,038.6 hrs on record\n\n\n\n\nPosted: 11 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWhen I first got the game, I liked it.  Then I met the first mini-boss and died a lot.  I got better.  Watched quite a few walk-throughs and tips videos.  I hated everything about it.  The I-frames, the enemy fight timings, the death mechanics, the Ogre...oh! that damnable, stinking ogre!  I never hated a character more until I had to fight Lady Butterfly.  Then about 20 hours in, I just got it.  I understood.  Then I was able to appreciate the landscapes, the quests, and the story line. I got my platinum in about 43 hours.  I've played through about 38 times, conquered all DLC gauntlets, and still love playing it.  I can now do a full run through in about 10 hours if I play all the side quests and kill all there is to kill.  Still hate the Headless though.  1007 hours and still love it.  I probably can't play anything else that From Software has now, but that is okay.  I'll still give the Souls series a try at some point.  Looking forward to Elden Ring.\t\t\t\n", "\n\r\n\t\t\t\t1,085 people found this review helpful1,306 people found this review funny\t\t\t\t98\n\n\n\n\n\n\nRecommended\n82.0 hrs on record\n\n\n\n\nPosted: 19 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe title is a lie, you die more than twice.\t\t\t\n", "\n\r\n\t\t\t\t1,087 people found this review helpful63 people found this review funny\t\t\t\t63\n\n\n\n\n\n\nRecommended\n90.3 hrs on record\n\n\n\n\nPosted: 5 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYou don't lose when you die, you lose when you quit.\t\t\t\n", "\n\r\n\t\t\t\t850 people found this review helpful473 people found this review funny\t\t\t\t35\n\n\n\n\n\n\nRecommended\n58.3 hrs on record\n\n\n\n\nPosted: 12 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDied more than twice\t\t\t\n", "\n\r\n\t\t\t\t563 people found this review helpful20 people found this review funny\t\t\t\t57\n\n\n\n\n\n\nRecommended\n184.0 hrs on record\n\n\n\n\nPosted: 13 May, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was bored, and saw that this game won game of the year, so I bought it.After playing this game for two and a half hours, dying repeatedly to the game's first mini-boss, I contacted steam and demanded a refund for a game I simply couldn't play....but I couldn't get it out of my head.I got the game again for Christmas, and after finally killing that first mini-boss, I couldn't get over how I felt. I kept going, perfecting the fighting style until I reached the game's first real boss. It knocked me down again. I fought that boss over and over again until the swordplay became a lethal kind of dance. I felt invincible. After the first boss, I went onto the next one, and the next, until I completed the game's first ending. Then I played it all again, exploring the abilities, fighting styles, and story arcs that I hadn't tried before. I reached the game's truly final boss and killed it in one try because the game had trained me to fight so well. It was by far the most rewarding experience any video game has ever given me. After over 150 hours, I earned every single achievement.From someone who refunded this game the first day they played it, from someone who would have never been remotely interested in Japanese culture otherwise, let me tell you that Sekiro is one of a kind. Not only is the combat an art-form in and of itself, but the story is moving and the characters compelling.If you buy Sekiro, don't get frustrated when you hit a wall. Don't look up cheese strategies or try to savescum the game. Get back up, watch a walkthrough or two if you really need to, and vault over that wall like a f***ing shinobi. You won't regret it.\t\t\t\n", "\n\r\n\t\t\t\t912 people found this review helpful775 people found this review funny\t\t\t\t72\n\n\n\n\n\n\nRecommended\n13.9 hrs on record\n\n\n\n\nPosted: 2 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe title is a lie, you die more than twice.\t\t\t\n", "\n\r\n\t\t\t\t704 people found this review helpful324 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n126.6 hrs on record\n\n\n\n\nPosted: 25 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe only game where I can beat an ancient dragon god on my first try, and yet some middle aged dude in his bath robe can make me regret being born. 10/10\t\t\t\n", "\n\r\n\t\t\t\t452 people found this review helpful269 people found this review funny\t\t\t\t22\n\n\n\n\n\n\nRecommended\n109.6 hrs on record\n\n\n\n\nPosted: 10 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI died more than twice\t\t\t\n", "\n\r\n\t\t\t\t1,480 people found this review helpful73 people found this review funny\t\t\t\t12\n\n\n\n\n\n\nRecommended\n136.2 hrs on record\n\n\n\n\nPosted: 27 March, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSekiro is not a Souls game. This can't be stressed enough. Attempt to i-frame dodge through the game and you will get your ass slapped all the way back to Lordran. While it borrows certain elements from Souls, like the checkpoint system or cryptic NPC questlines, it's pretty much its own beast. And what a beast it is. It's one of those good news, bad news situations. Good news: the days when you needed to keep an eye on your stamina for every attack, block or dodge are over. Bad news: that doesn't mean the game is any less challenging. Quite the opposite, actually. Wolfie goes down in two hits tops, and at all times he's either heavily outnumbered or he gets crushed in the health bar measuring contest. And the absence of stats, gear and online co-op means there are no shortcuts. You won't be able to overlevel, no Solaire will come to your aid. It's either nut up or shut up.Luckily, there are ways to put you at a lesser disadvantage. Sekiro features a rudimentary stealth system and enough freedom to thin out your enemies' ranks one by one. Most of the times you can clear entire areas just by being sneaky. Apparently, Sekiro started out as a Tenchu game and I totally believe it, considering how far stealth will get you. But eventually a direct confrontation will be unavoidable. And where Souls games required you to only land that one parry, Sekiro demands that you time your blocks near perfectly several times per exchange. Combat is fast, fluid and demanding enough to make you break a sweat.While the areas are open and generally well-designed, they are not exactly eyecandy. Souls games are known for their sinister beauty, but that is largely absent in Sekiro. Some areas look flat-out rough. Only rarely will you get the urge to stop and soak in the atmosphere. A missed opportunity, really. And while the environments leave room for exploration, the absence of cool gear makes it feel strangely unrewarding. Also, due to the nature of combat you will see the same instakill moves and finishers quite often. A bit of variety would have been nice.Like the player, Sekiro faces its own set of challenges. Developer From Software has been around for over three decades, but only since the release of Demon's Souls the studio has gained a larger recognition in the West. Ever since, most of their games have been Souls games either directly or in spirit. Being widely known as the developer of Souls games came with the issue that they were expected to make nothing but Souls games - a curse, if you will. Sekiro marks the first time in a while that a major From Software title branches out far enough to be called its own thing - and be accepted by a large audience. With that leap of faith out of the way, it'll be exciting to see what they will come up with next.\t\t\t\n", "\n\r\n\t\t\t\t760 people found this review helpful595 people found this review funny\t\t\t\t51\n\n\n\n\n\n\nRecommended\n130.8 hrs on record\n\n\n\n\nPosted: 19 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis game is very educational. I can now write death in Japanese\t\t\t\n"]