["\n\r\n\t\t\t\t5,279 people found this review helpful90 people found this review funny\t\t\t\t628\n\n\n\n\n\n\nNot Recommended\n1,201.3 hrs on record\n\n\n\n\nPosted: 19 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAfter 1k hours on live and open beta I decided to quit. On the new world forums website I made a post about my reasons for quitting, and included in that post was fair criticism. The post gained significant traction with 2.5k views and over hundreds of comments. A day later my post was remove and my account was suspended because I \"no longer am an active player\" (referring to me mentioning im quitting). This is a rather obvious attempt at censoring what was a popular thread containing discussion about the frankly atrocious state of the game. I went to reddit to post about my ban and obvious attempt at censorship, that post was taken down within seconds. I made a 2nd forums account and included in a new post screen shots of both the reddit post being taken down and my initial forum account being suspended. My 2nd account forum was then suspended a 10 minutes after making the new post which was a PSA for the policing and censorship going on. In that post I asked people to screen shot the post so that in case i was censored again, there was proof to share and raise the alarms. This game is in an atrocious state, and the developers dont care to communicate. You can watch a youtube video from any reputable content creator and they will highlight the state of the game in a better way than I could here in a steam review. What I can tell you, is that the Officials, developers, community managers on forums, don't care about you. They have shady business ethic and are looking to actively silence fair criticism of the game. Link of screenshots re censoring me via banning on forums and sub reddithttps://imgur.com/a/9II8exsJune 2022 Update: Just coming back to give another update. Recent patch in new world made combat clunky as hell, pvp is terrible because of it. New world reddit mods are silencing and removing all posts that attempt to discuss this.-Luxendra moderator on an absolute power trip censoring and banning players on forums and discord.\t\t\t\n", "\n\r\n\t\t\t\t6,725 people found this review helpful69 people found this review funny\t\t\t\t952\n\n\n\n\n\n\nNot Recommended\n734.1 hrs on record\n\n\n\n\nPosted: 20 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEDIT:  Leaving my original review below because the majority of it is still valid.  Updating my review to account for the changes in Brimstone Sands.  UPDATED REVIEW:  Since I first reviewed this game there have been a HUGE amount of improvements, two new weapons and a whole new zone.  This is starting to be the game it should have been at release with travel costs worked out, storage issues all but resolved and group finder that kinda sorta does what it should.  The gear grind is still there but it isn't nearly as painful as it was and they even implemented more ways that Solo/Casual players can get shards.  Finally, they gave Fresh Start servers which brought a bunch of people back to the game (it remains to be seen how long they'll stay).  The reason I can't change my review to Recommend is that devs are still blatantly pro-melee.  They're not even denying it anymore.  You don't need to see it in the constant nerfs to mages (at least they stopped picking on healers for a bit), you just need to watch what they say in their dev streams and interviews.  Then they released the Greatsword, which is hands down the strongest weapon in the game, bar none.  If they would at least pretend that they want this game to be fun and fair for every playstyle we could maybe turn a blind eye to their obvious melee favoritism, but they aren't even pretending anymore.  And then you have the sad state of affairs that is OPR--the one game mode where melee doesn't dominate.  Instead, you have devs who have, by design, allowed musket players to have CoD in New World.  And then, just for good measure, they threw in Mortal Empowerment and thought it was a good idea.   Overall, this game is now, at least, starting to get on the right track.  If you enjoy playing Tank or Melee DPS, this game is for you.  Healing has been gutted from what it once was, but it's playable and they aren't planning more healing nerfs in the near future so that's a plus.  Ranged DPS, and especially mages, should probably look elsewhere for their enjoyment. We all hold out hope the devs will get better at balancing, but given their track record I don't think I'd put too much faith in that.   ORIGINAL REVIEW:I don't think I've ever taken the time to review a game in the 11+ years I've had Steam.  However New World's current direction has compelled me to let future potential buyers know what they're getting into.I'm a old man, people.  I'm old enough that many of the people playing this game could be a child of mine.  My first MMO was Ultima Online (Pre-Tram) and I've played every major (and most non-major) MMOs since then.  I love the genre, even if I don't always enjoy every game that releases in the MMO realm.  I'll save you a long and boring rant (which would just cover everything that the other negative reviewers have already covered).  But to sum things up:1) New World is a great game with a lot of potential that has been marred by a steady stream of patches and updates which reflect poor dev team decisions.  These patches show that the devs listen to a subset of outspoken or otherwise \"popular\" people (looking at you streamers/content creators) and not the more rational player base as a whole.  2) The Devs, if judged by their actions alone, are clueless about balance and quality of user-experience in an MMO.  Either that or they are making very purposeful decisions that set up future \"boost\" items in their cash shop.  I really don't know which is the case.  3) The endgame methods to improve your gear (one of the main goals of all MMOs) were already terrible.  Their \"watermark farming\" method was a pain before, but recent changes have made it an even more difficult process.4) With regard to #3 above--if you haven't been max level for awhile now you are almost never going to catch up at this point.  Those of us who were able to get our watermarks up when at least some of the watermarking content was doable either solo or in small groups will have a huge advantage over new 60's--especially on smaller servers.  Most watermarking content now can only be done by zergs.  If you play on a large server it's not much of an issue, but the smaller servers are going to have problems.5) Faction imbalances are a major problem and this game has no sound way to deal with this issue.6) Healers:  Don't come to New World if you enjoy the healing playstyle.  I play healers/support in every MMO where such classes are an option.  New world has healing, but they nerf it every patch.  They do this because those loud, influential voices complain about healing.  The Devs are not done nerfing healing--more will come because even after drastically reducing healing in the last patch (and the 3-4 before it), the same voices are still complaining.  Add in the lack of raid frames or even group member hotkeys and healing become a frustrating, unfun experience.7) Anyone with MMO experience expects the Meta to change from time to time but since launch the meta has been and always will be (if the Devs continue to act as they have been) the same.  Anything that threatens the Great Axe/Warhammer meta gets nerfed (healers, mages, bow).  Outside the brief period when Hatchet was OP due to a bug, the Meta of Gaxe/WH hasn't changed.  8) Bugs.  I won't complain too much about this because I understand that every new MMO is filled with bugs.  Same with exploits.  I can be forgiving here but I cannot deny that the bugs and exploits have severely impacted player experience.  Heck--I'm currently the victim of the latest bug where you lose 5 attribute points every time you respec.   This will get fixed eventually, I'm sure, but it is undeniably frustrating.To summarize, I am unable to recommend this game to new players due to the direction we can all see the Devs taking New World.  They nerf based on the desire of the vocal minority, they make end game harder to drag out the watermarking experience and they seem to create 2 problems every time they fix one.  This game needs about a year to mature and even out.  Save your money until then.\t\t\t\n", "\n\r\n\t\t\t\t2,361 people found this review helpful43 people found this review funny\t\t\t\t253\n\n\n\n\n\n\nNot Recommended\n171.0 hrs on record\n\n\n\n\nPosted: 14 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLook, I'll admit that when this game first launched, I was hyped. I loved the beta. Crafting felt simple yet meaningful and worthwhile. The real-time combat system appealed to me in ways ESO never could. Some of the locales were visually stunning. I thought it was going places. To be fair, I wasn't wrong, but those places trend sharply in an unflattering direction.Be warned, I had a lot to say below.If you're a player whose interest lies almost solely in world PvP, you might find a niche for yourself in this game. If you're a player whose primary goal is to run PvE content with your friends, on the other hand, I guarantee you will be disappointed. This game struggled with an identity crisis from day one, which has yet to be resolved. The developers still want you to believe this is a normal MMO, not an attempt at recreating Guild Wars PvP in disguise. I won't go so far yet as to say it's completely dead and there's no hope of saving it, but the numbers paint a pretty grim picture, as it was already down 90% of its daily concurrent player count within a month or two of launch. It's going to take a lot of serious soul searching, a concrete plan, a ton of work, and a ton of time that they may not have.Pros: - The real time combat, as I mentioned before, feels like an improvement to me over what ESO tried to do. Some of the weapons feel very fluid once you've gained several mastery ranks and put together some semblance of a build. It's not perfect - ranged weapons in particular have some serious lingering problems that will appear later in this list, but it's a solid system at its core.- Visuals are great. They nailed it here.- Crafting. I did not have enough good things to say about this during the beta. Gathering isn't as tedious as other MMOs have made it, and rewards you with a reasonable amount of supplies even if you find yourself competing with other people for nodes. The things you can craft feel meaningful, and it's not super difficult to keep it leveling alongside combat for the majority of the game. Obviously that will change at the upper tiers, but that's just something that comes with the territory.Cons: - Population. This game went from one extreme to the other in this sense. There were massive overpopulation and queue issues at launch, which were largely self-inflicted with the servers only supporting 2000 concurrent players, and no cross-world party capability (which is still not a possibility, and to the best of our knowledge, never will). Now, it's underpopulated. Players have consolidated to keep a few servers here and there alive, but most are ghost towns, with some dominated completely by a few companies (AKA guilds). Update 02/13/22: At the time of writing this, New World has gone from a million players at launch, to averaging ~70,000 barely four and a half months later. Despite server merges having just happened, the count continues to drop at a fast enough rate that remaining players are already asking for another wave.- Player-controlled economy. This was a neat idea in theory. Its execution, however, is ruined by the state of the game. Companies control the economy in towns they own, so if a company takes control of a massive portion of the map, they quite simply ruin the experience by bleeding you dry. - PvP-driven PvE. This is something I have hated in any MMO. Decisions on content are influenced first and foremost by PvP, because it's clear AGS wanted this to be a PvP game and threw a PvE veneer over it to lure more people in for the money. If you're a PvE player, your weapons will be nerfed if enough PvP players complain that it's doing too much to them, regardless of how badly that affects the content you're playing.- Poor AI/pathing. This is where the issues with ranged weapons come into play. AI enemy movement is so jerky and rigid that you'll find them twitching out of your shots constantly. Instead of simply turning around, they will take a circuitous and unpredictable path to walk in a pseudo-circle until they're facing you. When they reach you, they'll randomly move laterally for no reason at all. Sometimes this benefits you because they'll be attacking and will miss because of the strange movement. Most of the time, it just screws with you instead.- Balance issues. The game claims to offer variety with its armor types, but the truth is that unless you're wearing heavy armor, you're going to suffer. There is no shortage of enemies that are capable of covering great distances with their attacks, and stagger against you is abysmally bad. Don't be surprised if you find yourself stun locked on a regular basis after mistiming one dodge.- Content. Or lack thereof. There is no real endgame to speak of. There's a PvPvE activity called Outpost Rush that you can endlessly farm, and there is a 60 zone you can grind, but for a PvE player there's no purpose to it. There's nothing to do with that fancy gear you're farming, and in the 3+ months this game has been out, nothing has been added to it except for one new weapon type, and one new enemy type that only spawns in very specific locations. Part of that is because of....- Endless bugs. AGS has been constantly busy, seemingly just creating a new major bug every time they supposedly patch another. - Communication. This has been bad far more frequently than it's been good. When it happens, timelines are often extremely vague. On one particular day, the AWS backbone went down for the entire East region, causing massive issues across far more than just New World. Not many might have been aware of this, however, because a large number of services NOT named Amazon were the visibly affected ones. Instead of making people aware of this, and providing a link to their parent company's status page, AGS simply stated \"We're down\" in the morning, then was silent for 8 hours following. There has never even been a roadmap made available to even indicate a general short or long term plan for the game. Either they don't know where to go from here, or there are just that many issues to work on, that they don't have time to figure out a plan for the future. Either way - not good.I know this was a lot to sift through, and if you actually read through this whole thing, I'm impressed. In the end, though, the TL;DR version is just that I can't recommend even trying this game unless you exist to play PvP content. PvE is extremely buggy and lackluster, and PvP-favorable updates will always take priority. Maybe within the next year or so, we'll see if they've managed to change course in a drastic way, and figured out what kind of game they want New World to be. If that happens, I'll revise this, but I'm not going to hold my breath.\t\t\t\n", "\n\r\n\t\t\t\t1,420 people found this review helpful659 people found this review funny\t\t\t\t107\n\n\n\n\n\n\nNot Recommended\n1,762.1 hrs on record\n\n\n\n\nPosted: 13 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmazon took endgame too seriously and literally ended the game there.\t\t\t\n", "\n\r\n\t\t\t\t13,912 people found this review helpful1,368 people found this review funny\t\t\t\t1,272\n\n\n\n\n\n\nNot Recommended\n603.9 hrs on record\n\n\n\n\nPosted: 13 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI called out some dude selling overpriced bags in global chat and started telling people how to find better prices in trade post by viewing all territory prices in top right of trade post menu and his entire company/guild said they were mass reporting me and I got a 24 hour automated ban for abusive behavior.I wish I was making this up. Literally 24 hour banned for helping players not get scammed.\t\t\t\n", "\n\r\n\t\t\t\t2,638 people found this review helpful155 people found this review funny\t\t\t\t267\n\n\n\n\n\n\nNot Recommended\n1,048.2 hrs on record\n\n\n\n\nPosted: 18 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEDIT:Since the community is finding the review helpful I thought to make it justice and update with the new developments and also re-structure the original one to a more easy-to-read and eye-friendly one.So, on the 18th of December (day that I started my holidays) I logged-in to the surprise of being greeted by a permanent ban for \"Disruptive behaviour\". A bit shocked by the message I clicked on the \"appeal the ban\" link.My message was short and straight to the point. The ban did not make any sense and I requested some information as to why in this world I would get such ban (disruptive) when out of the large amount of hours I had played to that moment, the vast majority was invested in farming PvE in order to grind the famous \"watermark system\" and get some nice loot for later Pvping.Minutes later I got an email which at the beginning I thought it was automated (due to it being quick) but I was wrong. It was a copy/paste that could not be meant for me as it stated the following: \"The previous agent provided you already of all the available information\" and \"We're always happy to help if you have any other questions, however we do not have further insight to provide and further inquiries on this matter will not receive a response.\"Took a minute or five to try and digest such email and I proceeded to contact AGS customer service chat and simultaneously appeal again letting them know that there was not a previous agent that provided me any information.As I was diving in an interesting (sarcasm) conversation with the chat agent where he could not give me any information as he claimed that \"only moderators have access to that information\" I did receive the automate email that you can find screenshots on the internet. Basically says that the ban is merited and that they can't share information so they won't reply any further emails.I decided to provide some feedback to the guy on the chat about the service and he assured me he would pass it along for which I received an email from \"Krishna a specialist From Amazon Game Studios\". Next level specialist as the email contained just links to amazon website to the different sections such as help, general questions, your account, contact-us. But there was one sentence that was different:\"Please wait for further communication from moderation the team.\"So, as it was close to holidays I did not expect any reply and I used it to exercise my GDPR right and ask for my data. Just to see if I could find any information in there. Which I did. One of the documents called \"AmazonGames.Moderation.Penalties.csv\" contained my alleged \"merited ban\" information with... no information. The penaltyContext column states \"N/A\".It has been two weeks since their last email asking me to wait for further communication and as I suspected, no communication has been made. Now I am wondering if I should bother in appeal again or straight write a formal complain to amazon complaints email address stating my case and how incompetent their AGS customer service is.As in my original review, I still think I got mass reported by some company that got mad in Outpost Rush game mode. I haven't only pre-ordered the game and played the 2 betas but also gifted the game to friends, brought other friends from different games to play with me and bought their premium currency as I really wanted to support the project and see the game succeed.Unfortunately, due to the given situation, and even overlooking all the flaws, bugs and other problems stated in many other reviews, I cannot recommend anyone to give them money and buy their product unless you are aware and consent to be disrupted of a service you paid for for no reason with no warnings or communication from their part.PeaceORIGINAL:Permabanned for no apparent reason. Appeal automatic answer says they cannot disclose any information and to not contact them back. I am inclined to believe I got mass reported by some company that got mad in the game mode Outpost Rush. I have over 1000 hours game play which the vast majority of it I invested in farming watermark and gear to finally do some PvP. I started doing PvP in OPR last week and I lasted less than a week. Beware if you are into PvPing it can lead to your account being banned if you are disliked by any company/company member that you can repeatedly kill. AGS customer services is the poorest I have ever came across with. No line of contact, just an automatic message where they state they refuse to give you information about it and that they will not reply your messages.\t\t\t\n", "\n\r\n\t\t\t\t458 people found this review helpful12 people found this review funny\t\t\t\t48\n\n\n\n\n\n\nNot Recommended\n79.0 hrs on record\n\n\n\n\nPosted: 24 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNew World is a game with infinite potential, but is handled by lazy and incompetent management. Mired by issues since it's launch, it was never able to recover. For reasons beyond all understanding, Amazon thought it wise to push out numerous \"bugfix\" patches without ever creating a Public Test server. Sure, they eventually did make one, but it was far too late.PvP was destroyed by bugs and exploits, and thanks to the mass-exodus of frustrated PvPers, the warring faction game design fell apart completely. Numerous servers are now completely owned by a single faction without any hope of upheaval. People in the other factions face exorbitant taxes, price markups and fast-travel costs, and cannot join the dominating factions. This causes even more to leave.The crafters had their crafting gear completely removed from the game with the hope of re-adding it in future, for no real reason. Crafters log in naked and are pitifully compensated for their loss. The watermarking/prestige endgame system also nukes crafters from orbit, where crafting endgame gear scales it down to their level. Which means crafters that spend more time crafting and less time doing the pitiful PvE endgame content will find their goods diminish heavily in value. Crafters begin their own mass-exodus from the game.All the while, numerous currency duplication glitches plague the game. And thanks to the lack of a Test Server, one of the fixes for a money duping glitch RESULTED in another, separate duping glitch. At this point, the economy was completely obliterated. Most of the still-dedicated players were now sitting atop hoards of gold numbering in the millions, if not billions. Anything they wanted, they could buy. Prices of regular items skyrocketed thanks to the devalued currency. Newer players that didn't have the ability to abuse these glitches now cannot use the auction house thanks to the price of everything being way too high, thanks to the infinite quantities of cash flowing in the server. This causes even more players to leave; and heavily discourages any more from joining.Servers are now at critically low levels, and the in-game systems work against it yet again. With less people playing, taxes aren't being paid. This causes towns to decline, crafting stations to lose their levels, and suddenly nobody can craft anything. Everything is stuck at level one, and it takes time and resources to level them back up -- not just cash. This causes those dying servers to lose even more, putting them in a death-spiral they can't recover from. At the time of writing, the most populated servers in the entire game, in all regions, hardly go over half of their total capacity anymore. And many, *many* more do not even come close to half capacity.An awful, mismanaged mess.\t\t\t\n", "\n\r\n\t\t\t\t483 people found this review helpful13 people found this review funny\t\t\t\t46\n\n\n\n\n\n\nRecommended\n260.7 hrs on record\n\n\n\n\nPosted: 22 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI played on release and quit since there wasnt an end-game i found interesting. I came back with Brimstone sands, 1 year later on a fresh start server. My overall recommendation is Neutral. + Levelling much quicker now and you can solo level or party level + Zone reworks are much more pleasing aesthetically+ Questing is better overall + Dungeons/Expeditions are quite fun and often relatively challenging + Brimstone Sands area is well designed and feels fleshed out+ Gearing system and UI is better+ Gameplay is great - Elite Chest Runs or World Tours straight up feel like cheating gearscore and how theyre played with massive zergs feel like  it is NOT the intended way- Outpost Rush has terrible performance - Not enough weapon variety, everything feels busted in the right hands or gear setup, but most people in PvP play the same thing, rather than balance things or nerf them into oblivion, maybe creating more weapons and adding variety - Town Board missions are almost useless and incredibly boring - End game, as it is now, still isnt enough to hold my attention or really leave me the feeling of wanting to play, which is why im putting the game down again for a while - Crafting feels like ass I feel like AGS have made strides when it comes to NW from release,  but theyve failed to deliver a meaningful and interactive endgame. I feel like im basically just going through the motions, checking off boxes and turning off my brain, which eventually turns into boredom and being left with thoughts, \"why should i bother?\" I feel like New World is a mile wide but an inch deep.\t\t\t\n", "\n\r\n\t\t\t\t622 people found this review helpful19 people found this review funny\t\t\t\t83\n\n\n\n\n\n\nRecommended\n447.8 hrs on record\n\n\n\n\nPosted: 3 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTDLR version: Great game, worth a buy.I bought the game when  it first came out and stopped playing after a week or so. I put about 15 hours into it and TBH I found the game boring and a bit confusing. (I'm over 60 so I get confused easily :) )I came back in September and I'm hooked. I have never done an expedition or a \"raid\" and I don't PVP. My character is up to Lvl 60 so the game is solo-player friendly. Now I'm working on my crafting skills and I've got a new character on a \"fresh start\" server in order to experience the new starting story, which is great so far. I had to wait about 10 minutes in a queue but it was day one so to be expected.I think it's one of the better MMO games I've played over the years, and I've played quite a few.\t\t\t\n", "\n\r\n\t\t\t\t558 people found this review helpful17 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nNot Recommended\n485.7 hrs on record\n\n\n\n\nPosted: 13 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(lvl 1-30)   10/10(lvl 30-60)   2/10(endgame)  0/10\t\t\t\n"]