["\n\r\n\t\t\t\t2,029 people found this review helpful51 people found this review funny\t\t\t\t40\n\n\n\n\n\n\nRecommended\n8,678.9 hrs on record\n\n\n\n\nPosted: 30 October, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI am in my seventies.  My son wanted me to play an open game instead of the single games I was playing before.  I am inspired by the graphics of each country that I travel in , each one is different.  The puzzles are complex but doable.  Each cave is distinctive and some are so enclosed while others you have to walk through slimy water to get to the other side of the trail.  It seems so realistic at times.  The story line continues when you least expect it and you meet characters where you least expect them.  Great Game.  Glad I found and play it.\t\t\t\n", "\n\r\n\t\t\t\t1,725 people found this review helpful158 people found this review funny\t\t\t\t126\n\n\n\n\n\n\nRecommended\n10,905.6 hrs on record\n\n\n\n\nPosted: 31 March, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'm a 70 yr old lady, and I've played for some time now and I love this game. I will never be hardcore or even a good player. But there are so many things to do in this game it is almost overwhelming. Quests are very good, the story-line is very good and last but not least, the graphics are fabulous. On the downside; it is expensive being a Plus member, especially on a retirement pay (shoe-string budget). I recommend a much cheaper monthly fee. There is ofc the DLC content you get with the Plus membership but the ideal is to have a cheaper option only for that magical bag space just for crafters. Well, it's just a thought.Happy New Year 2020!Just a review of 2019 gameplay (many hours as you can see).And I'm still playing (since my birthday 7 Dec 2017). I have just scratched the surface...If you are looking for an adventure out of this world (pun intended) Elder Scrolls Online is the very very best.I do pay for Eso plus, I need that magic bag since I farm and horde like a squirrel and craft like a boss. I have soon maxed out my main crafter.I am in a guild with absolutely fabulous and helpful people. I have started to have a bit of confidence doing trials and dungeons with this guild, they know I am old and slow and they are patient with me. Hopefully, I will be a better team player this year. I am working on it.In the meantime, I quest, explore, collect whatever, do delves, public dungeons, world bosses, farm and craft. And I enjoy it all!All the best to all gamers in 2020.I have edited this review, the starting-date was wrong, I got the game on 6 Dec 2017, and started to play on my B-day, 7 Dec 2017. Otherwise, counting the hours of gameplay, I must have been glued to the screen, LOL. I do have a life outside Tamriel, I promise... To All gamers Stay Safe in these crazy times. / Onna_BugeishaUPDATE 2022; This coming 7 Dec I'll turn 73 yrs which means that I now played this game for 5 yrs and I still love it.Thank You! To all wonderful people for your heart-warming comments and awards. I like the titel \"Gaming Grandma\"  I have a confession to make - I fell in love with Horizon Zero Dawn, and spent some time there, i.e. I did 6 re-runs of that game (lol), it's a fabulous game. Now I am back in ESO again with the new High Isle chapter and two new companions, there are just so many things to do in ESO you never run out of options. Things like crafting, just exploring and farming, decorating your homes and create gardens... even fishing is very relaxing when you need a rest from bandits and monsters. Have I mentioned I lured my husband from Guild Wars 2, to come and join me in ESO last year? Now we play together, so much fun. A very important advice to all couples out there... this game is captivating and time-consuming - so please, see to it that you both play together or you might end up wondering what in the world happened to your significant other, seriously. I hope to see you in game or mail me (I am @Wing-Zun - on PC, EU server), I am in three trading guilds (BTW an excellent way to get some gold).  Arenthian Trade Guild - Tamriel Marketeers - The Twelwe Knights. Very nice guilds.Wish you all Good Gaming and take care. / Onna_Bugeisha\t\t\t\n", "\n\r\n\t\t\t\t607 people found this review helpful10 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n729.9 hrs on record\n\n\n\n\nPosted: 18 May, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have been paying this game for years, building my opinions of the game. The easiest way to describe it would be Pros v.s. Cons. Pros:Easy to learn, hard to master.The Questing only gets better with each expansion.You don't NEED to interact with anyone. Treat it like a single player game if you want and call it hard mode.Fun dungeons that don't get boring with just a couple of runs.Tons of \"End Game\" content to keep one busy far after they reach max gear level.Super Fun PvP system with Cyrodil Tri-Banner WarIf you want to specialize in something like crafting, it is diverse and fun enough to keep you entertained, then become extremely profitable in the future.Cons:To be a crafter in the most efficient way, you NEED to subscribe to ESO Plus (but as a little sneaky pro, ESO Plus gives all the DLC bundled with it plus \"crowns\" equaling the price paid for subscription\"VETERAN MAELSTROM ARENA IS UNFAIRLY DIFFICULT favoring Magika DPS players with very good sustainability and constant shield action. A bit of tough love that pushes away newer or less experienced players.PvP, though really fun, has a very steep learning curve that leaves many unsure where to start, luckily PvP isn't the main focus of the game.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~So where does this leave us? Is the game worth putting in time and money? Simple answer is, yeah. Despite a rough launch in 2014, ESO has improved and worked out MOST of it's flaws and kinks, making it the great and enjoyable sandbox MMO it is today. -If you are playing and feel you need some direction you can send me a message via mail in game @Cactusking158 and I will do my best to answer any questions that come my way.Happy adventuring, and may you meet many fine people along your journey. \n", "\n\r\n\t\t\t\t609 people found this review helpful54 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n20,759.6 hrs on record\n\n\n\n\nPosted: 17 May, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAn amazing game .. incredible variety of different activities, meet great people. Highly recommend ESO for more seniors to play .. at 70 i find it keeps my mind active, however it gets addictive.I would like to see more consideration of Seniors regarding cost though. ESO Plus is an absolute must but the monthly cost is getting difficult to handle. \n", "\n\r\n\t\t\t\t3,180 people found this review helpful61 people found this review funny\t\t\t\t240\n\n\n\n\n\n\nNot Recommended\n44.3 hrs on record\n\n\n\n\nPosted: 11 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTheir last privacy agreement update (January 1st, 2021) states they will \"sell\" users information, including name, email and billing address to third party companies (including social media and advertising). There is no other way of playing the game without accepting those terms, very sad practices for a paid game really.\t\t\t\n", "\n\r\n\t\t\t\t744 people found this review helpful5 people found this review funny\t\t\t\t3\n\n\n\n\n\n\nRecommended\n160.1 hrs on record\n\n\n\n\nPosted: 16 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTLTR: ESO is the best MMO I've played so far.The Good.It has retained many of the best elements from the Elder Scrolls series.-Fantastic sound-score.-Fine graphics.-A world that feels alive.-Great exploration gameplay.The leveling and combat system is far better than any Elder Scrolls game, by miles. For PvE combat is great, tho I haven't played for long enough to get into PvP yet. You can choose to grind up to cap in a single session, if that strikes your fancy. Or you could care less about leveling and still participate fully in all non-endgame PvE.ESO does not waste my time with long travel times, I can get to anywhere I've already been in between 30 sec to a minute. For me this is a very important point. I detest games that fakes longviety my wasting my time.ESO is not in any way pay-to-win, and it doesen't unnaturally inconvenience the player to make me pay extra. The only inconvenience in the game comes with spontaniously harvesting crafting ingrediants while questing at the same time. This was an inconvenience in the Bethesdas Elder Scrolls games aswell because of inventory. You can pay to unnaturally compensate for this inconvenience through an ingredient-bag.ESO has pay for vanity.The world is immensly open. I can go anywhere I want and be successful straight from the start. There are many questlines with their own story tying into the main story. I can choose freely what storyline to follow, or I can ignore the story entirely if I just want to grind my way to the endgame content or just want to explore. This also means the game is extremely accessible for anyone.Crafting is plesant and feels meaningful so far. There are crafting-quests in addition to crafting for trade, if I want to pursue it as a career. There are few games where I enjoy crafting, but in this one it seems ok.Stealth gameplay is fun, although not innovative by any means.Playing together ad hoc is fun even without groupinng up. Just running together with random people for an area or a difficult fight is quite fun. Probably because combat is fast-paced, players are considered allies for the purpose of abilities, and game mechanics generally supports doing so. It works very well for any open area I've been to, and is faster than grouping up.Some of the dialouge is good.Some of the quests are ok.The Bad.With the game being extremely accessible, people looking for a challenge will have to do a bit of searching or research where to go and who to hook up with.Because the enemies and treasure scales with level, ESO doesen't have the mother-haul aspect of treasure-hunting that some older Elder Scrolls titles had. For instance, in the original Morrowind I could sneak into an ancient abandoned fortress, find a coven of vampires there so powerful they could one-hit kill me, sneak past them, discover an endgame weapon, steal it and leave. It was a very unique feeling when just stumbling into it while exploring.The community tools for ESO are the porest of any MMO I've played. I haven't found an accessible way of reaching ppl even for PUGs. There is no tutorial on how to effectively get a group going, and frankly zero incentive to do so anyway in any area I've been so far. Further, getting a guild seems to be a matter of blindly accepting guild-invites from ppl spamming general chat. For instance I've found no credible channel on how to get info on guilds that may be suitable for me, seek them out and ask for an invite. As a noob I find getting involved in the community in ESO a frustrating chore.There is a tool for queing to participate in dungeons (instances) with PUGs. The tool is never explained however, you just have to find it yourself. Also the queing I've done takes 30-90 minutes. Some times of the day I'm unable to find PUGs for dungeons at all through this tool.The community also doesen't seem very inviting towards new players in my experience. I've not seen anyone being very helpful towards each other yet. It's not that it's hostile, just not very friendly either. It may of course be because the Morrowind expansion was just released and all the established players are over there, for all I know.I cannot fly, levitate or do Khajiit-level jumps in ESO.Some of the story isn't good. They all pivot around the main story in a very overt way. Like in the old arcade games, where there is a scheming badguy and everything except the end-fight is about thwarting his minions. \"His\" minions are everywhere in ESO: Tamriel, and it's just to much of the same. This is very different from the other Elder Scrolls titles, where the monsters of the land seemed to make up a whole ecosystem on their own, with their own lives and events. It makes the stories that follow the quests boring after 25 hours, and deteriorating rapidly at 50 hours.Most of the quests are very boring. Fetch me those items or kill me those enemies. For me this may well become a reason for abandoning ESO, they were the reason I never played WoW for more than 20 minutes. In ESO they aren't as bad as the ones I experienced in the other title. It's normally 3-5 targets instead of 20-30. At first it seemed that this type of quests would be few, but it proved to be very frequent. A real pity.Many of the quests are really stupid. And I mean really really bone 'ead stupid. Like the world-class schemer who's locked himself inside a tomb and left the 3 keys outside the door at different but easy-to-find locations. Makes sense.. It's back to the old arcades, only back then the format required some abstractions. In ESO it's not an abstraction anymore, but a literally really dumb story-element. While there are some straight-forward story elements of the type \"some soldiers have been captured, go rescue them\", nonsense solutions are more common. Fully expect an NPC to suggest solving a problem by shooting her magic rainbow-ray at the moon while farting some magic sunshine. But first you must go find her some rare shrooms at one location, kill 4 zombies at another location, get 3 seashells, then kill an evil monster turtle-boss. Then she can find the spy who's been taken prisoner by the enemy and learn what he knows. And on to the next one.After a quest is done I get a pat on the back, where the NPC tells me this was all my doing. I'm a hero. It's not that it's wrong, it's just that after a while all quest-givers start to seem like a benevolent school-teacher praising a 7-year old.The Ugly.Customer Support are flat-out ignoring support-tickets. There are 3-year old bugs that prevent installing or starting up the game for enough players that the forums have several threads each day regarding them. New players enter the forum frustrated, not being able to play. Some are able to get it working through forum advice, and others can't and refund the game as a result. The ugly part is that the developers don't communicate with the players and doesen't even acknowledge the problem. It's been 3 years now, so it seems they just don't find the bugs worth the cost of resolving vs the number of resulting refunds and bad reviews.Final Words.I don't know how long ESO will keep me engaged. I'm currently doing the story and exploration, but unless the story starts diversifying in the next area I fear I'll seek other content. Maybe that content can keep my attention, maybe not. Regardless, this is the best MMO I've played despite its shortcomings. The combat is quite good, and the absence of time-sinks count for alot. That said, I've yet to find an MMO that could hold my attention for more than a couple of months.\t\t\t\n", "\n\r\n\t\t\t\t1,049 people found this review helpful42 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n858.3 hrs on record\n\n\n\n\nPosted: 2 June, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis is a review from a new player aimed at new players.I played ESO back in 2014 during the beta and didn't like it. I was expecting Skyrim online and it didn't qualify so I lost interest very quick.Fast forward to april 2018, after years spent on Dark Souls, Dragon's Dogma, Rocket League and others ... Me and my buddies are looking for a game to play together like in the good old days. We're all dads with families now and there's no way we can get back to grinding like we used to (no pun intended).I remember ESO and wonder how it's doing. People are talking about the One Tamriel update. I start a thread on Reddit asking if it's casual friendly, and everyone assures me that it very much is. Might be worth a shot so me and my buddies decide to give it a try.ESO still isn't Skyrim Online, and won't ever be. The logistics of a MMO don't really allow the atmospheric beauty and complexity of a game like Skyrim. It is however way deeper in lore and atmosphere than any MMO I ever played, and you can tell great care is taken into making the world of Tamriel feel alive and breathing as much as can be. Every NPCs are voiced and side quests are literally everywhere. Many of them feel generic after a while, but some are actually really clever and well written. The world is absolutely humongous and very varied, with there again great care paid to respecting the Elder Scrolls lore. Long time ES players will appreciate the numerous references to stories and characters they already know well.Graphics are pretty great for a MMO as well. I run it maxed out and lighting effects are downright gorgeous in some places. Art direction is consistent and while some places feel a little rushed, others surprise you with high levels of details. Riding from city to city through woods and moors, across deserts and sea shores, you always feel immersed in the world as should be. They also keep improving as the latest chapter, Summerset, is more beautiful and detailed than ever before.Gameplay is one of the things that surprised me the most as I wasn't expecting it to be so fast paced. Fighting takes skills and strategy and you do need to learn to get better to earn victory, as opposed to simply leveling and spamming skills like it's sometimes the case in similar games. Me and my buddies have progressed steadily and we find ourselves beating dungeons we never thought we could beat before, and not just because we leveled up but because we learned to work better as a team. It's a very satisfactory feeling that the game encourages.Classes are varied and skill lines designed to make you enjoy a high level of freedom in gameplay. I run a Magicka Templar, and designed my character so I can switch from DPS to Tank or Healer or a mix of both when I play with my friends without much of a hassle. I'll never be as performing as someone who would 100% specialize in either of these roles, but I would say that for once hybrid builds are absolutely do-able in this game, which is very rarely true in MMOs.One thing responsible for us enjoying the game so much is the famed One Tamriel update. It basically removed level walls from the world and introduced a scaling system on the world map. It basically means that from level 1 to 50, you will adjust to monsters on the world map and normal delves to a beatable level. It does remove true challenge from these areas, but also allows you to roam the world freely to explore as you wish, which is a worthy trade in my opinion as it allows new players to be free to discover this enormous world like they were on an actual adventure. There are also no limits for partying with friends, so you don't need to worry about overleveling when you play on your own. While it could take from the satisfying experience of leveling up in early levels, the very flexible skill system feels like enough of a reward to keep it interesting.World Bosses, Dungeons and Trials aren't scaled, and that's where the challenge begins. Each dungeon has several levels of difficulty and we have been steadily progressing through them in our 2 months of playing. Boss battles require strategy and analyzing the mechanics and can be quite epic. Sometimes you just don't have the required level or gears, but sometimes you just have to keep trying to get better. We have beaten many bosses we thought we would never beat on our first couple tries.Past level 50, you start getting Champion Points, to a maximum of 750. They allow you to keep enhancing your character slowly and end up making quite a difference in the long run. As you get stronger, you'll be able to complete more difficult dungeons, which grant better gears. This is really clever design, as the game never feels like a grind in the traditional MMO sense, but instead more of renewed challenges. So far it has kept it's freshness to us.The lack of \"grindy\" feeling is really something I want to emphasize on, as it's what's been preventing me from playing MMOs for so long. In my 2 months of playing I never felt myself even having the desire of grinding for levels or gears. I had fun doing quests on my own and playing with my friends, and my character naturally improved by doing so. We are still a long, long way from reaching end game content, and are in no hurry. From my experience, this is quite a feat to accomplish this feeling in a genre that is most often grindy by definition.On the negative side, I would say that the game can sometimes feel a little bland, but then again it's a MMO and Skyrim, Dark Souls, Witcher III and the likes have spoiled us in recent years. Quests can feel generic and repetitive but you also don't need to do 80% of them.The monthly subscription is by no mean necessary but access to all DLCs and their dungeons is quite pricey (and free if you subscribe). The bottomless crafting bag you get with the subscription is also pretty mandatory if you want to craft efficiently, and then again it isn't a necessity as you can resell materials instead of holding on to them and ask players to craft for you.Crown store is mostly cosmetics or a shortcut to things you can buy with ingame currencies like skill respecs and the likes.All in all, the game we were looking for at the right time for us. I highly recommend it if you are also looking for a similar chill, friendly experience in the Elder Scrolls universe.ps: my hours logged have been greatly augmented by leaving the launcher opened all day on numerous occasions.edit 1: removed \"do not buy from steam\" cause issue seems fixed. would still recomend getting it from official website though just in case.edit 2:  my friends and i have less time to play together. reached semi endgame (CP400, all geared, vet dungeons). kinda lost motivation to play atm tho but it has a lot to do with my friends not being around as much.\t\t\t\n", "\n\r\n\t\t\t\t3,452 people found this review helpful89 people found this review funny\t\t\t\t276\n\n\n\n\n\n\nNot Recommended\n5,460.2 hrs on record\n\n\n\n\nPosted: 9 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTheir last privacy agreement update (January 1st, 2021) states they will \"sell\" users information, including name, email and billing address to third party companies (including social media and advertising). There is no other way of playing the game without accepting those terms, very sad practices for a paid game really.\t\t\t\n", "\n\r\n\t\t\t\t5,036 people found this review helpful203 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n96.8 hrs on record\n\n\n\n\nPosted: 14 July, 2015\n├ Digitals Review 👌🏻 ┤Score60/100Game Pros• Giant fully explorable beautifully designed world• Night/Day Cycle (3 hours each)• Weather• 1st and 3rd person is easily accessible• Designated PvP area• Customer support is very helpful• Various lines and skills for crafting • Ton of possible character builds• Mass amount of quests. (You'll have a hard time running out of things to do)• Frequent updates• A lot dungeons ranging in difficulty for you and your friends (or random players) to complete.• Microtransactions are mainly all cosmetics (Other than mounts and crafting styles) Game Cons• If you have poor internet, prepare for the longest download. (80Gb)• You can only group up with players from the same faction. So if your friends join a different one, you're out of luck• Minor bugs (Rooms can take a little to fully load, possible freezing/crashing)• Pricing of mounts is a little high (It takes awhile for the normal player to earn even 10,000 Gold. While most horses are 42,000 gold. Other than that, there is one that is 10,000 Gold. Only other option is buying it through the micro-transaction store)• Only guild stores and AI markets. There is no public tradepost (like you would find in Guild Wars)Controversial Features• Leveling system can be EXTREMLY slow, and may take a lot of time and effort to level upRelateable Games• Guild Wars • WoW • Skyrim ConclusionElder Scrolls Online is a very fun and potentially an addicting Massive multiplayer online game. 900+ quests, giant open world map with a ton of caves, and dungeons, to explore. Sure there is some cons here and there, but overall I would reccomend this game to any person who enjoys MMOs. In the first 2-3 days of having it, I hit 30+ hours of gameplay. If you got the money and time, i'd pick this one up for sure. And no, you can not do shouts, and there is no dragons. This isn't skyrim. (If you found this review helpful, consider giving it a thumbs up!) \n", "\n\r\n\t\t\t\t924 people found this review helpful47 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n186.0 hrs on record\n\n\n\n\nPosted: 26 November, 2015\n The Elder Scrolls Online - Tamriel Unlimited  Introduction Tamriel.  A continent at war. The Dominion, Pact and Covenant fight for supremacy in the Imperial province of Cyrodiil. Meanwhile, Molag Bal has stolen your ♥♥♥♥♥♥♥ soul.  Review -11/26/15  Graphics Tamriel Unlimited is pretty. It has a variety of different environments - from the sandy, sunbaked land of Elsweyr, to the frigid, unforgiving land that is Eastmarch. Whilst no, the graphics aren't particularly revolutionary, and definitely not the same quality as Skryim, this is to be expected. For an MMORPG, the Elder Scrolls Online is up there with one of the best looking. Occasionally the world looks a bit 'the same', but usually as you advance to other provinces, the environment and ambience is noticeably different. EDIT: After a discussion with someone who commented on this review (which you can read below) I'd like to add this: Skyrim was a very graphically capable game. The base game, on ultra, compared to ESO, on ultra, is more graphically detailed than ESO in my opinion. However, this may depend on different viewpoints and whatnot. The graphics design and feel each game wishes to portray is different, and this may lead to differences in opinion - which is to be expected.8/10 PvE Player vs Environment is the part of this game that gets particularly monotonous. It's the easiest way to level up, as you gain a considerable amount of experience for each quest you complete, but  it does indeed become a chore. The characters are forgettable, the quests the same. Kill this, gather 'x' amount of this, talk to her/him. In my 145 hours of playtime, only a few quests have got me genuinely interested. You skip dialogue as it does not mean anything or add to the plot. It does, however, reveal some beautiful locations and there are a FEW interesting quests. For the most part, however, PvE in ESO:TU is pretty 'meh'.4.5/10 PvP If you're not sure about buying ESO for the PvE aspect, definitely consider buying it for the PvP aspect. It is likely the most fun I've ever had in an MMORPG. Nothing quite compares to standing aside a host of 50+ players as trebuchets pound castle walls, the walls crumble, and hundreds of players clash on the field of battle. If you're an Elder Scrolls fan and have always fantasized about some sort of war in Tamriel - buy this game. You're allowed to enter Tamriel at Lvl 10 (3-4 hours of playtime?). Once you enter, your stats are boosted to Veteran Rank 1(?). This means a Level 10 can still be (relatively) effective fighting higher levels, so it's pretty balanced. The PvP itself takes place in the Imperial Province of Cyrodiil, which has been invaded by three seperate factions-The Aldmeri Dominion (High Elf, Wood Elf, Khajit)The Daggerfall Covenant (Breton, Orc, Redguard)The Ebonheart Pact (Argonian, Nord, Dunmer)(With Imperial package you can play as an Imperial in any alliance)There are 15/16 castles around the province, 6 of which surround the Imperial City. There are also various outposts. Around the castles are resources, which, if captured, give benefits to the faction who owns them.The PvP is what makes this game, and what convinced me to stay for 100+ hours.9.5/10 UI/Levelling The UI is well-designed, not too obtrusive. Levelling up is also pretty simple - each time you level up, you get to choose which stat to invest in - stamina, health or magicka.You can then choose a skill which you can plonk in your hotbar and use. Nothing broken or overpowered, though it does take testing to find the most effective skill sets.8.5/10 Crafting I'm not going to lie, I've not experimented in crafting at all, so this section is from friends' experiences.It's good. Dying your items can make your armor very unique, the materials are varied and it does take up time. It's not simple. Which is good.8/10 Framerate I play this game on a GTX 770 and i7 4770. In the midst of a battle, with dozens of spells and effects going on as well as 100+ players on screen performing their own actions, it did not drop below 50fps. Well optimized, large scale PvP is the only time I've ever dropped below 60fps.9/10  Grouping The group questing/dungeons in this game are good, again, but not particularly revolutionary or exciting. Standard group quests and dungeon, pretty simple. Not a huge variety right now, I think there are about 7/8 without the Orsinium/Imperial City DLC. I've had loads of fun playing dungeons with friends, but it does become a bit stagnant once you've repeated them several times.7/10 Conclusion This game is good. The PvP is excellent, and while the PvE isn't particularly impressive, it still functions. Bugs have almost all been ironed out. Worth your money if you enjoy the Elder Scrolls universe, and are willing to accept certain sacrifices made by Zenimax to make the game a better MMO. OVERALL: 8.5/10 New Witcher 3 review: http://steamcommunity.com/profiles/76561198079374616/recommended/292030/-my first proper review, feel free to comment constructive criticism/positive feedback-\t\t\t\n"]