["\n\r\n\t\t\t\t2,970 people found this review helpful93 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n6.5 hrs on record\n\n\n\n\nPosted: 11 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe first Portal had genius, original gameplay mechanics, great story, great level progression, great voice acting, great characters, great engine and such a nice british humour it originated a ton of memes.If you didn't play, finish and love Portal 1, you are a bad person.This sequel brings all those qualities to a new level: _the story is deep_, lots of wow moments, graphics is beautiful, much more levels, environments and elements to solve the puzzles, the co-op multiplayer is so fun it's epic.In my heart and in my mind I have no doubt: _this is the best game ever made_.If you didn't play, finish and love Portal 2, you understand nothing about videogames.\t\t\t\n", "\n\r\n\t\t\t\t611 people found this review helpful222 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n3.0 hrs on record\n\n\n\n\nPosted: 24 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStep 1: Get gameStep 2: Play gameStep 3: Be smartStep 4: Beat gameStep 5: Tell friend to get gameStep 6: Play multiplayerStep 7: Scream at them for being stupidStep 8: Feel good about yourself\t\t\t\n", "\n\r\n\t\t\t\t484 people found this review helpful63 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n23.8 hrs on record\n\n\n\n\nPosted: 21 December, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI wish I could wipe my memory of this game just to experience it for the first time all over again.\t\t\t\n", "\n\r\n\t\t\t\t417 people found this review helpful157 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n24.2 hrs on record\n\n\n\n\nPosted: 9 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStep 1: Get gameStep 2: Play gameStep 3: Be smartStep 4: Beat gameStep 5: Tell friend to get gameStep 6: Play multiplayerStep 7: Scream at them for being stupidStep 8: Feel good about yourself\t\t\t\n", "\n\r\n\t\t\t\t361 people found this review helpful45 people found this review funny\t\t\t\t3\n\n\n\n\n\n\nRecommended\n41.6 hrs on record\n\n\n\n\nPosted: 23 December, 2017\nPortal 2 ❤ Audience :☐ Kids☑ Everyone☐ Casual players☐ Pro players☼ Graphics :☐ Potato☐ Really bad☐ Bad☐ OK☐ Good ☑ Beautiful (Someone can find it good, but i really like visual of portal :) )☐ Masterpiece€ Price / quality : ☑ Full price☐ Wait for sale☐ Average☐ Refund it if you can☐ Dont do it€ Requirments  :☐ 90' PC☑ Minimum ☐Medium ☐ Fast☐ High end ☐ NASA computer☼ Difficulty :☐ You just need 2 arms ☐ Ez☑ Average☐Easy to learn / Hard to master ☐ Hard ☐ Dark souls€ Game time☐ Really short ( 0 - 2 hours)☐ Short ( 2 - 8 hours)☑ Few hours ( 8 - 12 hours) (singleplayer only, coop is cca 4 - 6 hours long) (depends on how                        good you are)☐ Long ( 12+ hours)☐ Endless@ Story☐ It doesnt have☐ Still better than Twilight☐ Average☑ Good☐ Fantastic§ Bugs☐ Game itself is one big BUG☐ Bugs destroying the game☐ Lot of bugs☐ Few Bugs☑ You can use them for speedrun☐ NothingOthers:Multiplayer: Coop story mode with friendsSingleplayer: YesCommunity: Really good, lot of community maps on workshopConclusion: For me this is one of the best game i ever played. I recommend you firstly play Portal, than start Portal 2. This game is MASTERPIECEOverall: 10/10  \n", "\n\r\n\t\t\t\t379 people found this review helpful26 people found this review funny\t\t\t\t90\n\n\n\n\n\n\nRecommended\n986.1 hrs on record\n\n\n\n\nPosted: 23 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy son is on the ASD Spectrum and ever since he began playing this game it has truly opened his mind to thinking creatively whenever he is trying to solve a problem.  THANK YOU, Valve for helping my little boy!\t\t\t\n", "\n\r\n\t\t\t\t283 people found this review helpful27 people found this review funny\t\t\t\t95\n\n\n\n\n\n\nRecommended\n31.4 hrs on record\n\n\n\n\nPosted: 28 June, 2020\n Congratulations! The simple fact that you're standing here listening to me means you've made a glorious contribution to sciencePortal 2 is the one of the greatest games I’ve played and this is actually coming from a person who doesn’t even like platformers and puzzle games. Portal 2 is equivalent to T2: Judgement Day when it comes to rating sequels. I’ve refused to play it for a long time and finally decided to try this after listening to my friend and I regret not playing this masterpiece any sooner.Pros+The developers picked up the best parts original and expanded upon it in every way imaginable both in gameplay and plot. +Well written and memorable story and dialogues. Pacing is also well done. +Best voice acting in a puzzle game. I seriously can’t think of any game topping this. +Stephen Merchant and J.K Simmons did an absolutely terrific job. Ellen McLain’s performance as GladOS is so good that you’ll love to hate her character. So, then it’s a success I guess :D+Portal 2 has a humor like no other game. It’s funny, it’s dark but most importantly it’s original!+Gameplay is fun, addictive and educational. No matter how complicated the puzzles get, the solutions are always sensible. Difficulty is much balanced and forgiving compared to the original Portal which was a lot frustrating at times. +Performance is flawless. It was so smooth like as if Valve built Source just to make this game. +Excellent soundtrack and musical score by Mike Morasky and The National. +Two player co-op campaign is equally fun as single player mode. Very well-designed levels and actually requires co-operation and trust of your friend. +User created levels and mods are very impressive. Shout out to everyone who used the level editor to create amazing custom levels. It was fun playing. Check them out once you’re done with the main story. +Nice and clean graphics. Aged very well even though it’s almost a decade old game. Visually this perhaps the best-looking game from Valve imo. +Suitable for all ages, no matter whether you’re young or old, Portal 2 can be enjoyed by anyone who is familiar with playing video games with mouse and keyboard. There’s also a PS3 port available with PS Move support.+Credit to Valve for providing soundtrack for free.+Excellent port. Also supports Linux and Mac so no one is really missed. +Steam Cloud saving, Achievements, Steam Trading Cards, Official mod support. +One of the greatest video game endings. So many great and ambitious and big budget AAA games have fulfilling gameplay, story and quests but when it comes to endings a lot of them are either disappointing or don’t meet the level of expectations the credits start rolling in. Not Portal 2. It manages to be fun from start to finish line. Cons-First part of the story can be a little predictable if you’ve watched a lot of movies and TV.-Most assets seem like they’re copied straight from previous Valve’s works like the first Portal, Half Life 2 and its standalone episodes. -Honestly, I’ve tried hard to find and couldn’t. At this point I’m just nitpicking Valve.  The Bottom LinePortal 2 makes the original game feel like an experimental prototype. You might think it is overrated but there’s only one way to find out. Just get the game and first thing, play the game already! Portal 2 is one of the funniest, best written game of all time. Stephen Merchant as Wheatley and J.K Simmons as Cave Johnson; perfect casting. Valve never disappoints, (or at least never did a decade ago or so). Portal 2 made me like puzzle and platforming games and I’m thankful for that.The developers borrow some concepts from 2005 indie game Narbacular Drop. Valve was so impressed that they hired the guys behind it and asked them to make Portal. You can check that game out for free by visiting their website. Just search the name on Google or any other search engine that you prefer. Highly recommend it to……everyone. If you’ve read so far then you’re probably interested in the game so won’t hurt giving it a try. My Rating: 10/10  Thank You :D\t\t\t\n", "\n\r\n\t\t\t\t2,309 people found this review helpful404 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n30.8 hrs on record\n\n\n\n\nPosted: 3 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGreat game, makes you feel somewhat smart\t\t\t\n", "\n\r\n\t\t\t\t223 people found this review helpful146 people found this review funny\t\t\t\t12\n\n\n\n\n\n\nRecommended\n27.6 hrs on record\n\n\n\n\nPosted: 11 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti played it as a kid and now i wanna get bullied by older women\t\t\t\n", "\n\r\n\t\t\t\t378 people found this review helpful193 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nRecommended\n3.2 hrs on record\n\n\n\n\nPosted: 13 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tStep 1: Get gameStep 2: Play gameStep 3: Be smartStep 4: Beat gameStep 5: Tell friend to get gameStep 6: Play multiplayerStep 7: Scream at them for being stupidStep 8: Feel good about yourself\t\t\t\n"]