["\n\r\n\t\t\t\t1,040 people found this review helpful565 people found this review funny\t\t\t\t78\n\n\n\n\n\n\nRecommended\n109.1 hrs on record\n\n\n\n\nPosted: 30 May, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\ti uninstalled the game.  it was the only way i could stop playing.  i'll be back in two weeks.\t\t\t\n", "\n\r\n\t\t\t\t472 people found this review helpful13 people found this review funny\t\t\t\t25\n\n\n\n\n\n\nRecommended\n11.2 hrs on record\n\n\n\n\nPosted: 4 June, 2023\nEarly Access Review\nWhat is it?You control a potato that auto-attacks with up to 6 weapons. The only controls are movement. At the end of each survival wave (usually lasts about 50 seconds) you enter a shop to buy various items and weapons to get stronger.Summary+ Fun and challenging+ Dopamine inducing and addicting+ Cheap and no macroscamsactions+ Many different characters that feel unique and vary the gameplay- No story and lacking things to unlock such as different mapsHow does it compare to Vampire Survivors?+ More challenging+ Characters feel much more unique from each other+ The intensity is broken up by shops at the end of each wave- Some people might prefer the more casual nature of Vampire Survivors- Beyond more characters and the 5 other difficulty levels there's not much not unlock, unlike new maps and relics as in Vampire Survivors\t\t\t\n", "\n\r\n\t\t\t\t279 people found this review helpful7 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n48.0 hrs on record\n\n\n\n\nPosted: 7 October, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tDisclaimer: I'm one of the developers of Godot Engine, the game engine used by Brotato, which is how I first heard of the game. But I'm also a fan of indie games and I've been playing Brotato for my own enjoyment, so my review is from a player's perspective.I LOVE IT.It's just so much fun. I've played a bit of Vampire Survivors, the game which seemed to (re)start the craze around this kind of arcade action games now dubbed \"horde shooters\" or \"reverse bullet hell games\".Brotato seems heavily inspired from this genre, but refines it a TON on all aspects: graphics, sound design, gameplay variety and replayability. I've played it over 15 hours in just a week and I'm itching to play more.My favorite feature is the insane variety that you'll find in what kind of build you can play. Like most such games, you start with a basic set of stats which you can influence (both positively and negatively) with level-up upgrades (e.g. +5% damage, +3% speed, etc.), and weapons and passive items that you buy between runs with the collected materials. You can equip up to 6 weapons (aside from a couple exceptions) and combine them in ways that make sense for the build you're going for, and the items you buy or acquire influence your stats passively. There's a significant impact of randomness here, but it's well designed - the game learns from your start weapon, and the items and weapons you acquire early on, and tends to pick random purchase options that make sense to develop you build. E.g. if you start with a \"medical\" weapon, you'll be proposed more medical weapons early on (and also other types, but your starting one - or the type of other weapons you'll acquire - weighs more in the balance and helps you focus on one or more types if you want).Then what makes the game absolutely amazing to me is the variety found in the characters. Each character that you can choose has a set of bonuses and penalties that affect the base stats, and guide your build heavily in some direction.Some examples:- Crazy, +100 Range with Precise weapons (knives, etc.), +25% Attack Speed, starts with an extra Knife, -30% Dodge, -10 Engineering, -10 Ranged Damage. You can imagine what kind of build is favored: stack fast Precise weapons with high critical chance like knives, and carve your way through the waves while making sure not to get hit, as you definitely won't dodge. You'll probably want some Life Steal :)- One-Armed: +200% Attack Speed, All Damage modifications are increased by 100%, you can only equip ONE weapon at a time. So you're super fast to hit, you can make a build that will reach insane amounts of damage per second, but you'll be limited to a single weapon.- Masochist: In short, starts with -100% damage (does only 1 damage per hit), but gets +5% damage whenever they get hit... so after 20 hits you're at +0% damage modifier, and everything after that is pure damage increase goodness. So you have to balance hurling yourselves on enemies to get hit but without reaching 0 HP - and your base stats help you with that thanks to +10 Max HP, +3 Armor and +25% HP Regeneration.That should give a hint of what's possible - the game (as of Early Access in Oct 2022) has a whopping 30 characters, all very different from each other and leading to very varied builds (you start with maybe 6 characters and unlock the rest while winning on various levels of difficulty with various characters).Long story short: it's amazing, pick it up!\t\t\t\n", "\n\r\n\t\t\t\t402 people found this review helpful172 people found this review funny\t\t\t\t22\n\n\n\n\n\n\nRecommended\n17.8 hrs on record\n\n\n\n\nPosted: 23 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI bought this game 6.1 hours ago and I have 6.1 hours played\t\t\t\n", "\n\r\n\t\t\t\t118 people found this review helpful83 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n43.6 hrs on record\n\n\n\n\nPosted: 22 October, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tAfter 3 hours I realised that I can combine similar weapons.\t\t\t\n", "\n\r\n\t\t\t\t269 people found this review helpful11 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n0.2 hrs on record\n\n\n\n\nPosted: 23 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfelt like a classic flash game\t\t\t\n", "\n\r\n\t\t\t\t139 people found this review helpful20 people found this review funny\t\t\t\t7\n\n\n\n\n\n\nRecommended\n10.2 hrs on record\n\n\n\n\nPosted: 24 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBought 230 dollars worth of steam games on a sale, including Cyberpunk, Hogwarts Legacy, Elden Ring yet I booted this up while those were installing and proceeded to play this for 8 hours straight..\t\t\t\n", "\n\r\n\t\t\t\t316 people found this review helpful78 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nRecommended\n11.4 hrs on record\n\n\n\n\nPosted: 9 November, 2023\n🔪‏‏‎ ‎‏‏‎👊‏‏‎ 🗡️‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ ‎‏‏‎ 🥔🔫‏‏‎ ‎‏‏ 🚀‏‏‎‎‏‏🪄‎ \n", "\n\r\n\t\t\t\t208 people found this review helpful127 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n15.0 hrs on record\n\n\n\n\nPosted: 3 October, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tIt is like a fun mobile game, so unlike any mobile game\t\t\t\n", "\n\r\n\t\t\t\t87 people found this review helpful2 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n1,563.1 hrs on record\n\n\n\n\nPosted: 4 December, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tVery nice roguelike that also works very well on the steam deck.Compared to Vampire Survivors, this game is very difficult, you don't get permanent upgrades after every run.Graphics and music are very good and you can also save your runs and resume them later. There are also plenty of characters to choose from, making every run different.The 5eur is well worth it\t\t\t\n"]