["\n\r\n\t\t\t\t819 people found this review helpful113 people found this review funny\t\t\t\t50\n\n\n\n\n\n\nRecommended\n363.4 hrs on record\n\n\n\n\nPosted: 3 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA gacha game made by people who clearly have no idea how to make a gacha game.It's for that reason it's the best gacha on the market.\t\t\t\n", "\n\r\n\t\t\t\t173 people found this review helpful10 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n532.9 hrs on record\n\n\n\n\nPosted: 11 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWhat's funny about this gacha game is that rather than using Luancy(the in game currency) to pull gachas, it is actually more worth it to burn lunacy for stamina and grind mirror dungeons which gives you enough shards to choose a character you want. The optimal way to play this gacha game is to not pull the gacha, how ironic.But I still pulled the gacha anyway cuz Project Moon just give away free Lunacy like it's tap water.Story is amazing, gameplay is interesting, combat is satisfying.The character design and their story building is one of the best part of this game.And above all else, the memes are amazing.The odyssey had a purpose.\t\t\t\n", "\n\r\n\t\t\t\t343 people found this review helpful48 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n105.4 hrs on record\n\n\n\n\nPosted: 25 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL I LOVE ISHMAEL !!!!!!!!!!\t\t\t\n", "\n\r\n\t\t\t\t306 people found this review helpful109 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n159.7 hrs on record\n\n\n\n\nPosted: 21 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMANAGER ESQUIRE!!!!! TO WHERE IN THE WORLD HAST THOU DISAPPEARED!!!!!!!!!!!!!!!!\t\t\t\n", "\n\r\n\t\t\t\t115 people found this review helpful6 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n179.1 hrs on record\n\n\n\n\nPosted: 5 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTip: You can hold left mouse to speed up the animation of EGO attacks\t\t\t\n", "\n\r\n\t\t\t\t425 people found this review helpful36 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n693.6 hrs on record\n\n\n\n\nPosted: 4 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProject Moon says sorry when they make mistakes. Give them money.\t\t\t\n", "\n\r\n\t\t\t\t358 people found this review helpful39 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n9.5 hrs on record\n\n\n\n\nPosted: 26 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLIMBUS SWEEP\t\t\t\n", "\n\r\n\t\t\t\t450 people found this review helpful12 people found this review funny\t\t\t\t60\n\n\n\n\n\n\nRecommended\n0.1 hrs on record\n\n\n\n\nPosted: 1 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgonna refute some negatives i keep seeing about this game from people that clearly never bothered to learn the mechanics and then complained after having their face mashed into a wall by a mariachi band (if they even got past the first chapter):1. Clashes are unwinnable/there's no gameplay depthComing from ruina, a lot of people try to approach things in the exact same way they did then, and/or just focus on lining up pretty colors instead of actually reading the predictions the game gives you. The fact that you get these predictions is a huge part of Limbus gameplay that a lot of people ignore, because unlike Ruina which is based around speed and redirection of attacks, Limbus is instead based around maximizing the number of outcomes in clashes that end up in a victory, and spending long-term resources to do so. The main reason people keep getting their face bashed in is that when they get stuck with two \"hopeless\" coins, they ignore guarding and keep lining up the action anyway. Guard is important because it \"moves\" the incoming attack to the next person in line, meaning that even if character A's attacks both are rated Hopeless, character B can hopefully have better chances. The other major component a lot of people ignore is how EGO works, a lot of people opting to just use it to do big damage (as you would in ruina) instead of saving it for its use as a guaranteed 100% clash winner that replaces a coin. EGO pulls from a resource pool in this game rather than being \"charged\" like it was in ruina, making it far more efficient to save for when you actually need it rather than spending it immediately.  In general, color chaining should be your last thought rather than your first, because each attack often also has passives that activate under specific conditions that a lot of people ignore due to their focus on chaining colors rather than properly attacking, alongside looking at the colors you need for more EGO and what weaknesses the enemies have (which is helpfully displayed as a % on top of the coin) as the chains only provide a relatively smaller damage boost (~15-25% per coin ish?) 2. You are forced to grindDue to the aforementioned \"ignoring mechanics and getting head bashed in\", a lot of people decide that instead of trying to actually learn to play the game the solution is to level up in order to brute force their way through. While this clearly does indeed work (as it does in any rpg) it is certainly not strictly required; I beat the current main story with every sinner at lv10-15, replaying levels exclusively to EX ones i missed the first time. Aside from that, another mechanic people frequently ignore is threadspinning, which makes all your identities (and EGO) a lot better by giving it additional effects and attacks. Even F2P you end up with a ton of excess egoshards just from the free pulls the game gives you, and on top of that the game automatically maxes out the tier 0 basic identities of every sinner after chapter 2 for free. A lot of people throw those in the trash, but if you can't afford to threadspin your tier 00s and don't have any tier 000s, the abilities and attacks they have are solid even in chapter 3 for rounding out your team if you're particularly unlucky. 3. Gacha systemThis one is hard to refute because people can't even decide what the problem with it *is*; some people say the identities are useless and not worth trying to get, some people say the identities you get are gamebreakingly good and impossible to play without, but i have the feeling the problem they all really have is just \"the fact that it is a gacha and exists\". The game can be beaten entirely F2P even with the world's worst luck, as you're guaranteed to have at least a handful of tier 00's and one or two tier 000's pretty shortly into the game just from the free currency you get, and the default EGOs each sinner starts with are more than powerful enough to take you through the game even if you manage to pull none of the extra ones and don't do the limbus pass.4. Team BuildingThis one isn't a response to a specific complaint as much as it is turning this review into a pseudo-guide to get people to stop mashing their face against colored buttons and start reading, but a lot of people ignore the EGO resource balancer the game shows on the right of the screen during character select, as well as the existence of weaknesses in general. Bringing a team with the right resistances and damage types gives you a huge advantage, and streamlining the colors you have in order to get more EGO on the teammates you need rather than just throwing whoever happens to be standing nearest to you at the problem helps massively. The game lets you switch which identities you have equipped while you prep for battle (except in dungeons, which are generally decently easier to compensate both for the fact you take long-term damage and cant swap identities) so if you're struggling with a level it's quite easy to switch up your tactics, because often the same team wont always carry you through every level. in summary limbus is a good game when you actually do reading like literally every other past game has required you to do and also i want to enter a romantic relationship with the man with a clock for a face\t\t\t\n", "\n\r\n\t\t\t\t88 people found this review helpful\t\t\t\t5\n\n\n\n\n\n\nRecommended\n242.0 hrs on record\n\n\n\n\nPosted: 8 May, 2023\nObligatory disclaimer: This game is the third of the Project Moon games (Lobotomy Corporation and Library of Ruina being its predecessors). Knowledge of these games is not required beforehand, but they help with understanding various points of worldbuilding + why Limbus Company was established to begin with. Also, they're fantastic games!That all being said, here's a breakdown of Limbus Company:Story:The main draw of the game. The twelve Sinners are based off of literary counterparts (e.g. Ishmael and Moby D!ck, Heathcliff and Wuthering Heights, etc.) but the re-interpretations of these characters are incredibly refreshing. They're fun and have interesting dynamics with one another. Even NPCs in this game are simply fantastic; I was honestly shocked by how invested I'd become in the game's side characters.The story is well-balanced between gut-wrenching sadness, horror, and genuinely fun/heartwarming interactions. As of writing, there are three story chapters with the first one being a great warmup for the laughs and grief to come, the second being a delightfully fun romp that brings to mind a terribly incompetent-but-still-effective D&D party, and the third starting off fun before ripping the player's heart out.Drawbacks: the story is still ongoing, with chapters appearing to drop every 2-3 months. If you get on this train for the story, you're going to be in it for the long haul.Gameplay:If I had to describe the gameplay in one word: unique. This game is an RPG and strategy-based, with each enemy having different Sin type resistances (make sure you're clicking on enemies to check their weaknesses!) and damage type resistances (blunt, pierce, and slash). You also need to keep an eye on your party's HP, sanity, and speed for each turn; sanity can make or break the effectiveness of your party's actions, hitting a certain percentage of HP lost can \"stagger\" a character for a turn, and speed can determine which characters can block/evade/clash with different enemies on the field.Out of all three Project Moon games, this is the easiest one to learn, but difficult to master; I've been playing for about 100 hours now and I'm still learning new things just about every day with this game.Drawbacks: It can take a long while to begin to understand this game's mechanics, and it doesn't help that Project Moon is unfortunately a bit infamous for their tutorials only explaining maybe 25% of the gameplay elements you'll have to work with. Looking up a guide (or several) tends to be the PM game experience, which can be a downside or a plus side for new players depending on how much research you're willing to do.Once you approach chapter 3, the gameplay can be very grindy; you'll want to collect plenty of egoshards, thread, and EXP tickets in order to power up your Sinners and acquire new identities, but it will require patience over many days. On the plus side, though, dailies are easy and tend to require minimal effort; I usually finish mine in approximately 5-30 minutes (depending on whether or not I throw in a mirror dungeon run). Also, the game has plenty of little bugs since it's designed to be both a mobile game and a PC game. Nothing that makes it unplayable, though, and the devs are great about fixing issues, especially for a small indie group. Just some text bugs that were around for a day, a particular character's skill making it so that they were invisible on the battlefield, etc. so nothing crazy, as far as I've seen.Also, this is a gacha game. Let's delve into that part, shall we?The Gacha:I would like to preface this by saying I hate gacha games.I actually really, really like this one. Here's why.F2P is incredibly easy. Your main resource to Getting Good(TM) is going to be Enkephalin Modules, which you can make from Enkephalin (or, you know, \"stamina\"). Naturally, you're going to be building this up by occasionally checking the game throughout the day, converting some Enkephalin into Modules, and using those Modules to grind for resources.Two- and three-star characters are pretty easy to obtain in the gacha pulls, but you can easily make do without them. Your base Sinners automatically upgrade every story chapter, making them occasionally even more useful than two- and three-stars by chapter 3 (where fully upgraded characters are more essential than their rarity). Also, the devs are insanely generous. Like, ridiculously so. Wait a few days and the devs will be handing you lunacy or extraction tickets (used for gacha pulls) because of scheduled maintenance, patches, etc.Out of the few gachas I've ever played, this one just doesn't feel gross and like it's making a blatant cash-grab at my wallet. If you do like shelling out gacha money, I'd say the prices are really fair in terms of how much bang you get for your buck-- especially with the season pass. $11 for an obscene amount of resources, a cool banner, loads of special EGO attacks your characters can use, and a third option for an announcer in battles? This one's a steal.Drawbacks: It's still a gacha, unfortunately. If you struggle with controlling your wallet around them and don't think this is a hurdle you can get over, this may be what stops you from playing the game (but at least there are cutscene comps on YouTube). Sound Effects:Yes, the sound effects are getting their own section of the review because I enjoy them THAT much. The SFX is varied and interesting, and that coin-flip ding you hear in combat? Music to my ears. I'd listen to that on loop for an hour if I could.Voice acting is only in Korean, but it's top-notch. Sound quality on the VAs is impeccable, and each one has such a broad range of expression and distinct feel to their acting that makes me instantly recognize every character who's speaking, even if I don't know a lick of Korean.(Side note: the characters sing during the credits roll of their story chapters. And god {i]damn[/i] can they sing.)Oh. My. God. The music. You know how some games get a little boring/repetitive to listen to after a hundred or two hours? I still haven't felt a hint of exhaustion towards this game's soundtrack. There are really solid bangers from average enemy encounters, to background music during cutscenes. Don't even get me started on the boss music, ranging from songs I aggressively bang my head to in the car to... well, Mili songs that I still bang my head to in the car. (Yes, Mili is back to making music for Project Moon games! You cannot believe how excited I am for this, and how I am still going positively rabid at the thought of the next Iron Lotus coming in future story chapters. Between Two Worlds slaps hard, but I know there's an even more insane banger to come.Drawbacks: There is a lot of bloody/squelchy noises during combat. You can turn the SFX down while keeping the bopping music playing at full volume, but it's important to keep this in mind if you get queasy at even the thought of squishy-squelchy noises while watching cartoon blood splatter during combat.TL;DR This is an incredibly unique game with a combat system unlike any other. While it can occasionally get frustrating or tedious (if you're not a fan of grinding or waiting for story updates), the characters and worldbuilding are insanely rich in a way only Project Moon can pull off. It's gory, it's funny, it'll rip your heart out, and it'll have you smiling and laughing. I'm rating this one a solid 9/10.\t\t\t\n", "\n\r\n\t\t\t\t116 people found this review helpful3 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n343.3 hrs on record\n\n\n\n\nPosted: 29 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPretty fun game.-Up to ch. 3.5-Actual review (because too many steam reviews are just unfunny reddit jokes): (See TL;DR at bottom if you hate walls of text)Game's mechanics can seem overwhelming at first, or down-right complex but eventually you'll get used to it with time. Tutorial doesn't really explain it too well (it explains enough, though), but that's mainly because it's introducing concepts that you don't really need to understand to beat the game. That is, you should be more concerned about a skill's power instead of matching the same colour (or sin type). I'm not sure if it's changed since I've been playing from day 1, but it does leave out some very, very important concepts (for me, that was clicking on an abno's part to show resistances and the hold down on a sinner to see uptie/level)Gacha is really generous and the compensation/rewards we get are insane, though that's not really fair critique as it'll undoubtedly change in the future. If anything, I'll note that you don't need any 00 or 000 to beat the main story (3.5-10 as of right now). Though, this system is flawed: Most people will assume 00's and 000's are better then 0's as soon as they get them. They're right to think so, as in chapter 1 or 2 they are much better but as soon as you get to chapter 3? It's the opposite. The game enforces the \"00/000 is always better\" as completing chapter 1/2 upgrades base ID upties, meaning that when you unlock chapter 3, you'll be more inclined to use the underleved and underprepared units instead of the now-good base units (ergo why so many people malded over 3-4 or 3-17). I believe this can be fixed by touching up the tutorial though.The story, as usual of PM, is really good. I don't believe you need a full understanding of LobCorp or LoR, but they do aid in understanding the world more. There's not much else I can really say here as I'm terrible at writing. Well, actually, I'd say it goes on for too long early-game, as you'll mainly just be reading the story during chapter 1/2 instead of fighting >half the time. It's good though, so I'm all for it. If you really hate it though (why play this then), you are able to skip it.Bugs are prevalent in this game, but they're usually minor and get patched out very fast. For something like EA I'd call this lazy, but given how small PM is (I believe 30~ people?) I figure it's fair to cut them slack about it, especially given the compensation we receive, it's their first time trying a Gacha game and their golden track record.Combat early on will be fast. Like, 5-8 scenes or so. Combined with the lengthy dialogue, I figure it'll bore some people away from the game, but the story-combat ratio does improve in chapter 3 along with the difficulty of the game. You'll need a real solid grasp of resistances, sin resistances, skills and upties to make it through it without strife. Well, that was until the great Sanity nerf of long ago, where most coins will now land heads with 45 sanity. You'll probably be able to scrape through as long as you have good skills.It'd also be better to add an easier way to identity the Sin's names and colours. I know them by heart now, but I was only able to find out what they meant by going to some weird page's tutorial menu. You can get by without understanding them but you may get lost sometimes. I'll leave em' here though:(Red, Orange, Yellow, Green, Light Blue, Dark Blue, Purple)(Wrath, Lust, Sloth, Gluttony, Gloom, Pride, Envy)==============TL;DR Fun game, boring to grind out, kinda hard to understand so watch a youtube guide on it, great story, generous devs, reading hell, easy early on, difficult later. Overall, It's free and you don't ever have to open the \"spend money!!\" tab (the game doesn't even tell you it exists lol), so I figure it's worth checking out. Well, atleast on youtube.==============Also another note: Please don't grind out EXP luxcavation or shiny banners. It really isn't worth it, since level 15-20 is enough to beat the game and the banners are entirely visual. It's seriously not worth the mental strife when you can just get enough level 3 tickets for level 30 from events anyway.OP note (So ignore this): I wrote this while sleep deprived at 3 am (and edited this at 2 am!), and not only that, I'm terrible at english despite being monolingual. I've touched it up a bit because seeing the 88 \"helpful\" ticks rather irks me, as I'm pretty bad at reviewing in general lol.222.2 Get!\t\t\t\n"]