["\n\r\n\t\t\t\t6,487 people found this review helpful114 people found this review funny\t\t\t\t1,748\n\n\n\n\n\n\nRecommended\n413.1 hrs on record\n\n\n\n\nPosted: 22 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'm a 46 year old dad and I absolutely love playing this with my 13 year old son.  Don't get caught up over losing loot to a raider or reaper, it's just part of the game.  Let your kid set the quest, or decide to attack a fort, or a tornado and just have fun being pirates for an evening.  I take the helm and keep us on course, he works the cannons and is an excellent shot.An awesome game to bond over, and a great way to talk about how to not be a jerk online, how to deal with disappointment, how to work as a team when you make alliances, and how to be a gracious winner.  He loves to help new players, will upend a planned evening to help some newbie finish a tall tale.  Great game to play with your kids.\t\t\t\n", "\n\r\n\t\t\t\t937 people found this review helpful388 people found this review funny\t\t\t\t86\n\n\n\n\n\n\nRecommended\n164.5 hrs on record\n\n\n\n\nPosted: 17 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy day 1 experience in this game as a brand new solo player: - Fumble around after spawning, clearly clueless- Player with a lot of cosmetic items sails up, I panic, I try firing off my cannons to ward him away- He kills me, repairs my ship for me, and offers to show me the ropes- He proceeds to spend 3+ hours teaching me everything about the game- At the end of the 3 hours, right before we sell all the loot we got, he blows up my ship with a keg and teaches me his final lesson: \"Trust no one\"\t\t\t\n", "\n\r\n\t\t\t\t1,285 people found this review helpful187 people found this review funny\t\t\t\t86\n\n\n\n\n\n\nRecommended\n5,375.0 hrs on record\n\n\n\n\nPosted: 23 July, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1720s Wages, 2020 Prices.\t\t\t\n", "\n\r\n\t\t\t\t1,325 people found this review helpful715 people found this review funny\t\t\t\t102\n\n\n\n\n\n\nRecommended\n30.1 hrs on record\n\n\n\n\nPosted: 31 March, 2022\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVery fun with friends but i don't have any\t\t\t\n", "\n\r\n\t\t\t\t1,500 people found this review helpful831 people found this review funny\t\t\t\t126\n\n\n\n\n\n\nRecommended\n116.3 hrs on record\n\n\n\n\nPosted: 26 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'VE GOT A JAR OF DIRT\t\t\t\n", "\n\r\n\t\t\t\t700 people found this review helpful771 people found this review funny\t\t\t\t62\n\n\n\n\n\n\nRecommended\n37.1 hrs on record\n\n\n\n\nPosted: 16 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI learned french from people in this game.They asked for a banana then killed me.But now i can understand them, and not fall to this bait again.\t\t\t\n", "\n\r\n\t\t\t\t1,671 people found this review helpful1,348 people found this review funny\t\t\t\t141\n\n\n\n\n\n\nRecommended\n66.3 hrs on record\n\n\n\n\nPosted: 18 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t Don't know what went wrong during development, but this is not a game.This is a time machine that warps you to 3am.\t\t\t\n", "\n\r\n\t\t\t\t678 people found this review helpful922 people found this review funny\t\t\t\t104\n\n\n\n\n\n\nRecommended\n27.0 hrs on record\n\n\n\n\nPosted: 1 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy crewmate left a banana on the stove and our ship burned down.\t\t\t\n", "\n\r\n\t\t\t\t335 people found this review helpful6 people found this review funny\t\t\t\t39\n\n\n\n\n\n\nRecommended\n387.7 hrs on record\n\n\n\n\nPosted: 29 January, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEdit 12/2 - It's been a while since I first wrote this, so adding an update section at the bottom.--Original Review--Sea of Thieves is the distilled essence of adventure. You start the game up, grab some supplies with your friends, load up your ship, and set sail to see what fate awaits you.I offer this game an easy recommend under a couple of conditions. The first is that you like the chaos of unknown adventure, and the second is that you don't mind when it all goes pear shaped.Sea of Thieves has you being a pirate on the ocean with other players, sailing from island to island, fighting skeletons, ghost ships, digging up treasure, solving riddles, delivering cargo, and fighting sea monsters. And you never quite know what's going to happen next on your adventure. There's plenty of things to chase, and you'll never be without a task for long if you care to pick one up from one of the vendors.One important design choice that you should be aware of before jumping into this game is that every session is a fresh start. You spawn in with your ship and bare bone supplies, there's no progression between sessions aside from cosmetics you unlock. (Which is also the only thing you unlock, more on that below). While this can be a bit of a bummer, it's actually quite freeing. Every time you launch the game you're given a new ship, new supplies, and an ocean full of treasure to explore. Truly, you have nothing to lose. Until you find treasure, that is. Then you have something to lose. The game is simply fantastic at giving you a unique adventure every time you sail, solo or with friends. And it's shockingly easy to play solo if you desire, the smallest ship, the Sloop, is very solo player friendly if you wish to be an asocial pirate.The only progression in this game is cosmetics. Anything else you get exists solely to get you, you guessed it, more cosmetics. This makes the cash shop a little weird. But hey, the upside is that nobody is going to beat you because they have a better sword, ship, or guns.The game recently started a battle pass system with season one. The pass for season one is frankly a little underwhelming. I'm willing to give it a pass since the game is quite enjoyable without, but you're not missing out on anything exciting by not getting the pass.--Update--Since it's been a fair while and four full seasons since I first wrote this review, I felt it was time for an update. Overall, I still stand by the original review, with the same disclaimer that you have to be able to accept the wins and losses both in this game. It certainly can be frustrating at times but much like the ship, you have to let it roll off you like water. If you let the bad moments cling to you like barnacles, then you'll be just as scuttled as your ships.Season Five just launched, and after a middling Season 2, Content Packed Seasons 3 and 4, Season 5 could be called the quality of life season. There's a decent chunk of new content (though nothing like the previous seasons, which is a reasonably high bar; 5 story missions in season 3, and roughly 8 or so new explorable lootable areas for season 4?)The biggest quality of life change in S5 is being able to quickly and easily transfer resources from barrels and storage crates without having to open the interface. This along probably would have given me another 100 hours in the game, but they also decided to add a buried treasure system! Indeed, you can bury your treasure to create a treasure map. Then, you can put that map up on the quest board at any outpost! Other pirates can take this, and if they successfully sell your treasue...boom! You get rewarded too. How fantastic is that?It's even better than that though. You can take up to five treasure pers per in game day from the board (this amount is pretty reasonable I feel, the days go quickly in the sea of thieves), and these other player maps will contain buried treasure of their own. Of course. Quality of treasure may vary, as it could be anything. Though there are commendations to encourage big, fruitful treasure maps. Really, it's a box of chocolates, you never know what you're gonna get.The best part of the whole treasure map system though? They're saved on your quests table as an item called a Map Bundle. What's that mean? It means if you sink, you lose your maps and need to recover the bundle. Or that other people could steal your maps. Or you could steal their maps, I guess, if you're a jerk. While the idea that you can lose your treasure maps may feel a bit unfortunate, it's lovely design because it means they're transferable, you could gift the map bundle, or simply leave it at an outpost when you're done for someone else to find. It adds excitement in that the treasure you buried could be yoinked by a boarder and carried away. Or that you could recover your stolen bundle to regain your rightful treasure. It adds another layer of things for pirates to bicker and barter over, and it means that should things go bad for all involves, the treasue may be lost to all.The game has been at it's best when it balances the thrill of gain with the risk of lose (even though the sting of loss can be quite painful, it's something we must learn to accept). Remember, the whole ocean is open to you, so long as you go in with the attitude that what happens, happens.\t\t\t\n", "\n\r\n\t\t\t\t973 people found this review helpful24 people found this review funny\t\t\t\t178\n\n\n\n\n\n\nRecommended\n2,372.2 hrs on record\n\n\n\n\nPosted: 28 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWell after reaching Pirate Legend and Athena's fortune Champion titles,I'm finally able to make a review of this game, I hope it will help you decide if this game is worth it! I'll probably update this review the further I play. For now I'll be talkin about the Adventure mode :)Pros :-Cool graphics and simulation of a pirate life.-It's a game where you either get addicted or hate it in the first hours.-Funnier with friends or randoms, but you'll learn so much faster in solo trust me.-Satisfying sensation when you sink ennemies boats and grab their loot.-Good game if you want to chill and kill time (but sometimes it can be stressful especially if you have a lot of loots and you're getting focused by a reaper or red flag emissaries).-Active developer team (monthly updates, quick reactivity on problems in-game through their tweeter, so I would recommend to follow them there to not miss a thing and to always be aware of what's happening).-A lot to experience, Stories, PVP, Fishing, Treasure Hunting, defeating Skeletons, world events, Seasonal events, Shipfight, collecting all achievements, and laugh with strangers :DCons:-Intensive grind.-Boring after a while.-Lack of content eventhough it was way worse back when it came out in 2018.-FPS optimization is a joke on islands (At full ultra I go from 120fps to 55 fps on big islands).-PVP mechanic is old and boring (idk maybe they need to add some new guns or mechanics).-Bugs after new updates are not even a surprise anymore.-Servers issues is normal and the community is used to it (so an advice would be to never do an event the day it comes out because you probably won't receive your loot's coins, XP and achievements).-Some events are only visible on their website and not in-game so sometimes you can miss them (Just stop it, we are lazy and hate to go through google to see our ♥♥♥ in-game event progression, just put it in game already ffs it's 2020).Overall the game has a lot of problems but I still love the concept it does represent otherwise I wouldn't have reach one of the highest titles you can earn and I hope this game will continue to get the support it deserves. I haven't played such a great game in a while, so if you like intensive farming, bugs, coop and pvp but also the big map you're in the right place. We'll be waiting for you on the ocean :)PS: If you're a veteran please help new players and don't bully them, that's what I do and I would have loved to be helped too when I started, so please do so they will always remember you, thanks fellow Legends.Edit 1:So after 3 months, the game is still awesome, probably one of the best open world in multiplayer that I've played in a while. Nothing better but to fish with friends during late nights.Edit 2:They finally added an Even tab in-game! Anyway I've been playing Arena, joined a competitive team and reached Legendary Sea Dog. So the Arena mode is way different from the actual game (adventure). It also have its pros and cons so here we go :For the positive aspects :- Helps you improve cannon shots- Helps you improve your weapon accuracy- TDM (Team deathmatch) is a lot of fun! It's like the endgame community event in the Arena- You can make friends in this mode- Since the last Arena patch, there's only one chest now and it's way better than beforeSome negative aspects :- Hitregs (When you hit players usually with weapons and you have the hitmarker but the server didn't register the damage, so sometimes you'll need to hit 3-4 time the player before he dies, and sometimes you may think they're cheater)- Lobby waiting time : because the Arena mode is not the main mode, the playerbase is not that big here, so you might wait 10-30min in the worst case...- Server region merge : Yeah well sometimes there's no server in EU (in my exemple) at certain hours and I usually get matched with NA players and I have an average of 200-250ms- FPS optimization (Even on High-End PC you'll probably struggle to maintain a stable 144fpsEdit 3:They removed their own game mode called Arena. I don't know if it would now be an interesting game for pirate that love to pvp...Quite a sad day for Sea of Thieves...Edit 4:They added an alternative to the Arena inside of the Adventure mode!Which means that you can now activate a totem on your boat which will transport you against another equivalent ship. Basically a great thing for the pvp community! Not tom mention you can customize your own ship, name it how you want, and even create or joind a Guild!At the current state, I would seriously recommend this game to every gamers wanting to experience some adventure in the pirate world. In 2023 there is a lot of things to do, explore, farm, fight, collect and stories to experiences which are really amazing.Thanks for all the support I received for this review, I wish you all a good day :) \n"]