["\n\r\n\t\t\t\t918 people found this review helpful627 people found this review funny\t\t\t\t39\n\n\n\n\n\n\nRecommended\n43.7 hrs on record\n\n\n\n\nPosted: 25 January, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWent exploring a cave fully equipped. Made it out barely alive and lost most of my equipment.It was night and I was miles away from my base.Had to cross the forest in pitch dark because using any light source makes you instantly a target.Could hear cannibal laughing and running all around me.Faraway on the hills cannibals patrols with torches where marching towards my hiding spot in the darkness of the forest.Had to hide underwater. Arrived alive to my camp at dawn. I cried and went to sleep.Woke up in the evening hearing heavy breathing outside my window.A cannibal was staring at me.They had followed me the day before and now they knew where I was hiding. Something roared. Roars got closer. More cannibals arrived and laughed at me hiding alone in a small hut. I closed the game in panic.10 out of 10\t\t\t\n", "\n\r\n\t\t\t\t810 people found this review helpful712 people found this review funny\t\t\t\t182\n\n\n\n\n\n\nRecommended\n131.6 hrs on record\n\n\n\n\nPosted: 14 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t- Travel abroad by plane with your son Timmy- Crash-  Wake up to your son being kidnapped by a naked guy  I didn't see anything- Wake up, with whiplash - Loot everything you see- Eat all the  somehow unscathed  plane food you see- Grab some sort of passenger list- Forget about it- Find some drugs- Use the drugs- See the axe that's stuck inside the flight attendant- Pull out the axe (the way King Arthur would have done it)- Jump out the back of the plane and break open some suitcases- Start cutting some trees- Realize that you're the hulk by carrying two logs at once- Open the  oh, so handy survival book  that you just so happen to have- Start building a log cabin- Realize that it's going to take forever to build it- Abandon the building site- Find a new site and start building a new, smaller house- Continue cutting trees for the rest of the day- Hear weird noises during the night- Rustling in the bushes, someone laughing- Take a closer look- See the naked man- The naked man sees you- The naked man  runs at you - Regret your decision- Panic- Run, fast- Faster- Eat, replenish your stamina- Climb, the mountain- Jump, into a lake- Swim- Swim- Swim till daylight- Run back to camp-  Change pants  Calm down- Go back to building, defense-  Remember that you have a son  Decide that you want to live10/10 Would forget about Timmy again\t\t\t\n", "\n\r\n\t\t\t\t987 people found this review helpful659 people found this review funny\t\t\t\t72\n\n\n\n\n\n\nRecommended\n47.4 hrs on record\n\n\n\n\nPosted: 13 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAggressive naked men chased me through the woods\t\t\t\n", "\n\r\n\t\t\t\t1,006 people found this review helpful747 people found this review funny\t\t\t\t107\n\n\n\n\n\n\nRecommended\n67.0 hrs on record\n\n\n\n\nPosted: 4 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrushed friend with a tree and they died 10/10\t\t\t\n", "\n\r\n\t\t\t\t374 people found this review helpful400 people found this review funny\t\t\t\t79\n\n\n\n\n\n\nRecommended\n152.7 hrs on record\n\n\n\n\nPosted: 11 September, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInstead of looking for my son I built a few gazebos, a rudimentary navy with an armada of small rafts, and fully-stocked dock homes strategically placed along the river system and coastlines. I watched the sunset while drinking a soda and realized I never wanted a son anyway. 10/10\t\t\t\n", "\n\r\n\t\t\t\t759 people found this review helpful338 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n30.2 hrs on record\n\n\n\n\nPosted: 23 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti ate a man\t\t\t\n", "\n\r\n\t\t\t\t869 people found this review helpful443 people found this review funny\t\t\t\t40\n\n\n\n\n\n\nRecommended\n19.8 hrs on record\n\n\n\n\nPosted: 20 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnaked man hit me so i eat his family👍\t\t\t\n", "\n\r\n\t\t\t\t907 people found this review helpful46 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n24.8 hrs on record\n\n\n\n\nPosted: 9 June, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI generally hate survival games.  You know the ones i mean, the ones that became almost overnight megahits a few years back like Ark, Rust etc.  Anyone who's tried to actually play one knows spawn campers and the shoot on sight mentality makes it rough without a very large group.I didn't expect to really, truly like this game as even without the PvP I thought it'd be the same tired old grind.  Chop down some trees, make a house, blah blah blah.  Jesus I was wrong.  First thing i noticed is the enemies are actually pretty terrifying.  I'd be chopping down a tree or hunting a deer and hear screeching from something that didn't even sound human anymore coming from way too close for comfort only for a mutant cannibal thing to leap out a tree at me and almost give me a heart attack. This isn't something you ever really get used to either.  The mutants are unsettling as hell in the best way possible.  Sometimes they'll just watch you from the distance, sometimes they'll screech at you without attacking.  Even when you expect them to attack, they're stealthy as hell and almost always surprise me.  It's also got the typical survival fanfare down to a science.  You're next upgrade is always right around the corner, but never easy to come by.  Combining that rock solid gameplay loop with terrifying enemies causes The Forest to transcend every other survival game I've ever tried.  It's fun, terrifying, and mysterious in the best way possible.  Cannot reccomend this game highly enough. \n", "\n\r\n\t\t\t\t755 people found this review helpful332 people found this review funny\t\t\t\t43\n\n\n\n\n\n\nRecommended\n28.3 hrs on record\n\n\n\n\nPosted: 16 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t> plane crash> find lost son> wait theres weird cannibals> omg theres mutants> halph lost in caves> i need more wood> deforestation> forget about timmy> i love my cabin in the woods\t\t\t\n", "\n\r\n\t\t\t\t556 people found this review helpful357 people found this review funny\t\t\t\t61\n\n\n\n\n\n\nRecommended\n23.2 hrs on record\n\n\n\n\nPosted: 25 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMade a cozy base under a cliff with the boys, made a dope tree-house and hunted some deer.Base gets raided at night by cannibals and 2 six-legged titty monsters whose faces look like uncircumcised peckers.We escape by boat and become nomads, live out our lives on the run cannibalizing the cannibals.Ignored saving our son in favor of building a dope gazebo and huge cannibal-proof spiked-wall.10/10 camping trip with the boys\t\t\t\n"]