["\n\r\n\t\t\t\t1,586 people found this review helpful697 people found this review funny\t\t\t\t117\n\n\n\n\n\n\nRecommended\n78.8 hrs on record\n\n\n\n\nPosted: 31 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcar go fast make sadness go bye bye\t\t\t\n", "\n\r\n\t\t\t\t1,228 people found this review helpful91 people found this review funny\t\t\t\t48\n\n\n\n\n\n\nRecommended\n0.3 hrs on record\n\n\n\n\nPosted: 9 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgreat game only thing thats negative if your a veteran player from windows store your saved game cannot be transferred over to the steam version which is the only reason i bought the game again gonna have to refund this one\t\t\t\n", "\n\r\n\t\t\t\t1,372 people found this review helpful42 people found this review funny\t\t\t\t32\n\n\n\n\n\n\nRecommended\n16.4 hrs on record\n\n\n\n\nPosted: 13 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPros: This game is addicting and has lots of content. Cons: it shouldn't be 60$ for a 3 year old game\t\t\t\n", "\n\r\n\t\t\t\t391 people found this review helpful8 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n463.9 hrs on record\n\n\n\n\nPosted: 18 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t+ It's the best arcade racing game with frequent content updates. - Expensive for an almost 3 year old game.\t\t\t\n", "\n\r\n\t\t\t\t435 people found this review helpful27 people found this review funny\t\t\t\t8\n\n\n\n\n\n\nRecommended\n401.7 hrs on record\n\n\n\n\nPosted: 15 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVery well optimized. Can run high settings at 70-80 fps with a 1050ti.\t\t\t\n", "\n\r\n\t\t\t\t733 people found this review helpful401 people found this review funny\t\t\t\t31\n\n\n\n\n\n\nRecommended\n148.8 hrs on record\n\n\n\n\nPosted: 12 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFinally I can stop playing The Crew 2 for the rest of my life\t\t\t\n", "\n\r\n\t\t\t\t228 people found this review helpful6 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n211.0 hrs on record\n\n\n\n\nPosted: 4 September, 2021\nSMOOTH RIDING WITH A FEW BUMPY ROADSFirst off, I am going to get this out of the way. If you are planning to buy this game and wondering which version to get, ask yourself this. If you are a minimalist, standard is fine. If you want the expansions, get ultimate. Deluxe on the other hand I think is worth skipping entirely. If $99.99 is too much for you for Ultimate, just wait for a sale. Ultimate is definitely my choice for recommendation. The amount of content you get is impressive and worth the price of admission. Forza Horizon 4 is a car collector's dream, with a roster of over 700 cars (with Ultimate). And also a racing enthusiasts dream playground with a decently sized map with tons of racing variety and events to play around with. I have tons of racing games on Steam personally, and none have held my interest as much as Forza Horizon 4. It's a shame though that this came so late to Steam. But even still, I got my money's worth with over 120 hours of playtime at the time of writing this. Is Forza Horizon 4 perfect though? Sadly, it is not. The Steam version is hampered with some unfortunate bugs. People may experience random crashes, which while not happening often after the last few updates, still do happen, as this game is a few versions behind the Microsoft store's own version. Something I don't know if will ever be fully fixed. Also online racing can be hit or miss with issues. Those issues usually lie in the wait times sadly, so it might be offputting for those looking to race with others. Luckily there is more than enough content without having to do online races to keep most people happy.  I'm still giving this a recommend regardless of that issue, just because more often than not, the game does run smoothly. If you happen to just get the standard version of the game you get access to the main map which is a caricatured version of Great Britain, which includes many race events ranging from your standard street races, dirt tracks and even full blown off road events. There are also other events which include speed traps, drifting, massive jumps, promotional events (like racing the Halo Warthog, racing against trains, and more), and some cool little story events like racing for Top Gear, or even opening your own businesses. There's plenty of content for sure. If you decide to get the expansions, you get other maps, including Fortune Island, which is, well, an Island, complete with both low and high altitude locations, lots of off roading, some impressive night time visuals (Aurora Borealis anyone?), and more. You also get the Lego Speed Champions map which is a fun and impressively designed map based on the Lego toys which features it's own variety of fun and unique settings, including a beach riddled with pirate ships, a haunted lighthouse, a stunt arena, and more. Also it gets it's own radio station that plays just 1 song on loop. If you guessed that song is \"Everything is Awesome\", you'd be right, Both expansions also come with a unique way of progression and their own vehicles to collect. Fortune Island will have you progress to unlock a variety of treasure hunts, that each unlock 1 million credits, and the Lego expansion has you doing different tasks to collect studs which can be used to build your house and also collect new cars. Both expansions will also include a majority of the types of events you will be used to in the base game, with their own unique flair. With 700 cars luckily there is enough variety for anyone. But for those looking for more, you can custom tune each vehicle to your own liking, with a variety of parts and overhauls, including full blown engine swaps. For those who are not gear heads, the community has you covered and you can even download custom tunes from others. Forza Horizon 4 is one of the most generous racing games I have ever played with the sheer amount of cars they dump on you. You can win cars from events. You can win cars from wheelspins. you can win cars from leveling up. You can win cars from performing certain tasks. You can win cars from barn finds, which are like little treasure hunts. You can also buy cars from both an auto show, or take your chances at an in game auction house, which is also a great way to make money, to well, buy more cars. Basically, Horizon does not let you down with the cars. It's like Pokemon for car lovers. And once you have that dream car, don't forget to give it that unique look. Most cars can have some visual parts swapped out, ranging from spoilers to bumpers and more, and you can add custom designs to the paint jobs too. Want to race around in Jurassic Park Jeep? Want to race around in the Bandit 1 from Smokey and the Bandit? Forza has you covered. And if you just want to look at the cars in all their glory, Forza also has a nice little feature called Forzavista which allows to do things with your car like opening and closing doors, and for some vehicles you can open up trunks and hoods and look inside at the engines. If you get the James Bond pack, you can even look at those nifty little gadgets like the machine guns mounted to some of the Bond vehicles. Pretty neat stuff. At the end of the day, is Forza Horizon 4 worth it? I'd say yes.\t\t\t\n", "\n\r\n\t\t\t\t1,030 people found this review helpful120 people found this review funny\t\t\t\t71\n\n\n\n\n\n\nRecommended\n203.4 hrs on record\n\n\n\n\nPosted: 20 May, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t---{Graphics}---☑You forget what reality is☐ Beautiful☐ Good☐ Decent☐ Bad☐ Don‘t look too long at it☐ Free Fire---{Gameplay}---☐ Very good☑ Good☐ It‘s just gameplay☐ Mehh☐ Watch paint dry instead☐ Just don't---{Audio}---☐ Eargasm☑Very good☐ Good☐ Not too bad☐ Bad☐ I'm now deaf---{Audience}---☐ Kids☐ Teens☐ Adults☑ All---{PC Requirements}---☐ Check if you can run paint☐ Potato☑ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{Difficulity}---☐ Just press 'W'☐ Easy☐ Significant brain usage☑ Easy to learn / Hard to master☐ Difficult☐ Dark Souls---{Grind}---☐ Nothing to grind☐ Only if u care about leaderboards/ranks☐ Isnt necessary to progress☑ Average grind level☐ Too much grind☐ You‘ll need a second live for grinding---{Story}---☐ No Story☑ Some lore☐ Average☐ Good☐ Lovely☐ It‘ll replace your life---{Game Time}---☐ Long enough for a cup of coffee☐ Short☐ Average☐ Long☑ To infinity and beyond---{Price}---☐ It’s free!☐ Worth the price☑ If it's on sale☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{Bugs}---☐ Never heard of☑ Minor bugs☐ Can get annoying☐ Cyberpunk 2077☐ The game itself is a big terrarium for bugs---{?/10}---☐1☐2☐3☐4☐5☐6☐7☐8☑9☐10\t\t\t\n", "\n\r\n\t\t\t\t619 people found this review helpful20 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n81.4 hrs on record\n\n\n\n\nPosted: 9 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝐡𝐞𝐥𝐥𝐨\t\t\t\n", "\n\r\n\t\t\t\t245 people found this review helpful8 people found this review funny\t\t\t\t7\n\n\n\n\n\n\nRecommended\n96.2 hrs on record\n\n\n\n\nPosted: 17 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbetter than horizon 5 definitely\t\t\t\n"]