["\n\r\n\t\t\t\t3,323 people found this review helpful40 people found this review funny\t\t\t\t250\n\n\n\n\n\n\nNot Recommended\n171.6 hrs on record\n\n\n\n\nPosted: 17 February, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFire your CEO and most of your executives because this is just insane. You are KILLING something with huge potential, which is 100% on the leadership. The gameplay is excellent, the ambiance is great, the scenery is incredible, and they get the setting right. But it just begins to feel like the same thing over and over and over and over and over again. They've focused more on making sure the in-game cosmetic purchases work 100 percent at a high price than fixing bugs and expanding the game. It's goofy, you need to build a product like this with longevity in mind, and it seems like that was their least concern.\t\t\t\n", "\n\r\n\t\t\t\t10,454 people found this review helpful101 people found this review funny\t\t\t\t2,290\n\n\n\n\n\n\nNot Recommended\n509.4 hrs on record\n\n\n\n\nPosted: 25 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRewriting this partially as of 07.10.2023, decided to return and check what changed in a year.If you are here to consider buying it, I would say it's worth it for the base price and with low expectations. The gameplay slaps, but most of the systems around it are flawed in one way or another.A lot of things that weres bad on release have changed, but the games still pretty far from ideal, plus FS decided to double dip into MTX shop, selling skins costing roughly $12+ for ONE character. And don't forget, it's been a year since release, so the game finally reached the \"mostly release-ready\" state in 11 months of work. *slow claps*Let me get this straight - Fatshark as a company are lying on a regular basis.Fatshark straight up lied at advertising. A lot of promo material weapons or cosmetics are unobtainable in game at launch, ability to obtain premium currency through gameplay was removed (and they were sneaky enough to edit this out of the discord post right before release), the crafting system that was supposed to be ready on release was added several months later. The promised story, but just used Dan Abnett big name as a promotion and in fact story does not exist at all, aside from couple of cutscenes. Weapon modifications system is scrapped , so you can't just attach flashlight/bayonet to a gun or get a better scope, despite it apparently being in the works not so long ago (but modders were able to restore it, so maybe FS will go through with it eventually).Release of the game that happened 30.11.2022 in not an actual release, it misses key features, and game stability was absolutely awful. You probably should already realise that from 54% all time reviews. Atm a year later it's relatively smooth sailing, but again - releasing the game in that state was an awful idea.A year later crafting notably improved, but new player will be met with a wall of grind to get the proper rolled weapon, find good blessings for the library and all that.The game still have Division 2 levels of loot stats distribution, making all weapons with bad base stats garbage even if properties and perks are amazing. This is still not addressed, so the game still wants you to check shop once per hour.Amount of content is still questionable, but much less so. Game currently features only 4 classes with 3 subclasses, making it 12 (opposed to 15 free classes V2 had on release) and amost every map in the game have a reused fragments of another map in that same location. Essentially, Weaves from V2 (same maps, but run backwards). Also, there is much more copypasted sequences (like defending while hacking servo skulls or killing small daemo-grown tentacles, these two appear on a lot of maps), which is mostly not the case for V2 where most of the events are unique and tied to a map. Plus, almost all weapons for 3/4 characters are literally the same weapons, every class have access to couple of unique items, but all generic rifles/axes/swords are the same for each class, diluting loot pool. Only Ogryn gets a full set of unique weapons, but then he have very limited options. Sadly, im not rewriting this, as FS added almost nothing new in weapon department in a year of work, and most described problems still apply. At least they reworked some weapons to stop being so bad. The game still reeks of \"effective management\", \"players engagement\" and \"retention\" a year later. Also, in game shop exploiting FOMO and does not allow you to buy items directly, instead forcing you to buy aquilas in packs and then spending aquilas on cosmetics. This is still true a year later, and it's becoming worse with introduction of \"premium skins\" that are just the most popular regiment like Steel . Do not support this BS, vote with your wallet. No skin in a game worth $10+. Also, just to give you insight, when initial backlash to MTX was addressed, they promised to add the 100 aquilas bundle, that would solve some problems with the shop.It was added, but it is hidden from the shop, and only shows when you try to purchase the item you missing 100 or less aquilas. Isn't that convenient, eh?The ingame mictrotransactions shop is taken directly from Fortnite or similar games, displaying only one set of cosmetics for each character at the time which got swapped each ~7-10 days. It initially had timers, which were removed after community backlash, but this is still exploiting FOMO, don't be fooled. Also, they added a \"convenient\" bundle to buy the most expensive skin sets with a direct price of ~10,5$ per skin (this is dinda funny, after initial negativiy the head of the studio said in the interview that they SIMPLY FORGOT to release this pack, of course, we totally believe this). For anything less than the most luxury pack you still need to sit in the shop with a calculator and try to figure out how much you want to spend and how much unused aquilas will be sitting in your inventory after you finished. And just to clarify - yes, the game is released in poor tech state, missing features, a lot of maps reuse assets (literally same parts of the levels but you move through them backwards), core mechanics didnt finished, but MTX shop is ready to use and spew 2 sets of skins and 2 hats for each class every week. Kinda ironic. Aldo adding, latest datamine showed around 150 entries with cash shop interface, including full sets, weapon skins and some separate pieces, so don't worry, Fatshark loaded this shop for the very long run. TLDR - shop is using predatory anticonsumer mechanics, don't support this, dont give them your money.And yes, people really just need to admit that after Tencent got their hands in the shares, FS just changed to worse. If you google it, chairman of the board is now chinese, same goes for non-executive, and whole bunch of staff from Level Infinite studio is listed in the credits for Darktide. In case you don't know, Level Infinite is studio that helps to design monetisation for Tencent owned projects if original studio can't make it itself. I am not putting all blame on them ofc, because this amount of incompetence and seling out should be okayed by the studio head honchos. I guess we should say thanks to them for appearance and implementation of MTX in Vermintide 2 and Darktide.The only thing that isn't broken is core gameplay. Combat is as fun as Vermintide 2 with added gunplay, but everything else surrounding the core gameplay smells bad, from progression systems to monetisation, from craft to in game challenges (these are clearly desinged with premades in mind, good luck doing them with randoms or solo), just put your finger on it - and find it broken in some way. Even a lot of basic QoL feaatures are gone. Most of the combad bugs are fixed too, so it's much smoother than it was on launch.Still, the last paragraph applies mostly unchanged:The game is manifest of what is wrong with the gaming industry nowadays - barely playable unfinished releases, already loaded with microtranscations, all mechanics are tailored to make people stay in game more (I have 200 hrs in the game, and have roughly 2 pieces of gear per class that are actually good, everything else is a pile of blue garbage), not have more fun or agency in terms of equipment. Current loot and progression somehow STILL much worse than both V1 and V2, and have no respect for player time. Maybe they need another year to address the remaning problems.\t\t\t\n", "\n\r\n\t\t\t\t1,276 people found this review helpful40 people found this review funny\t\t\t\t94\n\n\n\n\n\n\nRecommended\n47.7 hrs on record\n\n\n\n\nPosted: 3 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIn the grim darkness of the 41st millennium, there are only games released a year too early. Darktide is one of the best looking, feeling and sounding interpretations of the Warhammer 40,000 universe that has ever been released. Yet, it came out clearly too early and had many bugs and a poor progression system, with an in-game shop prioritised over promised features. That being sad, 10 months post release and after many, many patches, including the recently released complete rework of the class talent tree, it finally feels like Darktide is where it should have been at launch. Darktide is incredibly fun to play, as you slaw hordes of heretics with probably the most satisfying horde combat in a game yet, with the incredible soundtrack playing over the carnage and a near perfect rendition of a hive city it is incredible. The melee is an upgrade on Vermintide 1 + 2s, the shooting thankfully also feels incredibly weighty (especially Ogre weapons or the bolt pistol and the depth of the new talent trees, coupled with so many new abilities add a lot of depth to the game, especially at higher levels. The missions also feel very distinct visually and whilst there are shared mechanics between some missions they never feel like a copy paste of each other, likely due to the AI director and diverse location themes. Whilst I now feel comfortable recommending Darktide as a very good horde shooter, £50 is a high asking price. I would still recommend picking it up on sale, as you will get much more bang for your buck. Equally, it's a game best enjoyed with friends. I am very excited for the future of Darktide, now that it has found its feet and going by their record I am sure Fatshark will only further enhance this game to be one of the best horde games ever, which it really has the potential to be.\t\t\t\n", "\n\r\n\t\t\t\t703 people found this review helpful17 people found this review funny\t\t\t\t29\n\n\n\n\n\n\nRecommended\n87.7 hrs on record\n\n\n\n\nPosted: 5 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOn November 30th, 2022 Fatshark \"released\" Warhammer 40,000: Darktide. What they SHOULD have done is release it into public Early Access, because it was an unfinished product. As of October 3rd, 2023, Fatshark released an update to the game that has affectionately been deemed Warhammer 40,000: Darktide's \"actual release date.\" It's good now. You can play it.\t\t\t\n", "\n\r\n\t\t\t\t1,836 people found this review helpful21 people found this review funny\t\t\t\t263\n\n\n\n\n\n\nNot Recommended\n21.6 hrs on record\n\n\n\n\nPosted: 7 February, 2023\nProduct received for free\nSum-UpIn-depth analysis further down.🟩 Pros🟥 Cons- Excellent visual design: the 40K world is transposed in all its brutality, grimdark ambiance and bleakness.- Great variety of weapons, abilities, perks and equipment to adapt any class to your preferred playstyle.- High challenge level on the last two settings, that requires skill, coordination and quick thinking to overcome.- Solid overall content amount for completionists and hardcore ‘100%’ players.- High amount of bugs and balance issues across the board, from classes to weapons, enemy stats and bosses.- Significant missing content that was -promised- on release, with no ETA in sight. The devs even stopped updates in favor of bug fixing recently. This isn’t Early Access on paper, but it factually is.- Bland, uninteresting story and insipid characters that are a massive step back from what was seen in the Vermintide series.- Levels look good, but also too same-y in most cases, lack iconic locations and feel generic in terms of ambiance / design.🟨 Bugs & Issues🔧 Specs- Too many.- 3900X- 2080Ti- 32GB RAM- SSD- 1440pContent & Replay Value:The amount of time you’ll get out of Darktide is largely dependent on the objectives you set for yourself. Maxing out all characters with the best gear and completing all challenges / achievements will definitely take dozens of hours, for example. Since it doesn’t really “end”, replay value can’t be gauged.Is it worth buying?Not in the current state. Considering it’s not ‘early access’ and had multiple betas, the current amount of bugs, gameplay issues and missing content isn’t acceptable for this production level. In a year or so, and on sale, things may be different - time will tell.Verdict: MediocreRating Chart HereEven if the core gameplay formula is true and tested, with some interesting changes, Darktide remains hindered by bizarre design choices and a plethora of issues.Follow our Curator page, Summit Reviews, to see more high-quality reviews regularly.https://steamcommunity.com/sharedfiles/filedetails/?id=2913865302In-DepthSetting & Writing“In the grim darkness of the future, there is only war”. This iconic statement perfectly sums up the mood and tone of games based on Warhammer 40K; Darktide is no exception. Set in the labyrinthine, endlessly-stacked levels of a Hive World, Atoma Prime, it puts you in the shoes of one of four conscripts that, instead of jail time, were sent to fight for the Imperium in borderline-suicidal missions. Be it solo with (not so competent) bots or alongside other players online, you’ll fight against the forces of Chaos and related sub-cults.Instead of having iconic, named characters as seen in previous Fatshark installments such as Vermintide, this time around you’ll be able to create fully-customized ones. This gives more flexibility, but at a high cost: the quirky, charismatic personalities of well-written characters are in fact lost in Darktide, replaced by insipid, cringy archetypes that try to be “one size fits all” and fail quite spectacularly at that.Exploration & SecretsExceptions made for some more open levels set on the surface or into the living quarters, the bulk of them takes place in the cramped, dark bowels of the Hive City, infested to the brim with scum of all kinds. Other than the main path to follow, the numerous side rooms often house additional supplies, resources for crafting / upgrading and Grimoires, dangerous pickups that constantly degrade the party’s health, but give a better reward if you manage to carry them all the way to the end. Too bad this ‘bonus’ is rather miserable and isn’t worth the hindrance. Objective indicators and pings keep attention up and give a sense of direction; granted, levels aren’t extensive or elaborate enough to get you lost, also thanks to numerous one-way drops that prevent excessive backtracking. The level design in general is fine, however there’s too much similarity in locations and ambiance in several instances: few levels in fact truly feel unique and distinct. A major flaw is found in the level selection system, which doesn’t allow selecting any level at any time like any sanely-developed game would, but instead cycles a pool of them set on predetermined difficulties. Emperor forbid people being allowed to play what they want, when they want!https://steamcommunity.com/sharedfiles/filedetails/?id=2913865329Combat System & ClassesDarktide remains a melee-focused FPS, even if much greater emphasis was given to the ranged weapons department this time around. Players will be able to use heavy and light attacks with their melee tool of choice free of charge, plus special modes if present (such as charging a Power weapon) however Stamina will be used to block attacks, dodge and perform some other actions. Ranged weapons are limited in ammo, and serve different purposes depending on the type: plasma guns are better against heavy hitters, flamethrowers excel against hordes and so on. The “normals-specials' ' dichotomy is maintained, with fodder being omnipresent in the form of ambient and horde foes, with specials spawning from time to time, each with their own abilities, skills and weak points. Bosses are a rarer spawn, and honestly not that much of a threat unless supported by other enemies; slow and cumbersome, they can be kited rather easily in my experience.Each character will feature a Toughness bar - take it as a shield that recharges over time and protects from damage before Health is consumed - staying close to friendlies enhances the regen, an incentive to not go alone. All of them have their own passive traits, one special ‘ultimate ability’ and unique weapons to progressively unlock. KO too many times and you’ll have to respawn after a delay, and be saved by the remaining companions.If the core combat is the true-and-tested Vermintide formula, a metric ton of bugs and balance issues make it much less enjoyable. From snipers shooting you through solid walls to a couple weapons overclassing all others in terms of power, the design issues are many, and will take a long time to solve, if ever. Almost forgotten, the Psyker class is completely underpowered trash at higher difficulties, with no fix in sight to this day.Character Progression & EquipmentEach level rewards XP, currency and some materials you can use to upgrade your weapons at the dedicated terminals. Other currency types are exclusive to weekly challenges and “penances”, both being challenge types with specific requirements. The weekly ones are always on a timer, so those with less time to dedicate will be penalized as they constantly reset, while Penances have no timer but often feature weird requirements that incentive -playing in a bad way- rather than excelling at the game. It’s not rare to have players ruin a run only because of ‘penance farming’.Each weapon type, be it axes or lasguns or shotguns, has different variants with alternate fire modes, bonuses and so on, but at the end of the day you’ll go for the best accuracy and damage, because spamming a thousand bullets is meaningless if you don’t hit. With one melee and one ranged weapon each, characters have options when it comes to their role in the field, and a coordinated team may choose who takes care of the rabble and who focuses on specials and bosses. This type of team is almost mandatory to clear the higher difficulties, as randoms simply won’t cut it.\t\t\t\n", "\n\r\n\t\t\t\t5,830 people found this review helpful128 people found this review funny\t\t\t\t822\n\n\n\n\n\n\nNot Recommended\n1,529.1 hrs on record\n\n\n\n\nPosted: 6 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEdit on Class Overhaul Patch October 4th:\"The game has improved quite a bit with the past big update. Every class now has a good amount of variety in how you want to build around your character and playstyle. The addition of more difficult missions via Auric/Maelstrom is also appreciated. Balanced changes are mostly good too.However, all of this should have been in the game from the very start. Not marking this game as an early access title is a clear indicator of Fatshark's greed for money. Crafting is still heavily reliant on RNG and its a slog to get a weapon you actually want. They increased the pricing on cosmetics along with \"screwing\" over the PC playerbase by providing way more Aquillas to Xbox players, while the community gets \"insulted\" by a CM for so called \"pearl clutching\".All in all, the game has made more steps forward than back. This is one of the best horde shooter, set in the Warhammer 40k universe. So if you are into that, you might consider a buy. BUT I WON'T be changing it to a positive review because of all the lies and false pretenses FS brought to light. I just can't bring myself to support this kind of marketing. Even after all the hours i sunk into this game.\"They deemed a fully operational cash shop, which works like a charm and updates without any issues, a necessity. Here is a list of things they thought weren't needed:>It doesn't need mission select>It doesn't need a campaign>It doesn't need a story when they hired a 40k writer>It doesn't need weapons they've shown in gameplay trailers>It doesn't need the 70+(PLUS) weapons promised>It doesn't need a 5th class like vermintide on launch>It doesn't need 2nd and 3rd careers like vermintide on launch>It doesn't need crafting like vermintide on launch>It doesn't need the promo outfits>It doesn't need enemies shown in trailers>It doesn't need to run at >30 fps even on 30 series cards>It doesn't need their PR to post outside of their discord>It doesn't need to be finished on \"launch\">It doesn't need basic mob patrols>It doesn't need better spawning>It doesn't need a scoreboard>It doesn't need penances not to require griefing entire team>It doesn't need shared inventory with all characters>It doesn't need shared set of weeklies for all characters>It doesn't need unified currency>It doesn't need crossplay with Game Pass users>It doesn't need Launch stabilisation>It doesn't need an option to disable RTX>It doesn't need to prioritise core features over a virtual store>It doesn't need options to unlock store cosmetics with in-game earned currency>It doesn't need to fix crashes of the game before crashes of the store>It doesn't need a positive review scoreThe lead designer of FS thinks that the armoury shop, map rotation and crafting system are all fine. Even though people except improvements regarding these issues. Communication is nonexistent.\t\t\t\n", "\n\r\n\t\t\t\t712 people found this review helpful49 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n29.0 hrs on record\n\n\n\n\nPosted: 17 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOk it's better now.Don't pre-order games(No I did not pre-order it)\t\t\t\n", "\n\r\n\t\t\t\t1,739 people found this review helpful33 people found this review funny\t\t\t\t203\n\n\n\n\n\n\nNot Recommended\n772.4 hrs on record\n\n\n\n\nPosted: 27 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t+++Update, as of Dev Blog: Into the Maelstrom (4th of August, 2023)+++ The long-awaited communication from the developer has clearly revealed that the game will continue it's unfortunate direction. After plentiful feedback in the past months, some major pain-points have been acknowledged, but the announced plans to address them leave much to be desired, or seem outright disrespectful to the dwindling remaining player base. The statements in the original review are still painfully true. While QoL is being added, the updates are few and terribly slow. Poor RNG design decisions are still predominant. New content is still not being presented and there's still no roadmap of any kind. My recommendation stands. Look to purchase it with a discount if interested, and treat it as an investment, for when the developers finally catch-up to it's potential some years down the line. +++Original Review and Recommendations+++I've held off on a review for 6 months after release. I participated in the beta, actively engage in Discord and the forums, clocked in nearly 550 hours, got all achievements and easily play the hardest content currently available. I find the actual gameplay to be unique and personally enjoy it greatly. With that, I don't recommend spending money on this game in its current state. To make it neat and somewhat short: - The game launched in a poor technical state. While a lot of the optimization issues have been addressed there are many more still being reported on the forums. You might be one of the unlucky few. - The advertisements for the game amounted to little truth. What content it did launch with is repetitive and artificially bloated. New content is coming painfully slow and fails to satisfy or impress. - Key selling points to the Live Service model aren't being upheld. The game does get regular updates, the majority of which are fixes and balances, however. New classes haven't been spoken of since launch, a new map was released shortly after launch, with two more coming up, one of which is gated behind a community event. There have been a total of 2 new weapons in 6 months. The rest have been variants of existing items. - The game's design philosophy is heavily dedicated to RNG, with multiple (up to 7-8 in some cases) layers in certain game mechanics. There are extensive threads on the forums about this, if one is interested. - The QoL and respect for the player's time are minimal, if at all present. Mission selection is completely out of the player's hands. QoL improvements are worked on, but there's a lot left to be done. - Community engagement is very poor. FatShark have failed to acknowledge the majority of otherwise often fed back issues. This is in no way due to faults in the community managers, but rather a seemingly anti-consumer corporate policy. - No roadmap has been presented. Initial content planning was quickly reverted after the first backlashes to the game and has not been updated or even spoken of since. - A paid cosmetics shop was launched literally days after release and prior to any immediate patches or gameplay updates. While the cosmetics themselves are hit and miss, they do cost real money to obtain and cannot be obtained via in-game currency. There are cosmetics that can be (and more will be added with the latest Rejects Unite content release), but they are obviously re-skins and of lower quality to the premium store. To sum up my recommendation: Wait. If you have interest in 40K and horde shooters, the game has a wonderful core gameplay loop, but suffers immensely from poor design decisions, lack of content and a dwindling player base. This is historically accurate for FatShark releases, with their previous titles having similar lifespans. As it is now, the game doesn't stand up to scrutiny and doesn't deserve to be purchased at anywhere near full price, let alone further supported with cosmetics purchases.\t\t\t\n", "\n\r\n\t\t\t\t1,300 people found this review helpful65 people found this review funny\t\t\t\t59\n\n\n\n\n\n\nNot Recommended\n206.0 hrs on record\n\n\n\n\nPosted: 31 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSometimes the community should be allowed to decide whether a game is still in early access or not\t\t\t\n", "\n\r\n\t\t\t\t2,848 people found this review helpful53 people found this review funny\t\t\t\t466\n\n\n\n\n\n\nNot Recommended\n450.6 hrs on record\n\n\n\n\nPosted: 19 January, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHad enough.Darktide is 2 months old as of this review. It has not received the significant updates it deserves, the fixes it desperately needs or any of the attention that a live service demands.Since the beta versions of this game, the community has screamed out about one particular enemy being almost unplayable. It glitches, it's almost impossible to dodge, or avoid. Fatshark's answer to this issue and problem was to MAKE a modifier that INCREASES the amounts those enemies spawn. Then they left that as the ONLY modifier for the past 5 weeks now. Done. Sick of it.They had someone come in over Christmas to switch the real money cash shop over to the next rotation, but not maps, not map modifiers, no fixes, no updates. NOTHING.This is where this game has come to a negative score for me, I have defended it, stood by it, shouted about how much great potential it has.. only to week after week be not only disappointed and let down by the devs, or left frustrated and mad. Anger isn't enough either, it's just utterly piss poor. Fatshark are the WORST developer company I have had the misfortune of being a fan of, I enjoy most of the core gameplay from their games, but almost nothing else. The way they implement the features to a game, is not just backwards, but it is almost always a complete headache, illogical mess that only further disrespects the player. Darktide is a huge factor to that right now, we were promised new maps and modifiers in December, we only got more dogs and a almost mirror reflection of a previous map (Typical Fatshark style here, claiming reverse maps as NEW maps).We were supposed to have a crafting system by the end of December, we don't, even at the end of January.As I write this, a statement was released about making another statement at the end of the week. They said that last week aswell, and as of no surprise, we have no updates or fixes on the day we were told, hey we would have updates and fixes.Darktide has so many faults it's hard to list them all, but some serious ones that can deter any sustainable replay value are :No options to choose your desired map (You must play what is on the board // Hardly rotates)No options to choose modifier (stuck with the weekly, which has been up for weeks now)No full crafting system (You can not forge a weapon, you must buy RNG)Full RNG loot system  (It is complete cancer)No reward system (Playing a map and completing it does NOT reward loot)No end game features (Such as Fortunes of War or Chaos Wastes//Weaves)No complimentary features (Such as collectables or secrets)Insane loading times on high end computersTerrible optimization on high end computersMatchmaking is GOD AWFUL - THE VERY WORSTMatchmaking into empty lobbiesBots that are not of equal level or abilityBots that are not interactable or helpful (They can not carry books and sometimes leave you to die)Bots that purposely destroy exploding barrels or trigger DemonhostsMaps look amazing, the first couple of times, maybe even up to the 100 hour mark. Then the maps just bleed into each other, hardly much separation in biomes or atmosphere.This is again another major sour point for a Fatshark game, the game has released with such a small selection of maps again, instead of a good decent 20 maps, we get like 10, but can only ever play maybe 3 at a time. Sometimes this means for HOURS, as Heresy and Damnation level maps only rotate hourly or more.Most of the in game cosmetics you can earn are pretty lack luster, leaving only the premium real money cosmetics looking any good, and they still have a lot of clipping issues and skin contact issues. The mourning star, the ship, the hub we are all apart of, again, extremely lack luster. Feels empty and it's not as helpful as it could be. The Psykhanium for best example, only allows single player interactions. Does not properly show the buff or blessings triggering. I can't sit there with team auras, or team blessings to balance out our team or engage with the enemy in combat, it's a glorified solo training dummy.Vermintide 1/2 to Darktide - The road that was paved but is missing all the essential bricks to glory.As much as I really want to love this game, despite so many glaring issues I have with it, I am not going to praise this company anymore, or give them any more lime light. They deserve EVERY negative review this game gets slammed with, and truthfully and honestly, it has been such a DISGUSTING release, that STEAM should be stepping in here and offering full refunds to all players reguardless of hours played. We should not have to wait around for 6 months for them to finish concentrating all the efforts into finishing a console release, just to pillage those poor people of money aswell. This company needs to be seriously pulled into line, either via the players with these reviews. Steam oversight, or lawsuits. Yes lawsuits. What features were outlined as part of the full release of the game ARE NOT IN THE GAME 2 MONTHS AFTER RELEASE. This is a early access product that Fatshark is using to milk money out of you, to punch out console releases and scam money out of more people. They will leave this game unfinished and in a terrible state for the first year minimum, as they did with Vermintide 2. This is why they do not deserve your money, they do not deserve their asking price either.If you do wish to buy this game, PLEASE wait until it is a minimum of 60% off. This is the first game in a very long time that I bought at full price at first release, and it has been a very regrettable experience.This review comes from someone who invested 2000 hours into Vermintide 2 and only truly wishes this game to eventually become fantastic. Right now, where it is, it is not, and won't be for a long time.I have been pretty polite in this review, because as I state right there ^ I still WANT this game to be good, I don't want to slam it into the ground and bury it. However, it absolutely requires this harsh criticism to better its future.Sad to leave this negative review, but after not having any desire to play for 2 weeks due to so many issues, and today where we have been told there is another delay to just informing of us of what is going on. I can't help but be left so dissatisfied in this company.\t\t\t\n"]