["\n\r\n\t\t\t\t1,308 people found this review helpful32 people found this review funny\t\t\t\t180\n\n\n\n\n\n\nNot Recommended\n1,481.7 hrs on record\n\n\n\n\nPosted: 17 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTo all the players of World of Warships,I believe everyone has noticed the recent changes in the in-game economy, whether it's for anniversary celebration,plot battle,random battle,special modes,dockyard,battle pass,sequential bundles or armory. Wargaming is continuously pushing the boundaries and testing the limits of its players. If you are familiar with the game \"War Thunder,\" you probably know the consequences when game developers constantly provoke their player base. As players of this game, we contribute to its activity, and in theory, Wargaming should appreciate each and every one of us who continues to support and encourage this game. However, Wargaming keeps pushing the boundaries and exploiting each and every one of us. This recent eighth anniversary is not just a simple anniversary, Wargaming is gradually making it clear that if you don't pay for this game, you don't deserve to play it.I implore every player here to bravely stand up and resist this behavior. Wargaming has now infringed upon our rights as players, and we cannot, and should not, let Wargaming continue to exploit us in the future. It is time for us players to unite and stand together. We should be a collective, a class, opposing Wargaming's exploitation and oppression towards us. We are here to enjoy this game, to find joy in it, and we should not be working for Wargaming.I hope that each player will save and spread this message. This post will undoubtedly be deleted, but we should copy it, share it, on any platform, anywhere that allows us to make our voices heard. Fellow warriors, let's fight for our future. Stay strong!Stop recharging,leave your criticism!\t\t\t\n", "\n\r\n\t\t\t\t1,041 people found this review helpful10 people found this review funny\t\t\t\t94\n\n\n\n\n\n\nNot Recommended\n15,100.5 hrs on record\n\n\n\n\nPosted: 14 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWorld of warship has reached a new low. Everybody knows that every game company’s goal is to milk players for as much money as possible. Smart companies do it so that player pay because they are happy. Wargaming’s way is to treat players with contempt. Wargaming demands its CCs to show “respect” while treating truth tellers and players with none. Blatant falsehood during money grab only gets lame “apologies” when exposed.  How it’s PR department in Russia not get fired is beyond me.\t\t\t\n", "\n\r\n\t\t\t\t820 people found this review helpful8 people found this review funny\t\t\t\t34\n\n\n\n\n\n\nNot Recommended\n1,165.4 hrs on record\n\n\n\n\nPosted: 31 July, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe game is good but the developers are going the wrong way \n", "\n\r\n\t\t\t\t368 people found this review helpful20 people found this review funny\t\t\t\t48\n\n\n\n\n\n\nRecommended\n561.5 hrs on record\n\n\n\n\nPosted: 18 April, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI am old And struggle to keep up games that are too fast. This game allows me time to think and plan and also be a good judge of distance. I only like playing tier 5 and I dont get all the campaign and battle stuff. Please keep it fun for old hacks like me. thankyou\t\t\t\n", "\n\r\n\t\t\t\t434 people found this review helpful10 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n41.0 hrs on record\n\n\n\n\nPosted: 25 May, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTo login with a current World of Warships / Wargaming account:1. dl the STEAM World of warships client. http://store.steampowered.com/app/552990/2. run the application once, when you get to the login screen...DO NOTHING! exit the application completely by hitting the little \"X\" in the top right hand corner of the window.3. go to your WoWs folder in STEAM.  Example: local disk (C:)>Program Files (x86)>STEAM>steamapps>common>World of Warships4. In that folder, there will be an application  extension file that should be called \"steam_api.dll\". Right click on that file, click \"rename\", and put a \"2\" in front of the name (2steam_api.dll) press \"enter.5. Close folder. Restart your game from STEAM. And now you should have the option to log in with your existing account.credit to Fyrdraca on WoWs forums\t\t\t\n", "\n\r\n\t\t\t\t373 people found this review helpful14 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n2.6 hrs on record\n\n\n\n\nPosted: 3 December, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tif you want play on your wargaming account just go to steam>steamapps>commom>world of warships and rename steam_api.dll file\t\t\t\n", "\n\r\n\t\t\t\t264 people found this review helpful9 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n0.4 hrs on record\n\n\n\n\nPosted: 26 November, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSo I went through the effort of downloading and launching this game for 5 minutes just to write this review. So if you are new to the game and genuinely wanting an honest opinion on it, please read my words carefully.I've been playing this game for a little over a year now on Wargaming's client. I have over 2000 battles and 4 tier 10 ships grinded out as well. And am well on my way to more. Alright I'll get down to what everyone seems to be clamoring about and try to give an overview on it from the perspective of someone familiar with the system.Free to Play.All the skill needed in the game comes from a willingness to learn and the time invested in improving your skill. There are players I know personally who are quite good if not better than average without spending a dime. Most of the money that gets whaled on the game is spent by naval enthusiasts who just want to collect another historical ship. So how does this ingame F2p economy work?Game progression works where each ingame nation has several tech tree lines to progress through in various classes of ships. Each line is divided into 10 tiers which determine the matchmaking the ship gets as well as it's overall power relative to other ships. Each battle you play you will earn credits and exp. The amounts are infulenced by things such as winning or losing. Surviving a battle. As well as individual performance. If you do nothing you will earn nothing.In terms of exp grinding you are about halfway to a tier 10 ship in amount of exp grinded once you own a fully upgraded tier 8 ship.What can you do with real money?Well the obvious and most dramatic thing you can do is buy a premium ship. This is something I do not reccommend a new player do for many reasons.YOU ARE NOT GOOD ENOUGH. Im serious. No new player posesses the skill necessary to pull their weight in a high tier premium ship. You may get away with it with the gimmicky tier 3 and 4 premiums but this is not worth it, since the main perks of premium ships is increased credit and exp income, which at low tiers is moot as you make profit easily.PLEASE do not buy any premium ships of a tier you have never played before. You not only will be disappointed at your results and regret your purchase, but you can and will throw a game if you are high enough tier and do not pull your weight.The next thing you can buy is doubloons. This premium currency allows you to do multiple things. First it lets you convert exp earned on ships you have grinded past and allows this exp to be spend on other tech trees. Note: you still need to have played the game and have a substantial amount of exp saved in these ships. YOU CANNOT GENERATE EXP OUT OF THIN AIR WITH JUST CASH. Doubloons can also be directly converted into credits. But remember credits are useless without earning exp. Finally doubloons can be used to respec skill points put into your ship's commander, demount a placed upgrade for use in another ship without spending credits and to retrain your commander instantly when placed on a new ship. None of these actions are impossible for a ftp player it just takes time or costs an amout of credits. For example if you have a maxed out commander. You can use the excess exp as if it was already converted by doubloons.RNG elements. Dispersion as your shells leave the barrel is determined by an RNG mechanic. This mechanic is listed in port and the lower the number, the better. The number is basically saying that at your maximum range shells fired have a chance to land anywhere in an oval shaped area with a length of that many meters.This really isn't that big of a deal at all, unless you are playing low tiered battleships that have ass dispersion by design. Real life balistics on this scale of artillery were not laser accurate. They could put a shell where they wanted, mind you, but by no means were they as accurate as tanks or sniper rifles. Simply put, If you know how to aim and are skilled in leading and prediction, you can and will have a few shells hit your target per long range salvo. Medium to ideal engagement ranges, you will see most of your shells hitting. Which is pretty realistic if you ask me.As for armor and damage, That system is less realistic, but it is more consistent. Shells will do the same things under the same circumstances depending on where they hit the ship. If armor is too thick and and/or the shell isn't large enough, It will shatter and deal no damage. If the shell impacts a certain thickness of armor at an angle, and the shell isn't past a certain size, it will bounce and deal no damage.If a shell is too large and the armor of a ship is too thin, the shell will over penetrate and not have a chance to detonate it's warhead inside the target for it's regular amount of damage.Note: The above only applies fully to AP shells, HE shells have their own mechanics, but are even more consistent.The chance for an HE shell to set fire is also a random % chance as well. But most ships that need to set fires have incredible rates of fire and large shell volume so this isn't too terrible.Knowing your targets and how your shells interact with them is key to dealing damage. Otherwise you are wasting ordinance on something that isn't effective.MOBA Elements. This game is a MOBA through and through. You are on teams, Placed in an enclosed map with key areas that you need to take. There is a 2 point capture the flag mode, a 3 or 4 point domination mode, and \"epicenter\" where you have a large set of cap zones inside one another. Where the deepist zone is worth the most points.Because it is a MOBA, it is not a sailing simulator. You can and will encounter players at every tier that are playing to win and maintain their stats. Just like any online game, expect some toxic ingame chats if people have slighted each other. It can largely be ignored.I must stress PLEASE do not go into battle and ruin another players experience by not contributing, refusing teamwork, Teamkilling/damage etc. ConclusionFrom my experience this game is not near as ruined by being f2p as other games. Trust me I've played a few of those. Where literally every ingame action has a purchase option. Where if your pockets are deep enough, all content is available to you instantly. Where power creep runs rampant every month with new mechanics and items.After having dealt with the worst of the worst of f2p games, this game is absolutely nothing to worry about. Yes things will take some extra time and effort than if you invest money in the game, but paying players and free players all have to still grind a significant amount. And no amount of premium ships or economic grinding bonuses will make someone a skilled player.I reccommend this game if you want/interested in-Naval history and ships.-A competitive online MOBA played at a slower pace than most.-A free to play system that isn't pay to win.-An absolutley massive learning curve.-Are a fan of naval anime such as Kancolle, Arpeggio, or Haifuri. As there have been collabs in the past and some interesting weeb skins and mods available. \n", "\n\r\n\t\t\t\t392 people found this review helpful20 people found this review funny\t\t\t\t39\n\n\n\n\n\n\nNot Recommended\n4,032.2 hrs on record\n\n\n\n\nPosted: 9 January, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game is addicting and you live for the highs of the gameplay. But it's also addicting in the sense of a predatory free-to-play game. The expenses of all the paid parts of the game are INSANE, ships going up to £100, premium time, resources, re-allocating points and equipment. You get so wrapped up that you start rationalising spending stupid amounts of money on a single digital ship. Everything in this game is pressuring you to spend money.DO NOT play this game if you have issues with addiction or impulse control. If you do play this game look into guides on how to play effectively without paying or paying as little as possible.And none of this is to mention the gameplay experience. When in a vacuum its so enjoyable, but the balance and resultant metas are frustrating and long lasting. That you have to choose between fighting mindless W pressing bots, or island hiding HE spamming snipers.This is a warning cos you know Im still addicted to playing.\t\t\t\n", "\n\r\n\t\t\t\t766 people found this review helpful142 people found this review funny\t\t\t\t86\n\n\n\n\n\n\nRecommended\n12.3 hrs on record\n\n\n\n\nPosted: 7 July, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHololive\t\t\t\n", "\n\r\n\t\t\t\t320 people found this review helpful2 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nNot Recommended\n2,272.7 hrs on record\n\n\n\n\nPosted: 19 August, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have put 2200+ hours into this game. Unfortunately, I wish I hadn't. At its core, this game is fantastic. The mechanics, ship handling, etc. It's a lot of fun. Learning the ins and outs of ships, how they work, how to play to their strengths and exploit other ships' weaknesses. However, in recent months this game has turned into a downward spiral. The games slowly became less fun and more frustrating, and no, I'm not talking about bad teammates; you'll see those in any game.I did not whale or spend much money; I was more of a dolphin looking at my spending over 3-4 years. If you are a new player looking in, I implore you to reconsider. The devs only care about one thing, and that's your wallet. They don't care about player opinion, hell they outright deleted the forums, which for one, still deleted dissenting player opinion but was a place with a tight-knit community. They have had a track record of not supporting their content creators, as some were highly critical about where the game was going. They were kicked from their program. Wargaming hates player opinion. It's either their way or the highway, which makes the decision to quit and uninstall easier. This was easily seen with the implementation of subs, players begged WG not to add them, but unfortunately, they were added, and everyone hates them. Microtransactions in this game are deplorable. High Tier Premium ships can and will set you back a ton ($50-$100). More than half of them aren't good; many ships aren't that great. WG also takes forever to balance things; if your ship is old, forget it. It's been power crept to hell, most likely, or isn't even playable since its accuracy is downright awful. There were many times that I loved a ship only to realize that in many situations, no matter how good you were, it was just bad, and playing it was frustrating since everything around you was better. I loved the Italian BB ship gimmick and line after playing the CA line. But let me tell you, that line is garbage until you get to the tiers 9 and 10, unlike the CA line. The accuracy on those things hasn't changed since the deadeye removal, and good luck killing a DD! They capped the damage on the shells. I had a moment where I was in the Colombo, and a DD tanked 12 SAP SHELLS!!! WHAT?!? Meanwhile, the CA Italian line shreds them like butter. It may seem I'm ranting, which is partially true, but it's frustrating when game devs don't listen to the player base and constantly lie to them. They even go out of their way to be stingy with rewards (Super containers were nerfed and give nothing now). Even the grind to tier 10 is painful, and I've played Warframe. I Have more fun grinding in that game than in this one. I want to get into many other issues, but this is already a long review, so I'll keep it brief.Save your money and time. Don't download this game; play something better. The devs don't care about what you think as a player base and only care about how much they can siphon out of you. The game has become frustrating to play with the introduction of subs, and seeing how it's going, it will only get worse from here if the devs don't change their ways. I don't even recommend this game to my friends even though it's my most played game. \t\t\t\n"]