["\n\r\n\t\t\t\t432 people found this review helpful135 people found this review funny\t\t\t\t16\n\n\n\n\n\n\nRecommended\n10,731.2 hrs on record\n\n\n\n\nPosted: 11 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis isn't a free game. Each match cost you a bit of your sanity until you have nothing left.\t\t\t\n", "\n\r\n\t\t\t\t593 people found this review helpful20 people found this review funny\t\t\t\t117\n\n\n\n\n\n\nRecommended\n13,084.9 hrs on record\n\n\n\n\nPosted: 23 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you told me when I started playing dota 2 at 18 years old that I would be reviewing this game after 8 years and 13'000 hours, I would have laughed at you.Let me put that into perspective:  541 Days and 16 Hours.  Of dota 2. I'm almost 26 now, and I don't really know what to think of this game. This game has had a large impact on my life. I was \"addicted\" to the experience, in ranked and matchmaking. I've learned a lot about myself and others. I've learned a lot about staying in charge of my emotions. I've also learned that emotions can easily lose you a game before its come to its conclusion. I've learned how to react instinctively to changing pixel colours.But I've also relatively learned nothing.Not to depress anyone reading this, but when I put all of this into perspective, thinking about what could have been, I could easily imagine how much better my life would be if I never started playing this game. Socially, I would have a stronger network. My education and eventual career would probably have had more longevity (I have played professionally as a dota 2 player, but grew a lack of interest in competing). But I can never be sure how drastic these differences are. Would the pros outweigh the cons? I have certainly met and interacted with a large group of people,  because  of dota2, at events, tournaments etc. Any dota 2 player that has sunk 2000 hours or so has probably had these thoughts: \"what if I just did ... instead\" or \"what if I just played on a more casual level\". The issue is, that dota  feels  more rewarding than other things, and that's a trap I fell into.It is with a heavy heart that I admit that I don't think I can bring myself to play anymore. Took a long 8 years for me to grow out of this perfect fit, which is why I must review dota2 positively.Thank you for all that you  have  done for me. Farewell friend.\t\t\t\n", "\n\r\n\t\t\t\t1,485 people found this review helpful978 people found this review funny\t\t\t\t140\n\n\n\n\n\n\nRecommended\n5,305.4 hrs on record\n\n\n\n\nPosted: 18 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis community is so nice i got a lot of tips on how to uninstall the game and what to do with myself\t\t\t\n", "\n\r\n\t\t\t\t751 people found this review helpful490 people found this review funny\t\t\t\t85\n\n\n\n\n\n\nNot Recommended\n5,000.1 hrs on record\n\n\n\n\nPosted: 14 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAfter 5000 hours I realized that there were not 9 idiots in each match, but 10.\t\t\t\n", "\n\r\n\t\t\t\t823 people found this review helpful578 people found this review funny\t\t\t\t109\n\n\n\n\n\n\nRecommended\n0.1 hrs on record\n\n\n\n\nPosted: 23 September, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis community is so nice i got a lot of tips on how to uninstall the game and kill myself\t\t\t\n", "\n\r\n\t\t\t\t576 people found this review helpful503 people found this review funny\t\t\t\t58\n\n\n\n\n\n\nRecommended\n3.3 hrs on record\n\n\n\n\nPosted: 20 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis community is so nice i got a lot of tips on how to uninstall the game and kill myself\t\t\t\n", "\n\r\n\t\t\t\t436 people found this review helpful617 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n6,480.7 hrs on record\n\n\n\n\nPosted: 7 May, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPros:- You will learn Russian- You will learn Spanish- You will learn PinoyFor what cost?- Your friendship- Your time- Your family- Your life\t\t\t\n", "\n\r\n\t\t\t\t807 people found this review helpful98 people found this review funny\t\t\t\t48\n\n\n\n\n\n\nRecommended\n9,198.1 hrs on record\n\n\n\n\nPosted: 13 April, 2018\n\"You learn how to learn,  how to lose and most importantly you learn about you.\"Alright.... so here is my dota 2 review after playing almost 6000 hours over  the span of 3 years.1. general thoughts and how i started:I was  15 when a friend recommended dota 2 to me. Back then i wouldnt ever have imagined how much time this game would take from me. At some point i was playing 12+ hours a day for weeks. Now im approaching my 19th birthday and im kind of conflicted on what kind of impact  this game had on my life. I learned a lot about myself and generally speaking matured a lot regarding interacting with other humans. Dota isnt just a game, Dota is something else, something i have never experienced even when i was addicted to a mmorpg when i was 9-13. You learn how to learn, how to improve, how to win and how to lose. The most important thing dota teached me was how emotions impact your performance, and that  saying \"nothing\" is sometimes the best thing to do. In real life no one really teaches you stuff like that since people are kind of used to dealing with emotional ♥♥♥♥♥♥♥♥. 2. Did i waste my youth?:So this sounds a bit depressing but this is a thought that i had sometimes. but realisticially speaking, knowing myself, im really unsure of how much my life wouldve been different if i never started dota. I asume i wouldve been a bit further regarding social contacts but career/school-wise i highly doubt  that it wouldve made a big difference. You gotta  be realistic when thinking about stuff like this. Im not a very social guy. I dont like to put work into stuff i dont care about. The thoughts \"lets learn music\"  or \"lets study\" wouldnt have EVER crossed my mind when i was 15. Im pretty sure if i wouldnt have started with dota i wouldve just been gooning around the city and abuse drugs, since thats a lot of fun to me. Back then i actually never even thought about working on something to improve, that whole dimension of \"improving\" wasnt even there for me. I just went to school got home and did fun stuff sometimes. Thats it. No goals. No aspiration, nothing. Dota changed that.3. time invested into dota2:EVERY dota player that has spent more than 1000 hours into this game has had that thought of \"oh man i shouldve learned something  with this time.... i couldve been amazing now..\" at some point. But everyone is disregarding the fact that grinding dota is something VERY EASY and comfortable to do, unlike studying or learning an instrument. Just think about what kind of game dota 2 is that spending 1000s of hours is something you do with pleasure. It's kind of insane thinking about it. Once i started studying more for  school again i realized how much ♥♥♥♥♥♥♥ time 100 hours is. I garantue you that you  will be a top student if youd put 20 hours a week into studying outside of school. But the big difference is that dota is just so much more fun and REWARDING.REWARDING: dota 2 is ♥♥♥♥♥♥♥ REWARDING. you learn a new hero -> BAMM MMR. you start  understanding how to farm -> M .  M . R YOUR RANK GOES ♥♥♥♥♥♥♥ UP. IT FEELS AMAZING. at school you get an A and you smile for about 10 minutes and then youre back to being miserable. theres no punishment for being mediocre. At least thats how i feel right now and im graduating this year(grades are OK(kinda good, not great)). ReasoN I WROTE THIS: im downloading dota right now because my laptop is REALLY ♥♥♥♥♥♥ up adn deletes files something, so i needed something to do CONCLUSION: AMAZING GAME, EATS ALL YOUR TIME, YOU WILL HAVE FUN(if you are competetive) hope someone will ever read this lol hit me up if you wanna chat \n", "\n\r\n\t\t\t\t451 people found this review helpful512 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n6,625.9 hrs on record\n\n\n\n\nPosted: 25 May, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDo you have depression? Do you have anxiety? Do you get sporadic panic attacks throughout the day? Are you a racist, xenophobe who knows how to curse in 12 different languages? Do you and your friends fight all the time? Are you addicted to nicotine? Fear not. This game will give you all the above.\t\t\t\n", "\n\r\n\t\t\t\t423 people found this review helpful271 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nRecommended\n3,584.0 hrs on record\n\n\n\n\nPosted: 2 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game taught me about the diversity of cultures that our small little corner of the universe offers.Then it taught me to hate them all.\t\t\t\n"]