["\n\r\n\t\t\t\t759 people found this review helpful145 people found this review funny\t\t\t\t66\n\n\n\n\n\n\nRecommended\n5.8 hrs on record\n\n\n\n\nPosted: 6 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI get into a gameI'm lvl 1🤫Everyone else is lvl 100+They teach me how to playThey protect me instead of insulting meIt was the nicest multiplayer experience I've Had in years.Robbing banks is really fun & playing Payday is a great way to unwind afterwardsPayDay 2 is a love story about 4 men & their inability to buy a drill that works properly :)\t\t\t\n", "\n\r\n\t\t\t\t746 people found this review helpful336 people found this review funny\t\t\t\t46\n\n\n\n\n\n\nRecommended\n64.9 hrs on record\n\n\n\n\nPosted: 12 December, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNever do public stealth mission\t\t\t\n", "\n\r\n\t\t\t\t627 people found this review helpful75 people found this review funny\t\t\t\t8\n\n\n\n\n\n\nRecommended\n171.3 hrs on record\n\n\n\n\nPosted: 17 December, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI get into a game,I'm lvl 1Everyone else is lvl 100+They teach me how to playThey protect meIt was the nicest multiplayer experience I've had in years.\t\t\t\n", "\n\r\n\t\t\t\t343 people found this review helpful72 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n720.7 hrs on record\n\n\n\n\nPosted: 10 October, 2014\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJust a little disclaimer before we start: Please be understanding as English is not my first language so do excuse me for any grammatical errors, thank you!If you've seen my other review on another game, you might know my cousin. Once again, he was the one who recommended this game to me. Being the gamer that he is, he would constantly be leading all the heists and missions while I meekly followed behind trying to help. The sheer variety and creativity in each individual heist is incredible. From your normal bank heists, to breaking and entering the White House; You will never be bored of this game. Not only that, but pushing yourself and your friends to the limit is possible with so many difficulties. There were moments where we were over an hour into the mission already, getting so difficult and tough to move forward, but we persevered (also because we put in so much time already), and always ending with a huge feeling of accomplishment. And if you know me, you'd know I love the customisation functionality. I love the masks. I love them so much!-다른 게임에서 다른 리뷰를 본 적이 있다면 내 사촌을 알 수 있습니다.다시 한번, 그는 나에게이 게임을 추천 한 사람이다.그가 게이머이기 때문에, 그는 끊임없이 모든 강도와 임무를 이끌 것입니다 동안 나는 온유하게 도움을 하려고 뒤에 따라.각 개별 힙스트의 순수한 다양성과 창의력은 믿을 수 없습니다.평범한 은행 강도에서 부터 백악관을 깨고 들어가는 것까지; 당신은이 게임의 지루하지 않습니다.뿐만 아니라, 하지만 제한에 자신과 친구를 밀어 너무 많은 어려움과 함께 가능 하다.이미 선교 사업에 시간 넘게 지내고 앞으로 나아갈 수 있는 어려움이 있었지만, 우리는 인내심을 가지고 (이미 너무 많은 시간을 할애했기 때문에) 항상 엄청난 성취감으로 끝났습니다.그리고 당신이 나를 알고 있다면, 당신은 내가 사용자 정의 기능을 사랑 알고 있을 것입니다.나는 마스크를 사랑해요. 나는 그들을 너무 사랑한다!\t\t\t\n", "\n\r\n\t\t\t\t823 people found this review helpful573 people found this review funny\t\t\t\t77\n\n\n\n\n\n\nRecommended\n2,202.5 hrs on record\n\n\n\n\nPosted: 17 April, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA love story about 4 men and their inability to buy a drill that works properly.\t\t\t\n", "\n\r\n\t\t\t\t435 people found this review helpful231 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n159.8 hrs on record\n\n\n\n\nPosted: 28 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe whole thing is about 4 men who Really can't get a proper drill.\t\t\t\n", "\n\r\n\t\t\t\t432 people found this review helpful17 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n4,421.1 hrs on record\n\n\n\n\nPosted: 29 June, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAs someone who has spent 4 and a half years basically living and breathing Payday 2 and getting very involved in its community, I have a very weird love/hate relationship with this game. It is an extremely fast paced 4 person co-op shooter, and played at its lower levels of difficulty it can be very thrilling and fun. After you reach a certain point however, PD2 becomes extremely flawed, tedious and irritating. The game has changed so much from its launch days to the end, and the story of the game is also the story of its developer, Overkill Starbreeze. If nothing else, Payday 2 is a bright and shining example of why \"buff things instead of nerfing them\" is extremely toxic to a game's overall longevity.Like the first Payday game, PD2 cribs very hard from the formula set up by Valve's Left 4 Dead series. You and a group of 3 other friends can team up as bank robbers and pull off daring heists and do random crime related things. The stakes start relatively low with knocking off corner shops and small jewelry stores, and like many other things PD2 related, each new heist scenario had to top the previous one so by the end you're robbing the alien Illuminati and stealing nuclear warheads to sell on the Russian black market.Part FPS, part RPG, your skills matter just as much as your guns. You'll need to play heists to gain XP to purchase skills, which let you do mundane things like tie down hostages faster or increase your reload speed, to the fantastical such as gain up to 100% more damage the less health you have, or yell at teammates to revive them from a distance. PD2 also features a rather impressive and extensive real world arsenal. Many real life guns and gun attachments can be earned through RNG drops, though the vast loot pool means earning the exact things you want is difficult, and the developers were never able to balance all the guns properly so many are just near-identical copies of each other stat-wise.Typically heists will start you in a \"casing mode\" where you can wander around and gather your surroundings. For a while, maps had an additional \"pre-planning\" phase that you choose where to place items such as extra ammo or healing kits, as well as purchase assets to make heists easier.Gameplay has a hard delineation between a stealth phase, and the \"loud\" phase. The stealth is very shallow in depth. You are not able to interact with guards beyond killing them, and you are generally not allowed to kill more than 4 before the game forces the stealth phase to end. A handful of maps have distraction mechanics, but you will mainly be navigating around and avoiding guards. This can be easier said than done due to a lack of situational awareness from being a first person game, along with latency making multiplayer stealth all but impossible even on the best of connections.The loud phase forms the core of the game. Players must complete heist objectives while managing their resources (mainly health and ammo) and also battle the cops and keep them at bay, lest they be overwhelmed. After years of never ending cycles of \"buff the players -> the players are now too strong -> buff the enemies\", this has evolved from a slow, methodically paced cover shooter into equipping some sort of life steal/fast health regeneration build, combining it with the lowest possible armor for massive speed boosts like you're playing OG Doom with always run turned on, and then bringing either an auto-shotgun or LMG because they are both the highest DPS weapon types in the game and have the most ammo efficiency. It's not even challenging at that point; it's just tedious because the lead designer's idea of \"difficulty\" was having 100 hitscan enemies spawn at once.There is a lot of DLC in Payday 2, but prospective buyers do not need to be scared off by it. One thing Overkill did before imploding was implement an \"Ultimate Bundle\" option to buy everything at a significant discount, though removing the ability to purchase DLC a la carte was a bad PR move. If you just buy the vanilla edition without DLC, you can still play any of the paid maps as a client; you are just restricted from hosting them. PD2 has microtransactions, but they are fairly benign now and any crates you get can be freely opened.Now that Overkill Starbreeze is on the verge of shutting down, Payday 3 seems less and less like a reality. PD2 has a ton of bugs that were never fixed, and the balance was left in dire straits. At its height, it spent resources perpetually churning out DLC every month with shiny new overpowered things to keep players paying money instead of fixing bugs and keeping the game healthy. You can chart the fortunes of Overkill Starbreeze by Payday content. They added weird, fourth wall breaking items and content to promote their other games, or fellow indie developers, no matter how poorly it fit with the universe and aesthetic. Someone somewhere is still wearing the Star VR mask, made to promote Overkill Starbreeze's utter failure of a VR initiative. The developers made elaborate map changes to promote their WW2 spin-off, Raid: WW2, another game I also wrote way too many words about. In the final year of content development, before support officially ended and then the development house imploded shortly after, the quality of the content dropped noticeably. Map bugs that hadn't existed in years were back, art and animation quality suffered immensely with a lot of copy-paste implementation, etc.Don't get me wrong: there's a lot of content in PD2, and experiencing it can be quite fun especially with a group of close friends. If you're into mods, the mod scene is fairly active, though the ease of modding also makes this game a playground for hackers and some of the most popular mods might as well be hacks. The difficulty curve in this game is extremely broken and what depth to PD2's meta that existed before is basically gone, but played casually this game can still be a blast.\t\t\t\n", "\n\r\n\t\t\t\t410 people found this review helpful339 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n31.5 hrs on record\n\n\n\n\nPosted: 23 February, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDo you like stealing money and killing cops? no...? good, cause this game is mostly about fixing drills and throwing bags.\t\t\t\n", "\n\r\n\t\t\t\t1,039 people found this review helpful248 people found this review funny\t\t\t\t69\n\n\n\n\n\n\nRecommended\n705.0 hrs on record\n\n\n\n\nPosted: 22 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIt's like Payday 3, but good.\t\t\t\n", "\n\r\n\t\t\t\t678 people found this review helpful298 people found this review funny\t\t\t\t43\n\n\n\n\n\n\nRecommended\n17.9 hrs on record\n\n\n\n\nPosted: 1 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI get into a gameI'm lvl 1🤫Everyone else is lvl 100+They teach me how to playThey protect meIt was the nicest multiplayer experience I've Had in years.Robbing banks is really fun & playing Payday is a great way to unwind afterwardsPayDay 2 is a love story about 4 men & their inability to buy a drill that works properly :)hope you enjoy playing.Good Luck🌹6.5/10\t\t\t\n"]