["\n\r\n\t\t\t\t1,107 people found this review helpful36 people found this review funny\t\t\t\t330\n\n\n\n\n\n\nRecommended\n26.4 hrs on record\n\n\n\n\nPosted: 27 June, 2020\nIn a nutshellPros:1. Multiple types of races available2. Wide selection of vehicles3. Cops on steroids at night4. Vehicle damage added 5. Tonnes of vehicle customisation available6. Option to select difficulty level7. Good attention to details8. Wide range of player characters (both male/female) to select and customise.9. Can choose to play Solo(bots with  Easy/Med/Hard difficulty)/Friends (Party Play, up to 8 friends per party)/Multiplayer (16 players per server) .10. Car swap support before race/event start (need not travel to garage to change cars).11.  June update adds cross-play support, i.e You can play on PC and your friends can play with you using xbox or Playstation on same server.  Cons: 1. No more game updates, crossplay was the last2. A bit short in-game story.3. Need to have origin account as well to play the game.4. Cops are noob/hungover during day time, probably due to the steroids they had at night lol 5. Easy/Medium/Hard difficulty level only applies to races, not to Cops. Cops always remain on steroids at night and hungover during day.6. No cockpit camera view. For people who do not have time to read detailed review, please stop here lol  In detail review  The Game basicsThe game runs in both day and night time. Day time races gives money, night time races give reputation/rep.Day time is when legal, closed street road racing happens and You get money for placing 1st. This is needed for buying new cars and upgrading/customising them. Cops are present in day mode, but they are noob/hungover due to night steroids.Night time is where illegal street racing happens. These races give reputation which helps in moving ahead in story line and unlocking parts. Cops in the night time are on steroids. Race Types: The game has off-road races, on-road/closed road races, drift races and time trials. Each mode needs its own race settings for cars. A car tuned for on-road street races does ♥♥♥♥ for off road racing and drifting, no matter how good it is upgraded. So, if you come across a race event during free roam, just use the car swap feature to swap into best suited car for the event before the event begins. Need not travel back to garage/safe house for car change. And yes, You can replay completed races again to get extra cash. Heat Races There is also another race type called \"Heat race\" which are available only at night time and unlock only when Your car heat level is more than 3. These races take place on map where cop patrol density is higher. Each of these races give lot of Rep, and also unlocks \"Ultimate\" set of upgrades for your car (one part unlocked per race win), provided You can manage to evade the cops, i.e. their spike strips, the helicopter, the RAMs and their corvettes. Please note, its not easy to get rid of them, no structures to collapse on them and Your vehicles take heavy damage during collision too.. Pedal to the metal is not always an option here, as their corvettes are pretty fast too... More details on cops in \"Cops\" section below.  Customisation Both Vehicle and character customisation is available. Vehicle customisation is pretty detailed in this game.  From base engine customisation to exhaust tip sound and everything in between. You can either choose to upgrade the basic/default engine or swap it with a different high power engine instead (and then upgrade this high power engine), but You have to unlock them first though.You can select male or female player character and customise their appearance from hair styles to dressing sense. And each character has its own voice which suits them pretty well. Cops:EA games did one thing good with their franchise here, cops are pretty good and their spawn is very random and unpredictable. No structures to immobilise the cops, either pedal to the metal or jump across roads/canals using off road ramps, which if done incorrectly will give damage to Your car. Ramming into cops is not gonna help most of the times, as Your vehicle also takes significant damage on ramming cops.However, You can add modifications to Your vehicles to evade cops. Cop evading modifications are split into two types, active and passive. Active modifications need to be manually activated and passive modifications  gets activated when needed automatically without player intervention.Active ones include Kill switch attack protector, re-inflatable tyres, car repair kit etc. Passive ones include Radar disrupter (which makes difficult for cops to find You once You are out of their line of sight), NOS boosts, modifications to give extra damage to cops when You ram them OR stronger chassis modification to get lesser damage when cops ram You, etc. Although there are lot of cop evading modifications listed above,   only one active and one passive modification can be equipped on the car. One last thing, If Your vehicle gets lot of damage, You can drive through petrol bunks/gas stations to get it fully fixed (available during cop chases too). However, it can be done only 3 times after which, You have to enter safe house for repair. Safe houses are not accessible when active cop chases are in progress.Multiplayer: Ok, this is not something I've done a lot, usually I end up playing in Solo mode, but will share what I know..So, starting with the basics, when You play Online, You'll be joining server with around 16 players (PC/xbox/playstation together), thanks to cross play support. You can continue with Your regular game play of finishing races with bots in these server too (Just like Solo), OR You can challenge other players on the server to compete with you. However, its on other players to accept Your challenge, but if they do and You win that race, You'll end up getting bonus money/rep etc. (around 40% boost over doing it on Solo I think)Night time mp gets more exiting. If you are in a race on Your own, minding Your own business, and another player (elsewhere on map) gets into a high heat cop chase, he/she can bring entire cops on You, even if You are in between another race. Other players can take You out OR Your opponents, purely depends on Your luck.. Multiplayer Crew System: Another aspect of Multiplayer gaming is, the crew system. You can create your own crew OR join existing one by sending request. The crew leader has to approve Your request, only then can You join their crew. A crew can have 32 players.Also, crews can be levelled up from level 1 to level 50. Each level upgrade gives (to everyone in the crew) bonus perks in game, like bank/money boosts per race, rep boosts etc. Level 50 unlocks the amazing Ferrari fxx k-evo '18.To level up Your crew, You have to either complete daily challenges or beat time trails done by other crews. The more members in Your crew, the faster the crew levels up I think. This is all the knowledge I have on multiplayer aspect of this game, I might have missed things but this should be sufficient for You to get started haha..Concluding.. There might be more aspects to this game which I might have missed/not explored.. If you find something missing in the review, please do let me know in the comments. If you disagree with the review, please inform that in the comments too, but please do not be toxic in the comments just because You disagree haha. I'm all ears for your comments...Finally, Hope this long review helps!!! And thanks for spending time to read through it haha.. For any queries, please comment on the review and I'll try to answer when possible. Thanks!!Overall:Graphics: 8/10Gameplay: 8/10Story: 7/10 (bit short, story can be finished within 15 hours of gameplay)Customisation: 11/10Attention to details: 10/10  Thanks for reading detailed review and giving importance to the time I spent writing it haha  \n", "\n\r\n\t\t\t\t3,385 people found this review helpful1,313 people found this review funny\t\t\t\t261\n\n\n\n\n\n\nRecommended\n5.2 hrs on record\n\n\n\n\nPosted: 29 September, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo matter how far I drive, I can't out drive my loneliness\t\t\t\n", "\n\r\n\t\t\t\t270 people found this review helpful77 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nRecommended\n37.5 hrs on record\n\n\n\n\nPosted: 29 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNo matter how far I drive, I can't out drive my loneliness\t\t\t\n", "\n\r\n\t\t\t\t1,688 people found this review helpful277 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nRecommended\n42.9 hrs on record\n\n\n\n\nPosted: 28 September, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEA didn't do too many EA things to this one :) Would Recommend\t\t\t\n", "\n\r\n\t\t\t\t435 people found this review helpful13 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n21.5 hrs on record\n\n\n\n\nPosted: 19 September, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRemoving the old review as I realized there is offline/solo play, but the game upon starting seems to default you into online play. But there is proper single player mode, with working pause.So far I've had fun.\t\t\t\n", "\n\r\n\t\t\t\t278 people found this review helpful5 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n14.5 hrs on record\n\n\n\n\nPosted: 8 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game is excellent for a short time of entertainment. If you're looking for a decent racing game, I'd recommend trying out this game. However, there are a few things that you might want to consider before buying. The good things about the game:- GRAPHICS: Graphics is a big plus. The game looks great and lovely instead of being dark and bland like the previous games. The game is much more vibrant in color, and the attention to detail is gorgeous. Particles, visual effects, textures are much more detailed and impressive. However, it might be a downside for some people as it would take up a lot of your computer's resources, in which it could make your game runs poorly as you cranked the settings to the top. Personally, the game runs smoothly for me. I have a GTX 1080Ti, ran the game with everything maxed out, and still get roughly 80fps on 1080p. I never had any hiccups or lag whatsoever. Still, I think they could do better optimization with the game. Although it is not bad, it is not good either.  - HANDLING: Handling and configurations are much better, and it's much easier for someone new to the game. On the other hand, hardcore gamers might feel this game is a lot easier than any previous game, which makes the game feels more like an arcade racing game than being another version of Forza Horizon. Nevertheless, It is much more enjoyable now, I'd say. - CUSTOMIZATION: Customization is much better as there are more options to choose from. Cosmetics and gears are not related, so you can put whatever you like in your car without worrying about the cosmetics interfering with your car's stat. There are plenty different customization for the cars depend on each one, pretty much the same to the 2015 NFS version as well. Also, you can choose outfits for your characters as well.- THE THRILLS: If you are a person who likes the feeling of being pursued, then this is the game for you. As the cops are annoying as hell, they would chase you everywhere you go. They are like your boyfriends/girlfriends as they will never let you out of their sights. On the other hand, if you do not like it, don't get it, or you'd break more controllers than you ever had. - ORIGIN TO STEAM: If you had the game on Origin and you repurchased it on Steam, it will merge the save data and let you continue where you left off. I started with Origin Access and now picked it up again on Steam, and I still have whatever cars/level/money I had.The bad things: - THE STORY: Although the story is not poorly written, it is short and predictable. You only have 4 to 5 main story missions, which you can do quite fast as soon as you have the right car. You can finish the story mode in approximately 4 hours.- TOO HARD: The difficulty is not working. Whether easy or hard, the cops are still coming at you hard like they got all the time in the world. The annoying problem is they appear from nowhere most of the time. Sometimes when you pop up your map to look for cops to evade and think they are not there, think again. Next seconds you thought it was clear; they appeared and got the whole gang chasing you. Bang! Bang! Police Gang! =))- TOO EASY: On the contrary, if you grind for money and choose to race against bots, they drive like any other track touring games out there as they'd follow exact turning/driving procedures, and not even try to speed, hit or ram you. For instance, you can see yourself sometimes might overlap the other racers even with the hardest difficulty. - TUNING/TWEAKING: If you are looking for a game that has tuning features and customization like Forza games, this game is nowhere near it. This game is more like an arcade racing game that simplified almost every aspects of car tuning with some extra entertaining features. Specifically, you choose the gears that give you the most powerful stats and suitable for your play style. The only good thing is there are multiple different engines to choose from. But as soon as you swap into the other one, basically you uses the same gears part to upgrade it, nothing really special beside a boost to your car's stats and something for you to explore/build. Although tuning is not really detailed, it focus more and go back to the root of what NFS used to be. I'd say if you enjoyed the old NFS from the 2015 version and before that, I think you'd like this game too. This time around, they make it feel much more enjoyable and rewarding by how you earned the parts. Besides, you don't have to open loot boxes to get gears like Payback, which is a plus for me. - REPLAYABILITY: After grinding for gears, you pretty much don't have anything else to do unless you keep on re-doing all the driving missions to earn more money or REP (Reputation). As there are only two main things: REP (EXP) and money. After 5 hours of the main story and 10 hours of Ultimate gears grinding, I've done most of the things that the game has to offer. The game does not have other events or modes that you can participate in..Therefore, there is not much of replayability value, and it gets boring fast. Most of the tracks are circuit or sprint which are repetitive to me, nothing too special though. If you're looking for diversity, go for The Crew 2 as there are more stuffs to do than this game. However, if that does not worry you, go for it. There will be plenty of missions and race tracks for you to choose from, so that you can earn more money to buy cars and fully upgrade them. - ORIGIN: The game is still on Origin, and you just basically buy it through Steam. As the players seem to have more troubles with Origin client than with the game itself, it makes the whole transition from Origin to Steam worthless. Before that you only have 1 DRM, with this type of management, now you have 2 DRMs. What you install is another light version of Origin to verify the game one more time before starting it. Good job EA, beside the profits reason, I don't even know what is the purpose of bringing it onto Steam anyway. Take Microsoft games as an example, where they brought most of their top-tier games onto Steam without asking you to install the Xbox app. TL; DR:Good game, excellent handling, good customization, okay optimization, decent story, not too much of replayability, bad Origin.https://steamcommunity.com/sharedfiles/filedetails/?id=2121336457https://steamcommunity.com/sharedfiles/filedetails/?id=2122787071 \n", "\n\r\n\t\t\t\t307 people found this review helpful102 people found this review funny\t\t\t\t36\n\n\n\n\n\n\nRecommended\n38.2 hrs on record\n\n\n\n\nPosted: 23 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfast car make sad voice in head go away\t\t\t\n", "\n\r\n\t\t\t\t203 people found this review helpful1 person found this review funny\t\t\t\t28\n\n\n\n\n\n\nRecommended\n18.8 hrs on record\n\n\n\n\nPosted: 29 November, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBUY IT IF - You're a NFS Fan and crave that latest gen graphics enabled \"need for speed\" experience, dont give a damn about the storyline and want that high speed arcade-ish racing experience.DON'T BUY IT IF - You're looking for a long and engaging storyline, memorable characters (the likes of NFS MW 2005, Carbon) and a game with realistic car handling.WANT TO READ THE WHOLE SHEBANG? THANK YOU FOR TAKING THE TIME.GRAPHICSAlthough the game was plagued with numerous performance issues, fps drops and sudden stutters around its launch time, EA has since then done a good done optimising it for PCs and you should be able to enjoy the game stutter free now if you have a decent rig. The graphics obviously are good and on par with most racing games of this generation. The game looks even better at night with the frostbite engine taking full advantage  of latest gen hardware and showing some truly phenomenal lighting, specular and particle effects (try to run it at least on high to enjoy it fully). A graphical powerhouse as expected from EA.GAMEPLAYPeople who have been playing the last few NFS games would be easily familiar with the car handling, EA hasn't changed much in the frostbite engine in terms of vehicle handling and although it is very different to the old vehicle handling of the NFS Underground, MW and Carbon era, it is intuitive and easy to learn for newbies. Emphasis has been placed on usage of the Handbrake (E-brake), with most top end fast cars requiring you to tap the e-brake to quickly turn into sharp corners. What impressed me the most was the off-road handling which was smooth and fun. The cop system is highly impressive, the cop cars are formidable at higher heat levels which adds a nice challenge to the races.  People looking for realistic handling experience like Forza, BACK OFF !BOTTOM LINEAll in all, an arcade-ish fast paced racing game with good graphics and a mediocre, borderline boring and rather short storyline. The multiplayer is kinda fun i.e. racing with your friends. There is quite a collection of cars which will keep you entertained suitably long enough. A worthwhile buy if you snag it during a sale.\t\t\t\n", "\n\r\n\t\t\t\t172 people found this review helpful5 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n42.5 hrs on record\n\n\n\n\nPosted: 25 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIn a nutshellPros:1. Multiple types of races available2. Wide selection of vehicles3. Cops on steroids at night4. Vehicle damage added5. Tonnes of vehicle customisation available6. Option to select difficulty level7. Good attention to details8. Wide range of player characters (both male/female) to select and customise.9. Can choose to play Solo(bots with Easy/Med/Hard difficulty)/Friends (Party Play, up to 8 friends per party)/Multiplayer (16 players per server) .10. Car swap support before race/event start (need not travel to garage to change cars).11. June update adds cross-play support, i.e You can play on PC and your friends can play with you using xbox or Playstation on same server.Cons:1. No more game updates, crossplay was the last2. A bit short in-game story.3. Need to have origin account as well to play the game.4. Cops are noob/hungover during day time, probably due to the steroids they had at night lol5. Easy/Medium/Hard difficulty level only applies to races, not to Cops. Cops always remain on steroids at night and hungover during day.6. No cockpit camera view.In detail reviewThe Game basicsThe game runs in both day and night time. Day time races gives money, night time races give reputation/rep.Day time is when legal, closed street road racing happens and You get money for placing 1st. This is needed for buying new cars and upgrading/customising them. Cops are present in day mode, but they are noob/hungover due to night steroids.Night time is where illegal street racing happens. These races give reputation which helps in moving ahead in story line and unlocking parts. Cops in the night time are on steroids.Race Types:The game has off-road races, on-road/closed road races, drift races and time trials. Each mode needs its own race settings for cars. A car tuned for on-road street races does ♥♥♥♥ for off road racing and drifting, no matter how good it is upgraded. So, if you come across a race event during free roam, just use the car swap feature to swap into best suited car for the event before the event begins. Need not travel back to garage/safe house for car change.And yes, You can replay completed races again to get extra cash.Heat RacesThere is also another race type called \"Heat race\" which are available only at night time and unlock only when Your car heat level is more than 3. These races take place on map where cop patrol density is higher.Each of these races give lot of Rep, and also unlocks \"Ultimate\" set of upgrades for your car (one part unlocked per race win), provided You can manage to evade the cops, i.e. their spike strips, the helicopter, the RAMs and their corvettes.Please note, its not easy to get rid of them, no structures to collapse on them and Your vehicles take heavy damage during collision too.. Pedal to the metal is not always an option here, as their corvettes are pretty fast too...More details on cops in \"Cops\" section below.CustomisationBoth Vehicle and character customisation is available.Vehicle customisation is pretty detailed in this game. From base engine customisation to exhaust tip sound and everything in between. You can either choose to upgrade the basic/default engine or swap it with a different high power engine instead (and then upgrade this high power engine), but You have to unlock them first though.You can select male or female player character and customise their appearance from hair styles to dressing sense. And each character has its own voice which suits them pretty well.Cops:EA games did one thing good with their franchise here, cops are pretty good and their spawn is very random and unpredictable. No structures to immobilise the cops, either pedal to the metal or jump across roads/canals using off road ramps, which if done incorrectly will give damage to Your car. Ramming into cops is not gonna help most of the times, as Your vehicle also takes significant damage on ramming cops.However, You can add modifications to Your vehicles to evade cops. Cop evading modifications are split into two types, active and passive. Active modifications need to be manually activated and passive modifications gets activated when needed automatically without player intervention.Active ones include Kill switch attack protector, re-inflatable tyres, car repair kit etc. Passive ones include Radar disrupter (which makes difficult for cops to find You once You are out of their line of sight), NOS boosts, modifications to give extra damage to cops when You ram them OR stronger chassis modification to get lesser damage when cops ram You, etc.Although there are lot of cop evading modifications listed above, only one active and one passive modification can be equipped on the car.One last thing, If Your vehicle gets lot of damage, You can drive through petrol bunks/gas stations to get it fully fixed (available during cop chases too). However, it can be done only 3 times after which, You have to enter safe house for repair. Safe houses are not accessible when active cop chases are in progress.Multiplayer:Ok, this is not something I've done a lot, usually I end up playing in Solo mode, but will share what I know..So, starting with the basics, when You play Online, You'll be joining server with around 16 players (PC/xbox/playstation together), thanks to cross play support. You can continue with Your regular game play of finishing races with bots in these server too (Just like Solo), OR You can challenge other players on the server to compete with you. However, its on other players to accept Your challenge, but if they do and You win that race, You'll end up getting bonus money/rep etc. (around 40% boost over doing it on Solo I think)Night time mp gets more exiting. If you are in a race on Your own, minding Your own business, and another player (elsewhere on map) gets into a high heat cop chase, he/she can bring entire cops on You, even if You are in between another race. Other players can take You out OR Your opponents, purely depends on Your luck..Multiplayer Crew System:Another aspect of Multiplayer gaming is, the crew system. You can create your own crew OR join existing one by sending request. The crew leader has to approve Your request, only then can You join their crew. A crew can have 32 players.Also, crews can be levelled up from level 1 to level 50. Each level upgrade gives (to everyone in the crew) bonus perks in game, like bank/money boosts per race, rep boosts etc. Level 50 unlocks the amazing Ferrari fxx k-evo '18.To level up Your crew, You have to either complete daily challenges or beat time trails done by other crews. The more members in Your crew, the faster the crew levels up I think.This is all the knowledge I have on multiplayer aspect of this game, I might have missed things but this should be sufficient for You to get started haha..Concluding..There might be more aspects to this game which I might have missed/not explored.. If you find something missing in the review, please do let me know in the comments.If you disagree with the review, please inform that in the comments too, but please do not be toxic in the comments just because You disagree haha. I'm all ears for your comments...Finally, Hope this long review helps!!! And thanks for spending time to read through it haha..For any queries, please comment on the review and I'll try to answer when possible. Thanks!!Overall:Graphics: 8/10Gameplay: 8/10Story: 7/10 (bit short, story can be finished within 15 hours of gameplay)Customisation: 11/10Attention to details: 10/10\t\t\t\n", "\n\r\n\t\t\t\t603 people found this review helpful232 people found this review funny\t\t\t\t69\n\n\n\n\n\n\nRecommended\n55.9 hrs on record\n\n\n\n\nPosted: 31 October, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t⢸⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⡷⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⡇⠢⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠈⠑⢦⡀⠀⠀⠀⠀⠀Are you wasting my money again, son?⢸⠀⠀⠀⠀⢀⠖⠒⠒⠒⢤⠀⠀⠀⠀⠀⡇⠀ ⠀⠀⠀⠀⠙⢦⡀⠀⠀⠀⠀⢸⠀⠀⣀⢤⣼⣀⡠⠤⠤⠼⠤⡄⠀⠀⡇⠀⠀ ⠀⠀⠀⠀⠀⠙⢄⠀⠀⠀⠀⢸⠀⠀⠑⡤⠤⡒⠒⠒⡊⠙⡏⠀⢀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠢⡄⠀⢸⠀⠀⠀⠇⠀⣀⣀⣀⣀⢀⠧⠟⠁⠀⡇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⡇⠀⢸⠀⠀⠀⠸⣀⠀⠀⠈⢉⠟⠓⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢸⢸⠀⠀⠀⠀⠈⢱⡖⠋⠁⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢸⢸⠀⠀⠀⠀⣠⢺⠧⢄⣀⠀⠀⣀⣀⠀⠀⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⢸⠀⠀⠀⣠⠃⢸⠀⠀⠈⠉⡽⠿⠯⡆⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⠀⠀⣰⠁⠀⢸⠀⠀⠀⠀⠉⠉⠉⠀⠀⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⢸⠀⠀⠣⠀⠀⢸⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⠀⠀⠀⠀⠀⢸⠀⢇⠀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⠀⠀⠀⠀⠀⡌⠀⠈⡆⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⠀⠀⠀⠀⢠⠃⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⢸⠀⠀⠀⠀⢸⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸ Get it on a massive sale since the developer was forced to abandon the game thanks to EA's great practices. They hype up the game for a year and suddenly abandon it because they just don't feel like updating it anymore. This has been the issue with Ghost Games whose staff is mostly in Criterion Games. They develop a game from the ground up only to be forced by EA to release the games on an unreal deadline.\t\t\t\n"]