["\n\r\n\t\t\t\t3,408 people found this review helpful39 people found this review funny\t\t\t\t391\n\n\n\n\n\n\nRecommended\n27.8 hrs on record\n\n\n\n\nPosted: 8 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMixed reviews because everyone says the movement is slower than the beta.... The devs themselves have said they didnt touch movement in any way, they lowered the default fov and changed some of the animations so the game may feel slower but it isnt. Just turn up your FOV a bit when you open the game.Honestly, its great to have such a fresh, unique game to play, playing the beta was the most fun I've had in a shooter game in probably 10 years. I honestly feel bad for the devs that everyone is ♥♥♥♥♥♥♥♥ on the game for them nerfing movement when its just not true.\t\t\t\n", "\n\r\n\t\t\t\t1,936 people found this review helpful727 people found this review funny\t\t\t\t123\n\n\n\n\n\n\nRecommended\n43.9 hrs on record\n\n\n\n\nPosted: 11 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was too fat and slow to get to the top of the building to steal the vault, so I just brought the building down to me. 10/10 by far.\t\t\t\n", "\n\r\n\t\t\t\t1,678 people found this review helpful208 people found this review funny\t\t\t\t72\n\n\n\n\n\n\nRecommended\n20.4 hrs on record\n\n\n\n\nPosted: 11 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJust played with my boys for 3 hours straight. Didn't win a damn thing. Had a great time anyway.\t\t\t\n", "\n\r\n\t\t\t\t2,604 people found this review helpful1,555 people found this review funny\t\t\t\t271\n\n\n\n\n\n\nRecommended\n575.3 hrs on record\n\n\n\n\nPosted: 11 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgreat when on adderall otherwise good luck playing ranked without it. seems kids these days are either all on stims or started playing online fps in their mothers womb\t\t\t\n", "\n\r\n\t\t\t\t4,636 people found this review helpful451 people found this review funny\t\t\t\t386\n\n\n\n\n\n\nRecommended\n31.6 hrs on record\n\n\n\n\nPosted: 13 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t▒█▀▀█ ▒█▀▀▀ ▒█▀▀█ ▀█▀ ▒█▀▀▀█ ▒█▄░▒█▒█▄▄▀ ▒█▀▀▀ ▒█░▄▄ ▒█░ ▒█░░▒█ ▒█▒█▒█▒█░▒█ ▒█▄▄▄ ▒█▄▄█ ▄█▄ ▒█▄▄▄█ ▒█░░▀█▒█░░░ ▒█▀▀▀█ ▒█▀▀█ ▒█░▄▀▒█░░░ ▒█░░▒█ ▒█░░░ ▒█▀▄░▒█▄▄█ ▒█▄▄▄█ ▒█▄▄█ ▒█░▒█▒█▀▀█ ▒█░▒█ ▀█▀ ▒█▄░▒█ ░█▀▀█▒█░░░ ▒█▀▀█ ▒█░ ▒█▒█▒█ ▒█▄▄█▒█▄▄█ ▒█░▒█ ▄█▄ ▒█░░▀█ ▒█░▒█\t\t\t\n", "\n\r\n\t\t\t\t1,695 people found this review helpful90 people found this review funny\t\t\t\t40\n\n\n\n\n\n\nRecommended\n64.0 hrs on record\n\n\n\n\nPosted: 13 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfun game.  apparently the cheaters have arrived tho.  also i have seen a lot of chinese names in european lobbies,  please region lock china for the sake of the game\t\t\t\n", "\n\r\n\t\t\t\t1,844 people found this review helpful688 people found this review funny\t\t\t\t62\n\n\n\n\n\n\nRecommended\n5.8 hrs on record\n\n\n\n\nPosted: 9 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAt least you don't have to build an apartment complex to win in The Finals\t\t\t\n", "\n\r\n\t\t\t\t1,939 people found this review helpful31 people found this review funny\t\t\t\t222\n\n\n\n\n\n\nRecommended\n27.5 hrs on record\n\n\n\n\nPosted: 10 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGame got review bombed by fake news. I feel bad for the devs, they make a great and refreshing game, than they get review bombed by people who forgor to change their FOV and people who didn't feel the difference from 200 to 40 ms.Explanation: The game was getting review bombed by people complaining they slowed down the movement, when they in fact didn't, they just reset the FOV to 70, but you could just change it back to your preferred FOV. And the other people review bombing were complaining they didn't have servers in their region, when they actually did, the game just falsely reported not having it (The game didn't show Oceania servers, but Oceania servers were in the game and people were playing on them already).\t\t\t\n", "\n\r\n\t\t\t\t1,271 people found this review helpful456 people found this review funny\t\t\t\t86\n\n\n\n\n\n\nRecommended\n7.3 hrs on record\n\n\n\n\nPosted: 22 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tNot all Chinese players are cheating. But if you find one who's cheating, they're absolutely Chinese.\t\t\t\n", "\n\r\n\t\t\t\t783 people found this review helpful29 people found this review funny\t\t\t\t27\n\n\n\n\n\n\nRecommended\n12.8 hrs on record\n\n\n\n\nPosted: 12 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGame is amazing, but region lock Chinese players, half of them are blatant cheaters. Game is already plagued by them, and EasyAnticheat doesn't seem to stop them from ruining games.\t\t\t\n"]