["\n\r\n\t\t\t\t2,935 people found this review helpful64 people found this review funny\t\t\t\t53\n\n\n\n\n\n\nRecommended\n1,559.5 hrs on record\n\n\n\n\nPosted: 5 May, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTerraria's latest major update, Journey's End (1.4) Labor of Love (1.4.4) is here. And it's great! I'll explain to all of you why I recommend Terraria. You should get this game right now since the game is essentially complete and is full of content (and thanks for all the feedback on my review! It's much appreciated).Intro:If I were to explain Terraria to someone quickly, I would put it like this: Terraria is a game that has a whole world to explore. You mine, build, craft, fish, and fight to progress through the game. You can focus on fighting enemies and improving your gear to fight various bosses, and/or you can focus on building your house and buildings and making things look pretty. Terraria has something for everyone. The combination of survival, fighting, exploration, and building aspects is satisfying (and I'm someone who usually plays shooter games). So I believe that you can find something in Terraria for you.Building:When Re-Logic added half blocks and slanted blocks to Terraria in 1.2, the building got so much more interesting and versatile. There are so many different types of blocks in this game with their own unique textures and styles, and with paint there are even more possibilities. So many creations made in this game are incredibly good.Difficulty:Overall, Terraria with a Classic (AKA Softcore) character and Classic (AKA Normal Mode) world is not that hard, but just be aware that no matter what, you’ll probably die a lot as a beginner. If you like a challenge, however, Expert Mode is the way to go (plus you get extra advantages, such as exclusive accessories, for having an increased difficulty). Even more difficult is Master Mode, giving you more loot than Expert Mode. And if you want the game to be especially difficult, you could create a Mediumcore character (drop all items on death), Hardcore character (permadeath), or use a world seed such as For the worthy. There is also Journey Mode, which is an adjustable difficulty semi-creative mode that requires a Journey exclusive character (can’t go to Classic, Expert Mode, or Master Mode worlds). Personally, I think playing a Classic character in Expert Mode is the most fun way to play.Music:Terraria’s music is great. All of it fits with the style of the game. Almost every biome has a unique song to fit with the theme, and there are different songs for bosses and events as well. I bought the official soundtrack and I love to listen to it whenever I want some background music.Multiplayer:Multiplayer is incredibly easy to set up. The easiest way to play is to join/host through Steam. You can also enter an IP address, which, before 1.3, used to be the only way to play multiplayer at all, but now it's so much easier with Steam integration.Connection is rarely a problem for me, although I think I’ve found that the host has worse lag than the other players, when there is lag that is.Terraria is very fun to play with friends and even with strangers. There are teaming options, PVP, and other multiplayer elements built into the game. Bosses are often much easier to beat in multiplayer as well, because usually if one player dies, the other player(s) can continue to fight the boss and stay alive long enough to let the first player respawn.Performance:Terraria runs very well. On my gaming PC, the game runs perfectly on max settings and has nearly instantaneous loading speeds. On my over a decade old Toshiba laptop, the game runs very nicely on low settings, with only minor loading times.There are several video settings that can be modified to help performance. I would recommend at least turning the background and effects off for lower-end computers.Price:Terraria is very inexpensive. It’s one of the few games I’ve bought at full price and found it completely worth it.Struggles:Terraria has a learning curve. There are many things left up to you to figure out from the start. The Guide NPC is there to give some help. Many things, however, are left up to the player to figure out, much of which is just learned through time and experience. I would recommend looking up tips, tricks, and other information online, such as on the Official Terraria Wiki, or watch videos, like those of ChippyGaming and Edward on YouTube. Personally, I enjoy the learning curve, and the struggle to learn new things is just the right amount to be enjoyable and not annoying.To get to the endgame of Terraria, it does take a while. There is so much content and so many bosses in just vanilla Terraria, that it can be overwhelming, and progression can sometimes feel slow. You may want to rush things like bosses, but you have to prepare well for bosses, or else you’ll probably die. I used to ragequit when I couldn’t beat bosses, and I still get frustrated if I can’t beat a boss. Once you defeat bosses, however, it feels so worth it. And you don’t have to follow an exactly linear path either. Also, you don’t have to play for 30+ hours for a full playthrough just to feel accomplished. From one to a million hours, this game is fun for any length of time.My biggest struggle with this game is the grind for certain items. Some items are extremely hard to get, due to low drop rates or pretty extreme circumstances. There are many items with a drop chance lower than 1%. Realistically, you won’t get every item in the game, if that’s what you’re aiming for. I once wanted to get every enemy banner in the game (you have to kill 50 of the same enemy to get a banner) legitimately, but I gave up on that idea because of how grindy it is to kill 50 of each enemy for the rarest ones (that darn Nymph Banner). To put it simply, it’s possible to get every item in the game, but it’s just not worth it. You should, however, build farms for certain items. But the point is, just get the items in the game that you really want to get legitimately, and it’ll be worth it (if you did want every single item in the game, you can use inventory editors or go to free item servers, but it’s not fun to abuse these).Tips:* Organize and name chests ASAP* Place rope down a Hellevator* Coral Torches are waterproof and Cursed/Ichor Torches (craftable in Hardmode) are liquidproof, making them ideal for being placed on bridges and Hellevators* The Smart Cursor, toggled on or off using Left Ctrl by default, is extremely useful for digging straight tunnels, building structures such as bridges, removing large areas of walls, and other functions. However, don't forget to toggle it off when you're not using it since things can go out of control* Look up how to maintain world purity, since the Corruption, Crimson, and Hallow biomes spread across the world, and the Corruption/Crimson can infect the Jungle biome over time* Go fishing. It’s worth it. Fishing gives you so many tools, accessories, and other loot that enhance the game tremendously. Once you find the Angler NPC in the Ocean biome at either end of the world, use him to get quests to find a specific fish, which you can redeem for loot* For making potions, use an Alchemy Table from the Dungeon to have a 1 in 3 chance to not consume potion ingredients* Use Invisibility Potions while farming for Truffle Worms* Use Warmth Potions while fighting cold/ice-themed enemies (Deerclops, Frost Moon, etc.)Conclusion:I've played this game for over a decade now. I made a Steam account for this game, and I've played through so much of the game's development back when there wasn't even a fraction of the number of items in the game. To put it simply, Terraria is my favorite game. So after well over a thousand hours of playtime, I can safely say that I 100% recommend buying and playing Terraria.\t\t\t\n", "\n\r\n\t\t\t\t3,739 people found this review helpful687 people found this review funny\t\t\t\t6\n\n\n\n\n\n\nRecommended\n845.9 hrs on record\n\n\n\n\nPosted: 27 April, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe only bad thing about Terraria is that it ends.\t\t\t\n", "\n\r\n\t\t\t\t3,953 people found this review helpful290 people found this review funny\t\t\t\t34\n\n\n\n\n\n\nRecommended\n6,334.6 hrs on record\n\n\n\n\nPosted: 19 April, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've sunk 4500 hours into this masterpiece and have not regretted a single one, if you're looking for an awesome sandbox builder game mixed with epic bosses and worlds then this game is for you. ten stars out of five\t\t\t\n", "\n\r\n\t\t\t\t1,258 people found this review helpful174 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n153.2 hrs on record\n\n\n\n\nPosted: 16 May, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t8 years of free updates and countingCheap price of $9.99 and frequent salesHundreds of hours of gameplayA crap load of customization optionsAmazing mod supportTold Epic Games to go away when they tried to buy them outHow based can a developer get???\t\t\t\n", "\n\r\n\t\t\t\t956 people found this review helpful23 people found this review funny\t\t\t\t200\n\n\n\n\n\n\nRecommended\n1,787.1 hrs on record\n\n\n\n\nPosted: 21 December, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've never actually taken the time to write out a real review of a game, but this one absolutely deserves it.Terraria was my first ever game on PC and was the entire reason for me getting one. I had originally started playing the game on my Xbox 360, only to later beg my parents to buy me a computer so that I could play the 1.2 update. After that, I spent hours grinding through the game. It was shortly after my first time completing the game during 1.2 that I played the game again with friends. Though not a memorable experience in of itself, it did pave the way for those friendships to evolve further. Then we get to the release of the 1.3 update in the summer of 2015. I absolutely lost my sh*t for this update. For months my friends and I planned to play through the game again and spend time exploring all the new content. That was my first character that ever surpassed 100 hours of playtime. After that initial playthrough with my friends, I would periodically revisit the game on my own and with my friends for years. Sometimes there would be mods, sometimes it would be the original experience. Regardless of how I played, I never ever got bored with the game. I may only have 1600 hours across 6 years, but each one of those hours was spent in the game having a blast and completing my saves for each character I played on. With the Journeys end update coming out earlier this year, an update I have played through and through, I have finally managed to scrounge up the courage to say goodbye to this game. That doesn't mean that I'm going to stop playing it, that will never be a feasible option to me, especially with a game that has shaped my childhood. This review serves as a ode to an amazing game that has changed my life, as well as a way for me to cope with the game no longer receiving updates.I will forever thank the wonderful company of Re-Logic for an amazing product and the community that has surrounded the game for sharing such a novel game with me. Goodbye Re-Logic, and I look forward to future endeavors. Sincerely,Katie Dixon AKA KittoMen\t\t\t\n", "\n\r\n\t\t\t\t721 people found this review helpful249 people found this review funny\t\t\t\t35\n\n\n\n\n\n\nRecommended\n205.4 hrs on record\n\n\n\n\nPosted: 15 August, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOther developers: Promise to update their game, never update it.Terraria developers: Promise to stop updating their game, update it anyways.\t\t\t\n", "\n\r\n\t\t\t\t3,617 people found this review helpful134 people found this review funny\t\t\t\t7\n\n\n\n\n\n\nRecommended\n203.9 hrs on record\n\n\n\n\nPosted: 7 June, 2017\n You feel an evil presence watching you... This is the sort of game that you boot up thinking you'll spend an hour or two on, only to one day wake up face down on your keyboard surrounded by bottles and plates wondering where the past 3 weeks went. 100 hours in and I've still not defeated the current 'final' boss, something that's a mixture of the games' excellent difficulty curve, and a melancholy realisation that once I defeat him, my time with the game will naturally come to an end. Primarily, Terraria is a sandbox game. You appear in a new world with some basic equipment and no real instruction, eventually you will build a small house to survive the monsters that surface during the night, discover some form of corruption eating away at the world, encounter new NPCs and face off against powerful Boss enemies. Despite all this, you are given little direction, these are merely facets of a larger game that allows players to do as they wish, encountering all the world has to offer at mostly their own pace. Part of the great design behind the title is in the difficulty curve I mentioned earlier, meaning challenges pitted against a player start easy and steadily increase at a rate easy to handle. Although traditional RPG elements are largely absent, a discrete levelling system is present in the form of Bosses that have been defeated, meaning if you don't progress through these enemies then the gameplay doesn't become more difficult. In fact, the first boss doesn't spawn until you're suitably equipped with armour and health. My hours in the game are split roughly equally between single and multiplayer. Single player stands up on its own perfectly fine, but in my opinion the game is much more rewarding gathering some friends and working together to tackle the bosses, as the feeling of reaching new goals is shared, and the ammount of 'grinding' for materials is spread across multiple people. It also helps to appreciate the brilliant soundtrack, as if you voice chat with your group then spontaneous humming along loudly is to be expected. Enemy design is exciting and unique, with floating eyes, possessed suits of armour, giant robotic worms, and a ninja suspended in a giant ball of slime all making appearances. That being said, whoever on the design team is responsible for 'hellbats' has earned a special sort of hatred from myself...All in all Terraria is an amazing experience from beginning to end, its tone is humourous at times whist still provoking a feeling of wonderment and mystery in its exploration, and fearful excitement at its combat. It's a game I will come back to time and time again looking to recapture the memories I've made, and to forge new ones. It is a rare game in that with no shred of a doubt, these hours I have spent were not wasted. I heartily recommend that you purchase this game.  Fortune and glory kid...  \n", "\n\r\n\t\t\t\t796 people found this review helpful85 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n916.0 hrs on record\n\n\n\n\nPosted: 17 May, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAfter playing the game since 2011 I have just realized I have never left a review.Well...I have pirated the game and then I have bought game several times for myself, and several times as a gift for others.I have played the game solo, with friends, with my girlfriend and planning to introduce it to my daughters (who were born since the game launched).I have spent hundreds of hours on 1.0... hundreds of hours on 1.1... on 1.2... on  1.3... and planning to spend hundreds more on 1.4.I have built, fought, explored, created wild-life reservation worlds as well as apocalyptic wastelands... So I guess, it's not that bad game after all.\t\t\t\n", "\n\r\n\t\t\t\t913 people found this review helpful25 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n889.5 hrs on record\n\n\n\n\nPosted: 28 May, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHonestly, I don't know why Terraria has so many haters. This game literally has everything. Fun to play, tons of things to do, bosses to kill, ofc it has multiplayer so you can enjoy everything with friends, items to farm, a lot of stuff and decorations to build with, not to mention that if you hit the bottom and feel like you have completed the game, you can install some mods adding a crazy amount of new features, items, ect ...  When you're ingame (and I don't really know how to explain it) there's just something very chilling about it, maybe it's the music, maybe it's just every little detail about it. That's just how the game works. Perfect for chilling when you had a bad or exhausting day, but it's also the perfect entertainment for your free time. 10/10\t\t\t\n", "\n\r\n\t\t\t\t656 people found this review helpful27 people found this review funny\t\t\t\t3\n\n\n\n\n\n\nRecommended\n1,063.4 hrs on record\n\n\n\n\nPosted: 24 December, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSo, here's a simplified list of what you'll find in Terraria: - This is a 2D RPG with platformer and sandbox elements- It has an incredible amount of content to it- Multiple classes that are shaped through armor bonuses (but you can use other items not of your class)- Idk like a billion items? Lots of weapons, armor, cosmetics, and building material. It's crazy- A good healthy serving of cool and interesting bosses to fight- Lots of NPC's to buy stuff from (be ready to build basically a hotel for the like 30 of them in the game now)- Really good retro soundtrack but more modern, that fit the creative environments they pair with. Boss fight music gets you pumped! - Is it too easy for you? Try Expert mode! Don't feel like you're penalized enough for dying? Set your character to Hardcore!- I almost forgot to mention… SO MUCH CRAFTINGCons? Hmm.- Inventory management… the abundance of items will overwhelm you. I usually make a structure dedicated to storing all my loot in chests. Stay organized!- Fishing is pretty useful but… well it’s not exactly exciting. You can get some great stuff that way though.- Expect a big difficulty spike after defeating the boss in the Underworld! You’ll feel like a noob all over again, but once you work past it is where the game feels like it truly begins for me.- Some items in the game are pretty rare and some of these rares are used to craft or otherwise obtain some of the best loot in the game. Other thought: - If you can play with friends, or find people to run through the game with, do it. It's much more fun that way. You can still enjoy it quite a bit single player, however... it's not the same when you can't laugh when someone gets destroyed by a boulder trap.Story time (if you want to torture yourself and read my rambling):I bought this game ages ago, back when it was still in development, before any of the expansions and cleanups it's gone through. I spent $10 on this.Since then, the Dev team (at least back in 2014-2015 or so when I kept up with it) would post threads about once a month at the least to let people know what was planned/ the progress of the game. It kept getting updated, adding more content and mechanics. I remember being super excited when new weapon types were added, rare mounts were added. Accessories so your character can fly around the map? Gimme. Something I always admire too is Re-Logic did not simply focus on adding more stuff end game, they kept polishing up early game too, adding things like Ropes to make things easier until you get hookshots, simple versions of weapons you find later like Spears, wooden yo-yo, more early game magic items. It used to be a much less enjoyable, slower grind to get to mid game content where the pace picks up.There were at least a couple times where the development with the game was supposedly going to halt, and I was satisfied with it then. I'd gotten more content and enjoyment out of Terraria than most games I'd bought for $30 or more. Yet somehow, maybe a year after hearing nothing, a new content update would surprisingly be pushed out. This happened at least twice, when I thought it would be laid to rest as is. I spent $10 on this.\t\t\t\n"]