["\n\r\n\t\t\t\t1,102 people found this review helpful381 people found this review funny\t\t\t\t53\n\n\n\n\n\n\nRecommended\n329.3 hrs on record\n\n\n\n\nPosted: 14 September, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t>plays survivor>killers seem overpowered>plays killer>survivors seem overpowered\t\t\t\n", "\n\r\n\t\t\t\t1,184 people found this review helpful632 people found this review funny\t\t\t\t96\n\n\n\n\n\n\nRecommended\n623.2 hrs on record\n\n\n\n\nPosted: 16 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDo you hate yourself? Buy this game. You'll learn to hate everyone else so much more.\t\t\t\n", "\n\r\n\t\t\t\t960 people found this review helpful126 people found this review funny\t\t\t\t363\n\n\n\n\n\n\nRecommended\n772.9 hrs on record\n\n\n\n\nPosted: 25 June, 2020\n While I generally love this game, I have a few warnings to those who are interested in buying it.   The community can be toxic as hell. There's three basic types of toxicity.   New players who are uninformed (not your fault) who do things the community considers bad manners.  Experienced perfectionists.  People who enjoy other's suffering.   Higher learning curve than some expect.    Learning survivor and killer perks is important regardless of what you main.  Common tactics to avoid getting downed or looped.  Prioritization/situational awareness. Where is everyone, what are they doing, what should you be doing?.  Community slang.   Matchmaking leaves a lot to be desired.    Inexperienced paired with experienced... but in a \"one gets dunked on\" arrangement, not teaching.  Sometimes (often) seems to be under the influence when making lobbies.  wait.... ...... .............. .......................................... ....... times............................. ....... ............. ........ .... .....   HOWEVER, there's some pretty nifty things....    DLC characters can be unlocked through gameplay.   It takes 9000 iridescent shards, which are gained through leveling one's account up.  The Shrine of Secrets changes every week, and potentially has perks from DLC characters available.   Folks who can't afford DLC can still get the characters & perks.   Friends not required but make experience better.   No in-game voice chat for survivors, some use Discord instead.   In-game emotes used to communicate, as well as crouching.   Relatively easy to find new friends if you're nice, most people who play survivor want full SWF crews.   Replayable   Wide variety of maps, characters, perks.  Opportunity for a wide variety of play styles.  Private or public matches for whatever your purpose, including goofing off.   Lots of shenanigans   Get waterboarded by puke  Throw a flashlight rave  Thiccness knows no morals or gender  Overall, I'd recommend. Probably about a 8.5/10. Have not pooped my pants due to this game but have come close a time or two. Thanks, Ghost Face.---------------------------------------UPDATE (May 28 2021):  New content is still being released!   More mechanics are being added to the game, which changes how survivors play. Ex: Zombies being added in the R.E. chapter (in Player Test Build at the time of this update).   Some cosmetics can be purchased with shards, unlocked through game-play, or redeemed via codes released by BHVR.  Periodic events. Currently, there's an event to find Gnome Chompski once the exit gates are powered.    Map and graphical updates.   The game generally looks a lot better now.  Multiple variants of maps.  Maps tend to be smaller now, which can be both good and bad. Gens feel closer together but that also applies to hooks.    The Rift   A battle pass has been added to the game.  Auric cells (paid currency) are part of the reward system- if you complete the Rift you actually get your money back!  Players are rewarded with cosmetics, lore (The Archives), and various forms of in-game currency.   Challenges from the Rift add an extra layer of fun (or psychological distress and anguish) to matches.    Matchmaking... Again   Queue times are substantially faster for survivors in the morning than in the afternoon/evening.  I'm a filthy survivor main heathen, so I can only assume that means killer queue times are better in the afternoon/evening.   Still occasionally end up in lobbies that are very unbalanced or entirely unfair, but it's better than it used to be.   There's a lot more player consistency in terms of skill, but also toxicity, in higher ranks.   If you want to meme and enjoy, the higher ranks tend to be very serious...    HIT BOXES MAKE ME CRY.   This is just a game.  Please, self... It's just a game...  Sobbing intensifies.  In all seriousness though, the hit boxes need some improvement. Lag, frame-perfect timing, and other aspects all influence whether the hatchet hits your face or clips through your face.   I may be a survivor main, but if a Huntress nails me across the map, I'm impressed with the shot and outraged on the killer's behalf if it doesn't register.    What accessibility options?   Changing the struggle phase on hook to a series of skill checks was a huge improvement in terms of accessibility for wider audiences.   An option to suppress screen flashing effects or toggle an alternate view for them would be helpful. A fade-in, solid color, then fade-out screen aura might be a good option for this? It would preserve visual information without giving an 'unfair advantage' to players.  For the record, players with disabilities just wanna grind for bloodpoints and cry like everyone else. If your primary concern is giving players an 'unfair advantage,' please remember that accessibility options compensate for a set-back so that people with disabilities have an even playing field.  I'd say that the changes boost my rating to a 9/10, but the hit box issues can definitely make this game feel like a 2/10.To BHVR, if they ever stumble their way into this review: The new content is great but please look into hit registration and hit boxes. Accessibility options for a wide range of players would also be highly appreciated and it would increase audience reach and profitability. Keep up the good work.---------------------------------------UPDATE (April 21 2022):  Some mentions.   Boon totems were added (AoE survivor buffs).  Experimental wiggle mechanic (skill checks instead of button-mashing).  Hit boxes are still whack; the game is playable if you're in it for memeingful, not meaningful, gameplay.  Most of my points from previous updates still stand.  Cross-play was added (can be disabled).  Matchmaking is now skill-based, leaving ranks obsolete. There's still grades based on pips, but these have no influence on a person's actual MMR.    Content.   It doesn't feel like in-game content has changed substantially.   New killers and survivors have been added...  But I rarely see them, or their perks, after a couple of weeks pass.   Cosmetics are nice, but ultimately, they're just something to collect.   The Stranger Things chapter is gone.  I'm out of characters, so no more updates unless something drastic happens and I delete old points. Overall, 7/10. Fun but flawed.\t\t\t\n", "\n\r\n\t\t\t\t1,341 people found this review helpful148 people found this review funny\t\t\t\t29\n\n\n\n\n\n\nRecommended\n676.0 hrs on record\n\n\n\n\nPosted: 14 June, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOut of all the reviews I wrote, This one is probably the most serious one I wrote. For starters the community of this game sucks just like every online game, You don't wanna talk to them because they're all just jerks who wanna say you suck or you camped or blah blah blah, its rare to get a nice compliment out of people in this game.But you don't have to talk to the community either. Unlike most online games this one doesn't have a mic system so you don't have to worry about hearing a twelve year old cry baby raging at you for nothing. Only time you can talk to people in the game is in the beginning before the match starts if your a survivor and at the end after the match is over as both killer and survivor, The end chat is the only one the killer can talk to everyone in the match though. Mostly just to say GG for Good Game.As Survivor you can basically just play every man for himself and be sneaky and say screw you to the other players or you can try to be a good team mate and rescue them if they get on a hook but if someone is a jerk in the chat before the match then you know who not to save if they get hooked. I mostly play killer because I find it more fun than playing survivor and someones gotta play killer and from what I hear most people enjoy playing survivor more. Probably becuase as survivor it feels like a horror game and you get team mates while as killer you're by yourself.But what i'm really trying to say is this game is really great even though the community sucks, Just ignore the community and if you get someone who is raging at the end just say gg to them and leave. After seeing that they didn't make you argue with them and waste your time it might make them even more mad even if you got the last word aka GG. So I give this game a 8/10. I wonder if anyone actually read this review, I actually had to take my time to write this because I didn't wanna swear in it so you didn't see nothing but censor hearts that steam likes to do. So if you actually read this let me know by leaving a comment so I can be like someone read this peice of crap review yay!\t\t\t\n", "\n\r\n\t\t\t\t4,901 people found this review helpful849 people found this review funny\t\t\t\t530\n\n\n\n\n\n\nNot Recommended\n10,740.2 hrs on record\n\n\n\n\nPosted: 4 October, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe game has a lot of potential but is ran by people that don't have a vision and only care about themselves and what they think is best for the game.I have played since 2016 Beta and have more than 10,000 hours of actual playtime on this (my personal account) and previously worked at BHVR on the game. If this was years ago.. I would have recommended the game without any question. However, with the game's current state and direction, I could never recommend it to anyone under any circumstance.It's just going downhill and that's the reality of it. They are partnering with anyone in an attempt to stay relevant and keep quarterly stats up but that only lasts for a week and then it's back to being a dead game for the most part.If you ever decide to work at this company, just note that your personal account is at high risk of being permanently banned if you are accused of anything and are wrongfully terminated as a result.They will not only ban your dev account (which is fine) but your personal account as well, which is actual bullsh*t and petty. I'm living proof of this.They won't conduct a proper and thorough investigation behind their claims before terminating an employee and will sh*t all over your 6-years of dedicated gameplay, time spent and work into a product that you once loved and cared for to the point that you even took a job to work on the game to make it better not just for yourself but for the community who also loves the game.Clueless company making clueless decisions on a game that they're clueless about since they don't play it.I was one of the literal few at the company who has more than 4,000 hours of actual gameplay in the game.P.S. they still haven't fixed the IP leak vuln that has been the cause of people being DDoSed, doxed, swatted and much more. They've known about it for over 2 years now and refuse to fix something so simple while knowing what the root cause of it is and know what exactly to fix.Just to give you an idea of how little they care... I brought this up before and during my time working there and it was never fixed. We're now going into 2023 with this vulnerability that's been in the game for over 4+ years.Still think BHVR cares about you now? Their main focus is and always has been to make money and that's why this issue has never been addressed even though their own Fog Whisperers like Otzdarva, Elix and many others have questioned why they haven't fixed it yet and are victims to these issues.Their priorities are all over the place and have no idea how to run a game company let alone keep the community safe. It's pretty evident that these are the facts.They would rather ban innocent people than to solve the huge security risks and flaws in the game. It's disgusting and this type of \"behaviour\" should not be condoned.I'm more surprised Valve/Steam is even allowing the game to remain playable on their platform considering the company refuses to fix these issues that is allowing these events take place.Cheaters? I won't get into that. Everyone knows the answer to this already. The company looks at them as paying customers that deserve respect (direct quote from an employee that's in a leadership role btw) and would rather keep them around than get rid of them entirely.-Safety Depips / Beast / Antiddos\t\t\t\n", "\n\r\n\t\t\t\t861 people found this review helpful203 people found this review funny\t\t\t\t37\n\n\n\n\n\n\nRecommended\n230.5 hrs on record\n\n\n\n\nPosted: 26 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you hate your life, this game is for you.\t\t\t\n", "\n\r\n\t\t\t\t2,298 people found this review helpful86 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n704.7 hrs on record\n\n\n\n\nPosted: 20 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDisclaimer: I survivor main. I play games for fun, not for competition, so the DBD community doesn't really get to me. If I get a bad killer that face camps, oh well. I die and move on to the next game. If I get a good killer who finds me immediately, hooks me (bc I can't juke whoops), and then patrol camps (which I'm 100% OK with), then no biggie. Next game please~I think a lot of the community salt from killers comes from dealing with rank one survivors that don't actually play the game properly and just run around and flash the killer in the face. And while that is a legitimate strategy, it takes away from the fun of the game in my opinion.As a killer (a horrible one), I've also been called names by survivors who tell me to 'get gud.' Older players ruin it for newer players or players who don't put in 1000s of hours. Just relax and have fun with the game! So what if you don't pip up - there is always the next game :)That being said, this game is crazy fun. Don't let the saltiness of the community keep you from buying the game. Grab it, have fun with it, and ignore anyone who might give you a hard time ;) And don't fixate too much on the ranking process unless you're absurdly highly competitive for some reason (also fine - just try not to let it push you into spouts of anger!), and even then, recognize that there are jerks who play this game, like any other game, and have fun while you compete!\t\t\t\n", "\n\r\n\t\t\t\t620 people found this review helpful262 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n2,128.1 hrs on record\n\n\n\n\nPosted: 22 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI log on play a match get pissed log off, repeat this process, then hate my life 10/10 game\t\t\t\n", "\n\r\n\t\t\t\t390 people found this review helpful142 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n5,305.8 hrs on record\n\n\n\n\nPosted: 14 December, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvery difficult to determine if you're having fun or not\t\t\t\n", "\n\r\n\t\t\t\t644 people found this review helpful327 people found this review funny\t\t\t\t42\n\n\n\n\n\n\nRecommended\n1,123.8 hrs on record\n\n\n\n\nPosted: 16 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProbably about half of my play time is dedicated to queuing for a match\t\t\t\n"]