["\n\r\n\t\t\t\t2,182 people found this review helpful72 people found this review funny\t\t\t\t76\n\n\n\n\n\n\nNot Recommended\n587.1 hrs on record\n\n\n\n\nPosted: 4 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have been playing BF games since back in 2003, when you had to go and buy them from the game shop down the town center. They came on a CD/DVD. BF2 & Special Forces were fantastic games.I bought this game about 1 month or so ago now, was really looking forward to it, until I played in a match with more hackers than there were normal players!!!!Every single game on a DICE server has a hacker or 2 or more on it!! You go to the EA forums and post about it and they advise to use the in-game reporting method - so you do that, and yet, after 1 month, the same hackers are STILL PLAYING the game. So you go back to the forum, post about it again, and EA shut down your post and mark their spam post as the solution to your post, even though they haven't answered anything properly - They then tell you they do not allow posts about anti-cheats or cheating on teh AHQ FOrum - Really? Is that because you know you are useless at stopping it EA??It's for this reason alone I give this game a thumbs down, if it wasn't for all the hackers and EA's lack of care about getting ird of them it would be a good game!\t\t\t\n", "\n\r\n\t\t\t\t532 people found this review helpful109 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n76.8 hrs on record\n\n\n\n\nPosted: 19 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBF2042 makes this look good, even in 2023.\t\t\t\n", "\n\r\n\t\t\t\t1,103 people found this review helpful55 people found this review funny\t\t\t\t114\n\n\n\n\n\n\nNot Recommended\n54.0 hrs on record\n\n\n\n\nPosted: 29 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlagued by hackers, almost no oceania community, devs don't care, hackers are so well known that players recognize them by name but they still haven't been banned. Lazy.Edit: Wow this review got a lot more publicity than I expected! That being said, now that I've played a bit more I'd like to revise my initial thoughts. Battlefield V has the hallmarks of a good game, the bullet ballistics are good, team work and strategy is good, the graphics and cool WW2 weaponry are good. But all this is over-arched by critical flaws that I'm guessing were the result of EA deciding this game wasn't likely to be as profitable as they were expecting. Customization feels lacking at best with a lot of cosmetic items being really boring or really expensive to encourage the use of in game currency. Weapon customization has similar problems with only a few \"specializations\" for each weapon, mostly making it magically have less recoil or reload faster among other uncreative things. The most critical flaw this game suffers is the complete abandonment by the developers. They obviously knew their time wouldn't make them money and decided to leave the game in a state that feels late beta at best. There's a lot of controversy in the comments about me saying the game is plagued by hackers but I stand by this statement. It's been abandoned, players don't get banned, reports don't get answered. If you want to play the game despite these flaws because you like WW2 or the Battlefield series, there's definetly fun to be had but heres a few tips:* Avoid official servers: that's right, the official servers receive seemingly 0 maintenance and manually administrated servers are massively more effective at banning hackers than the official servers. EA you should be ashamed.* Consider avoiding if you live in a remote area: In Australia today I was able to find just 1 conquest server with 40 players and able to at least play the game (10AM on a Wednesday). I really can't guarantee that there will be any player base if you live somewhere more exotic than Australia, USA and Europe are probably okay. Don't count on being able to find a server if you're a night owl like me.Overall this game had a lot of potential but it stands as a hollow shell of what it could have been. I liked the inclusion of female characters and being able to play as someone who I felt more of a connection to but the amount of hostility EA showed towards their player base was uncalled for and instead of making up for it they took the money and ran.\t\t\t\n", "\n\r\n\t\t\t\t1,786 people found this review helpful383 people found this review funny\t\t\t\t157\n\n\n\n\n\n\nNot Recommended\n31.4 hrs on record\n\n\n\n\nPosted: 28 July, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBuy it if you like getting shot through walls from across the map. Hack city. Spent more money on the profanity filter than the anti cheat.\t\t\t\n", "\n\r\n\t\t\t\t288 people found this review helpful6 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nNot Recommended\n16.4 hrs on record\n\n\n\n\nPosted: 7 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tModerators BANING people, locking threads and DELETING them just for mentioning the cheating problem here in steam forums XDProof:https://i.imgur.com/pS16BmF.jpgThis is pretty funny since EA is clearly on damage control, you get one cheater in 80% of the lobbies, don't even think about buying this game.They don't care about it, cheaters can crash lobbies, dox your IP and do a lot of weird stuff.This negative review is thanks to the moderator who removed my thread for \"naming and shaming when i really didn't do any of it, and neither anybody in the posts below.Proof:https://imgur.com/a/7G6FVf6Hope it was worth it Mr. Moderator.Edit: I have been banned from the forums now for this XDDDD This is hilarious.https://i.imgur.com/dTWHR0H.jpgEdit: After banning me they removed my comment in another thread exposing this BS.Proof: https://i.imgur.com/LXzdWaU.pngKeep digging, this company is trash.\t\t\t\n", "\n\r\n\t\t\t\t342 people found this review helpful8 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nNot Recommended\n250.0 hrs on record\n\n\n\n\nPosted: 11 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe game is a blast when there are no people using exploits. Some days you cant play a game without changing servers multiple times to get around the people loading cheat software to aimbot you. I have had several matches where a single soldier will lock down our entire team at the spawn with a head seeking MG and the developer doesnt really seem to do anything about it. Not even a vote kick feature let alone the most basic of anti cheat software. How hard is it to do some captures when someone has a K/D of 50+ to 0?\t\t\t\n", "\n\r\n\t\t\t\t425 people found this review helpful211 people found this review funny\t\t\t\t31\n\n\n\n\n\n\nRecommended\n13.9 hrs on record\n\n\n\n\nPosted: 28 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlease remove battlefield 2042 from my account. I don't even need the refund\t\t\t\n", "\n\r\n\t\t\t\t326 people found this review helpful82 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n57.7 hrs on record\n\n\n\n\nPosted: 24 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPre Bf 2042 = Let down of a gamePost Bf 2042 = Maybe I treated you too harshly...\t\t\t\n", "\n\r\n\t\t\t\t1,507 people found this review helpful217 people found this review funny\t\t\t\t71\n\n\n\n\n\n\nNot Recommended\n99.9 hrs on record\n\n\n\n\nPosted: 2 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWhen you spend more money on Censoring the game chat then the anti-cheat\t\t\t\n", "\n\r\n\t\t\t\t279 people found this review helpful33 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nNot Recommended\n21.0 hrs on record\n\n\n\n\nPosted: 3 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPLENTY OF CHEATERS, DO NOT RECOMMENDBETTER GO BUY MOM SOME FLOWERS\t\t\t\n"]