["\n\r\n\t\t\t\t2,496 people found this review helpful65 people found this review funny\t\t\t\t276\n\n\n\n\n\n\nNot Recommended\n0.1 hrs on record\n\n\n\n\nPosted: 17 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRequires you to disable HVCI which protects your kernal memory from having malicious code inserted. I wouldn't recommend playing this game, there is no reason to force you to disable this function unless you were trying to do something malicious.\t\t\t\n", "\n\r\n\t\t\t\t1,318 people found this review helpful37 people found this review funny\t\t\t\t82\n\n\n\n\n\n\nNot Recommended\n1.3 hrs on record\n\n\n\n\nPosted: 27 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRequires you to disable HVCI which protects your kernal memory from having malicious code inserted. I wouldn't recommend playing this game, there is no reason to force you to disable this function unless you were trying to do something malicious.\t\t\t\n", "\n\r\n\t\t\t\t478 people found this review helpful228 people found this review funny\t\t\t\t24\n\n\n\n\n\n\nRecommended\n515.0 hrs on record\n\n\n\n\nPosted: 12 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsuper fun but please region lock this game LMAO, absolutely tired of fighting 冰淇淋 w 500 ping and getting focus attacked w a golden katana before i even know hes near me\t\t\t\n", "\n\r\n\t\t\t\t2,241 people found this review helpful214 people found this review funny\t\t\t\t190\n\n\n\n\n\n\nRecommended\n18.4 hrs on record\n\n\n\n\nPosted: 7 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe anti-cheat is Chinese spyware, if u have installed it make sure to delete it from your system 32. Anything that is has \"naec\" in the file name delete it right away.\t\t\t\n", "\n\r\n\t\t\t\t409 people found this review helpful488 people found this review funny\t\t\t\t61\n\n\n\n\n\n\nRecommended\n41.5 hrs on record\n\n\n\n\nPosted: 27 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game turns into a survival horror when you encounter an asian player\t\t\t\n", "\n\r\n\t\t\t\t351 people found this review helpful388 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n21.1 hrs on record\n\n\n\n\nPosted: 2 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPros:Fun CombatBig Mommy MilkersCool cosmeticsUnique BRCons:猫驱逐舰 will delete you in 2 seconds. \n", "\n\r\n\t\t\t\t1,493 people found this review helpful85 people found this review funny\t\t\t\t97\n\n\n\n\n\n\nNot Recommended\n60.2 hrs on record\n\n\n\n\nPosted: 24 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI played 60 hours of this game, only to get permanently falsely banned for \"cheating\". Little known fact was they were giving out broom skins to people who got others banned successfully, so I feel I got targeted for winning a match against a salty person. I had all my VODs on my channel of all my gameplay, and yet the support team did nothing to get it figured out. I sent multiple emails, and in game support tickets, including my channel so they could review it if they wanted. I was in the Discord channel asking for assistance as well. I had all the proof I didn't cheat. I had countless hours of gameplay on my channel, yet they didn't care.  I spent over $200 on items ingame, as well as buying the game. Don't spend money on this game. If you get wrongfully banned, they will not help you, or even consider reversing the ban. I thought the wrongful ban thing was a very very rare occurrence, however it feels different when it happens to you. Would not recommend this game to anyone. If you get invested into it, you will want to spend money. It's fun, but the support team will screw you if you happen to have any issues. Not to mention the VPN abusers & awful Qeue times.\t\t\t\n", "\n\r\n\t\t\t\t713 people found this review helpful34 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n77.3 hrs on record\n\n\n\n\nPosted: 24 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmake free to play so it can be big\t\t\t\n", "\n\r\n\t\t\t\t573 people found this review helpful110 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nNot Recommended\n38.8 hrs on record\n\n\n\n\nPosted: 27 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game was so much fun but it's borderline unplayable a lot of the time due to no region lock. You get a lot of players from china playing on NA servers and they're basically untouchable due to ping. I genuinely think this game has fantastic game play and the characters and customization are top notch but spawning and dying to untouchable Chinese players every match just ruins the experience no matter how much I try to enjoy it. Not worth until they region lock the game or unless you want maybe a few hours of fun until you run into 我操你妈 every game and die to reasons out of your control.\t\t\t\n", "\n\r\n\t\t\t\t192 people found this review helpful155 people found this review funny\t\t\t\t11\n\n\n\n\n\n\nRecommended\n14.8 hrs on record\n\n\n\n\nPosted: 13 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tall fun and games until 前將軍 pulls up\t\t\t\n"]