["\n\r\n\t\t\t\t526 people found this review helpful247 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n27.4 hrs on record\n\n\n\n\nPosted: 26 May, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tRaided a crack house, arrested the perps, saved a hostage, hostage pulled out a phone, thought they were pulling a gun, no hostage anymoreVery immersive.9/10\t\t\t\n", "\n\r\n\t\t\t\t2,482 people found this review helpful4,042 people found this review funny\t\t\t\t573\n\n\n\n\n\n\nRecommended\n127.2 hrs on record\n\n\n\n\nPosted: 9 February, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tGot jumpscared by a super loud shotgun bang.I panicked and opened fire roughly around the area where the sound was coming from.Shot 3 civilians and the suspect.Lost an officer.Case closed.Got fired from my job as a SWAT operator.Went home and played Ready or Not.\t\t\t\n", "\n\r\n\t\t\t\t1,235 people found this review helpful176 people found this review funny\t\t\t\t32\n\n\n\n\n\n\nRecommended\n72.2 hrs on record\n\n\n\n\nPosted: 12 December, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThe only game where the bots can be truly unpredictable instead of moving like vegetables.\t\t\t\n", "\n\r\n\t\t\t\t1,180 people found this review helpful875 people found this review funny\t\t\t\t82\n\n\n\n\n\n\nRecommended\n20.2 hrs on record\n\n\n\n\nPosted: 23 May, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tKick in a door, shoot a drug dealer, save a hostage. Then go home and play some ready or not\t\t\t\n", "\n\r\n\t\t\t\t2,843 people found this review helpful3,415 people found this review funny\t\t\t\t692\n\n\n\n\n\n\nRecommended\n1.4 hrs on record\n\n\n\n\nPosted: 16 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot jumpscared by a super loud shotgun bang.I panicked and opened fire roughly around the area where the sound was coming from.Shot 3 civilians and the suspect.Lost an officer.Case closed.Got fired from my job as a SWAT operator.Went home and played Ready or Not.\t\t\t\n", "\n\r\n\t\t\t\t744 people found this review helpful521 people found this review funny\t\t\t\t54\n\n\n\n\n\n\nRecommended\n60.5 hrs on record\n\n\n\n\nPosted: 5 September, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tPlay solo for tactical.Play with mates for police brutality.\t\t\t\n", "\n\r\n\t\t\t\t958 people found this review helpful13 people found this review funny\t\t\t\t72\n\n\n\n\n\n\nRecommended\n46.7 hrs on record\n\n\n\n\nPosted: 19 December, 2021\nEarly Access Review\r\n\t\t\t\t\t\t\t\tLook, I am not exaggerating here when I say this but, Ready or Not is genuinely one of the most thrilling, nerve-wrecking, exciting and best games I have played so far this year. For someone like me that grew up playing SWAT 4 pretty much every day after school on my dad's old Dell PC this game brings back a lot of nostalgia for me which makes it even better. I think I speak for all of us that played SWAT 4 when I say we have all been waiting and seething for a similar title that can scratch that itch - Ready or Not does just that. The game is fantastic in every single aspect. I also love how punishing and difficult it can be at times. The margin for error is very small, which just adds to the realism. The game very much fits the \"Early Access\" model at this current state and content is neither here nor there in my book. At the moment there are currently 6 vastly different maps, a hotel, a gas station, a crack house, a port, a farm and a car dealership. All 6 of aforementioned maps are beautifully crafted with the visuals immediately immersing you in the world you are playing in. The sound design is awesome as well, might I add. The sound of explosions, flashbangs, the guns, they sound and feel impactful, something even AAA studios fail to replicate at times. The AI are either good or straight up stupid at times, they are definitely the one thing that needs the most work. But I find that most of the time they do work relatively fine. I hope to see the implementation of achievements - which would be cool to grind for/incentivise us to play - and more customisation - that stays true to real life, of course, Jesus forbid we get another RS6 - and potentially more weapons to fool around with. The game comes in expensive at around 35 bucks but if you are looking to get your tactical shooter fix, Ready or Not will do just that for you.\t\t\t\n", "\n\r\n\t\t\t\t509 people found this review helpful244 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n40.4 hrs on record\n\n\n\n\nPosted: 5 March, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tcaught a terrorist wearing a bulletproof vest, a respirator, a kevlar helmet, and carrying an auto-shotgun inside of a hotel who was holding 2 unarmed innocent people hostage. Successfully disoriented them with a stun grenade and had them captured. As they were handcuffed they yelled \"I want to talk with a lawyer\"i love this gameEDIT: i just had a game where a woman got ziptied, she said \"My arm doesn't bend that way, ♥♥♥♥♥♥♥\" and the swat guy that cuffed her said \"Just doing my job sir\"this games gonna kill me\t\t\t\n", "\n\r\n\t\t\t\t3,820 people found this review helpful2,298 people found this review funny\t\t\t\t200\n\n\n\n\n\n\nRecommended\n4.5 hrs on record\n\n\n\n\nPosted: 16 November, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tHe had a gun, I swear.\t\t\t\n", "\n\r\n\t\t\t\t1,116 people found this review helpful593 people found this review funny\t\t\t\t92\n\n\n\n\n\n\nRecommended\n117.7 hrs on record\n\n\n\n\nPosted: 9 May, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tI was given the freedom to taze a child, 10/10\t\t\t\n"]