["\n\r\n\t\t\t\t1,849 people found this review helpful93 people found this review funny\t\t\t\t97\n\n\n\n\n\n\nRecommended\n4,622.8 hrs on record\n\n\n\n\nPosted: 15 November, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI'm 64; this is my first RPG. It's great. Certainly not intuitive for a guy that's never played anything like this, but I relished the challenge. I had no idea what I was doing at first: I died many times, and progressed slowly. Used Google for UESP for game info, and that helped tremendously. I made it to Level 83, sort of ran out of things to do, so created a new character, and am playing it differently. I'm a Stormcloak this time around. Enjoying my second go round immensely!\t\t\t\n", "\n\r\n\t\t\t\t1,748 people found this review helpful21 people found this review funny\t\t\t\t309\n\n\n\n\n\n\nRecommended\n0.8 hrs on record\n\n\n\n\nPosted: 25 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOriginal versions here if you want to get it due to it being hidden on the steam store.https://store.steampowered.com/app/72850/The_Elder_Scrolls_V_Skyrim/https://store.steampowered.com/app/220760/The_Elder_Scrolls_V_Skyrim__Hearthfire/https://store.steampowered.com/app/226880/The_Elder_Scrolls_V_Skyrim__Dragonborn/https://store.steampowered.com/app/211720/The_Elder_Scrolls_V_Skyrim__Dawnguard/https://store.steampowered.com/app/202485/Skyrim_High_Resolution_Texture_Pack_Free_DLC/ \n", "\n\r\n\t\t\t\t3,432 people found this review helpful78 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n0.3 hrs on record\n\n\n\n\nPosted: 6 March, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you want the original Skyrim game + DLCs,Steam and Bethesda keeps it hidden here:https://store.steampowered.com/app/72850/The_Elder_Scrolls_V_Skyrim/and the DLCs here:https://store.steampowered.com/app/220760/The_Elder_Scrolls_V_Skyrim__Hearthfire/https://store.steampowered.com/app/226880/The_Elder_Scrolls_V_Skyrim__Dragonborn/https://store.steampowered.com/app/211720/The_Elder_Scrolls_V_Skyrim__Dawnguard/https://store.steampowered.com/app/202485/Skyrim_High_Resolution_Texture_Pack_Free_DLC/ \n", "\n\r\n\t\t\t\t1,143 people found this review helpful36 people found this review funny\t\t\t\t94\n\n\n\n\n\n\nRecommended\n8.0 hrs on record\n\n\n\n\nPosted: 7 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI have now purchased skyrim 5 separate times...And If you want the original Skyrim game + DLCs,Steam and Bethesda keeps it hidden here:https://store.steampowered.com/app/72850/The_Elder_Scrolls_V_Skyrim/https://store.steampowered.com/app/220760/The_Elder_Scrolls_V_Skyrim__Hearthfire/https://store.steampowered.com/app/226880/The_Elder_Scrolls_V_Skyrim__Dragonborn/https://store.steampowered.com/app/211720/The_Elder_Scrolls_V_Skyrim__Dawnguard/https://store.steampowered.com/app/202485/Skyrim_High_Resolution_Texture_Pack_Free_DLC/ \n", "\n\r\n\t\t\t\t1,474 people found this review helpful833 people found this review funny\t\t\t\t109\n\n\n\n\n\n\nRecommended\n348.0 hrs on record\n\n\n\n\nPosted: 6 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti dumped sven's body in a river and found him in eastmarch 10/10\t\t\t\n", "\n\r\n\t\t\t\t1,977 people found this review helpful89 people found this review funny\t\t\t\t278\n\n\n\n\n\n\nRecommended\n312.4 hrs on record\n\n\n\n\nPosted: 6 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThanks, Bethesda. I spent 2 months fine tuning my mods and you ruined it all with this ♥♥♥♥ money grabber update.Edit: I've found a way to downgrade to 1.6.640 so mods will work againStep 1: Press Win + R and type in steam://open/consoleStep 2: Type in these commands. Make sure you type in the next command after the previous one finished downloadingdownload_depot 489830 489831 3660787314279169352download_depot 489830 489832 2756691988703496654download_depot 489830 489833 5291801952219815735Step 3: Move all the files into your Skyrim root folder. Do it in this order: 489931, 489832, 489833.Steo 4: Do to the Skyrim data folder and delete these files. It's for the ♥♥♥♥♥♥ market place crap and will mess with LOOTMarketplaceTextures.bsa_ResourcePack.bsa _ResourcePack.esl.Step 5(Very important step or your game will ctd every time): Use whatever sex mods you have and have an orgy with Lydia, Serana, Aela, and Mjoll.Bonus: As a ♥♥♥♥ you to Bethesda, go to Steam/steamapps and set appmanifest_489830.acf to read only so Steam won't force the updates. Be sure to do this again if Steam updates.\t\t\t\n", "\n\r\n\t\t\t\t907 people found this review helpful469 people found this review funny\t\t\t\t167\n\n\n\n\n\n\nRecommended\n1,139.8 hrs on record\n\n\n\n\nPosted: 30 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThings I've Done in Skyrim (In no real order):-Got married-Adopted six kids-Built a mansion for my family-Adopted a bunch of dogs-Learned I was Skyrim Jesus-Used my Skyrim Jesus powers to slay dragons and save the world-Became a Warewolf-Cured a ghost of his warewolfism-Became a vampire hunter-Promptly abandoned the role of vampire hunter because the vampires gave me cooler stuff-Betrayed the vampires and gained the ability to summon a skeleton horse and a zombie dragon-Joined an organized crime syndicate-Killed the leader of said syndicate after selling my soul to an evil god-Joined a hitman cult-Cuddled a ghost-zombie lady in a casket-Killed a burnt chicken-nugget with a demon dagger-Killed the Emperor-Killed the man who asked me to kill the Emperor-Was paid 30000 coins after killing the man who paid me to kill the Emperor-Never spoke with my hitman friends again because the Ghost-Zombie's voice was really loud-Went to college-Was chosen by space wizards to save the college-Found flying magic ball-Killed people trying to use the flying magic ball for bad things-Became headmaster of the college-Joined the blue team-Thought it would be funny to join the red team after killing their leader, so I switched sides-Crushed the blue team after bringing the new red team leader a pointy hat-Saved a tree-Was pulled into gooey world by another Skyrim Jesus-Killed the other Skyrim Jesus because there can only be one-Stole a horse that a guy sold to someone else without actually owning the horse in the first place-Killed the dude who I stole the horse for because I wanted the horse-Killed a lady who I walked past on the road for using \"milk-drinker\" as an insult. Milk is good-Chilled with a bunch of hunters in a hot spring-Got drunk-Started multiple bar fights-Helped two lizards get married-Helped the mad hatter with his tea party-Spawned 1000 coins and threw them in the river because I wanted to see where they'd end up-Blackmailed a LOT of people. Like... a LOT-Killed multiple guards because they treated sweet roll theft as a laughing matter-Walked onto the stage during a beheading because I wanted a dude's necklace-Was chased for walking on stage during a beheading-Gave money to the poor (After throwing 1000 coins in the river)-Killed a man on the road and threw him in the river because I wanted to see where he'd end up-Killed multiple innocent animals because I saw them and knew I could-Reunited a Scooby with Shaggy-Gave Vorstag a lot of fireball scrolls-Regretted giving Vorstag fireball scrolls-Stole every book from the College library because my library at home felt empty-Stole every book I found because I quickly gained an obsession-Became addicted to drugs-Became a bard-Downloaded a mod because becoming a bard wouldn't let me sing-Got arrested for singing \"Age of Oppression\" in the Blue Palace-Broke out of Prison multiple times-Became a heavy drinker-Made the Constance regret letting me adopt children-Killed a horse and threw it in the river because I wanted to see where it ended up-Got a mod that makes Unrelenting Force 700% stronger-Started Skyrim's first Space Program-Lead people to Giants so I could watch them get beat over the head with a club-Told kids I'd play tag with them and then left-Told one kid she could have a mudcrab, but told my son he couldn't have one-Told my kid I had a gift for her but then gave her nothing because they need to learn disappointment early-Cooked food for my family and actually set up the table with plates, cups, forks, spoons, bowls and jugs of milk-Gave Vorstag some food and then ate the rest in front of my kids-Gave my kids 1000 gold-Filled my basement with skooma-Collected bug jars-Became wanted in every hold at once for the same crime-Bought Khajiit's wares-Installed nearly 100 mods-Am still installing mods-Will never stop installing modsIs this what you intended, Todd? \n", "\n\r\n\t\t\t\t2,781 people found this review helpful2,355 people found this review funny\t\t\t\t939\n\n\n\n\n\n\nRecommended\n5,131.9 hrs on record\n\n\n\n\nPosted: 28 October, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThings I've Done in Skyrim (In no real order):-Got married-Adopted six kids-Built a mansion for my family-Adopted a bunch of dogs-Learned I was Skyrim Jesus-Used my Skyrim Jesus powers to slay dragons and save the world-Became a Warewolf-Cured a ghost of his warewolfism-Became a vampire hunter-Promptly abandoned the role of vampire hunter because the vampires gave me cooler stuff-Betrayed the vampires and gained the ability to summon a skeleton horse and a zombie dragon-Joined an organized crime syndicate-Killed the leader of said syndicate after selling my soul to an evil god-Joined a hitman cult-Cuddled a ghost-zombie lady in a casket-Killed a burnt chicken-nugget with a demon dagger-Killed the Emperor-Killed the man who asked me to kill the Emperor-Was paid 30000 coins after killing the man who paid me to kill the Emperor-Never spoke with my hitman friends again because the Ghost-Zombie's voice was really loud-Went to college-Was chosen by space wizards to save the college-Found flying magic ball-Killed people trying to use the flying magic ball for bad things-Became headmaster of the college-Joined the blue team-Thought it would be funny to join the red team after killing their leader, so I switched sides-Crushed the blue team after bringing the new red team leader a pointy hat-Saved a tree-Was pulled into gooey world by another Skyrim Jesus-Killed the other Skyrim Jesus because there can only be one-Stole a horse that a guy sold to someone else without actually owning the horse in the first place-Killed the dude who I stole the horse for because I wanted the horse-Killed a lady who I walked past on the road for using \"milk-drinker\" as an insult. Milk is good-Chilled with a bunch of hunters in a hot spring-Got drunk-Started multiple bar fights-Helped two lizards get married-Helped the mad hatter with his tea party-Spawned 1000 coins and threw them in the river because I wanted to see where they'd end up-Blackmailed a LOT of people. Like... a LOT-Killed multiple guards because they treated sweet roll theft as a laughing matter-Walked onto the stage during a beheading because I wanted a dude's necklace-Was chased for walking on stage during a beheading-Gave money to the poor (After throwing 1000 coins in the river)-Killed a man on the road and threw him in the river because I wanted to see where he'd end up-Killed multiple innocent animals because I saw them and knew I could-Reunited a Scooby with Shaggy-Gave Vorstag a lot of fireball scrolls-Regretted giving Vorstag fireball scrolls-Stole every book from the College library because my library at home felt empty-Stole every book I found because I quickly gained an obsession-Became addicted to drugs-Became a bard-Downloaded a mod because becoming a bard wouldn't let me sing-Got arrested for singing \"Age of Oppression\" in the Blue Palace-Broke out of Prison multiple times-Became a heavy drinker-Made the Constance regret letting me adopt children-Killed a horse and threw it in the river because I wanted to see where it ended up-Got a mod that makes Unrelenting Force 700% stronger-Started Skyrim's first Space Program-Lead people to Giants so I could watch them get beat over the head with a club-Told kids I'd play tag with them and then left-Told one kid she could have a mudcrab, but told my son he couldn't have one-Told my kid I had a gift for her but then gave her nothing because they need to learn disappointment early-Cooked food for my family and actually set up the table with plates, cups, forks, spoons, bowls and jugs of milk-Gave Vorstag some food and then ate the rest in front of my kids-Gave my kids 1000 gold-Filled my basement with skooma-Collected bug jars-Became wanted in every hold at once for the same crime-Bought Khajiit's wares-Installed nearly 100 mods-Am still installing mods-Will never stop installing modsIs this what you intended, Todd?\t\t\t\n", "\n\r\n\t\t\t\t594 people found this review helpful317 people found this review funny\t\t\t\t202\n\n\n\n\n\n\nRecommended\n1,630.2 hrs on record\n\n\n\n\nPosted: 28 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSkyrim is the digital equivalent of crystal meth. Once you start playing it, you'll never stop. You might pause every so often, like a distracted magpie tempted by some shiny new gaming trinket, but you'll never truly stop. Deep in the bowels of Bethesda HQ, Todd Howard made an unholy pact with the forces of darkness that compels people to play his game incessantly. Even if they've already bought it 57 times on 39 different platforms. It's a form of collective madness, and there's no way to combat it. What's that? You have a job to go to? Well... who's going to return Meridia's Beacon? Kids to feed? That's nice and all, but someone really needs to reforge Gaulder's Amulet. And it might very well be your wedding anniversary this weekend, but this civil war isn't about to resolve itself, is it? Priorities people!Skyrim's like Disneyworld. Everyone loves it. Little kids play Skyrim. (They shouldn't because it can be scary and gruesome, and you're an irresponsible parent for permitting it, but they do.) Doddering bed-wetters in retirement villages across the globe play Skyrim. (And they shouldn't either, because having a frostbite spider leap out of a shrubbery at you could very well provoke a heart attack or stroke.) It's a game that has multi-generational appeal. Todd Howard's monstrous ambition knows no limits, his target demographic being literally 'anyone with a pulse'.Yes, Witcher 3 might have nicer graphics, some incredible quests, and more sophisticated swordplay. And, Horizon Zero Dawn might have a jaw-droppingly lush sci-fi/fantasy world, and a brilliant heroine. And, of course, Red Dead Redemption 2 has cowboys, colourful, believeable characters, and a story that grabs you by the throat like a rabid wolverine, refusing to let go until the very end. But they're not Skyrim. They don't have the eleven secret herbs and spices that make Todd Howard's particular brand of open-world witchcraft so finger-lickin' good.Jeremy Soule's soundtrack helps. It's not often I'll pause after caving in the skull of an angry bear to sway gently in my chair like a mesmerised cobra, a look of glassy-eyed contentment plastered across my gormless visage, but listening to 'Distant Horizons' for the 482nd time will do it. The eye candy built into the Special Edition also induces moments of introspection. Sitting on horseback, overlooking a gorge in The Reach as the volumetric fog curls lazily about me, and godrays lance between the gnarled branches of stunted trees... it's like something out of a Boris Vallejo painting. The world of Skyrim is a character in itself, and it sucks you in like a quantum singularity made of dragons and stoic men with unnecessarily large beards.If you're one of the last seven people on Earth who still hasn't played Skyrim... don't. Run far, far away, and don't look back. This is a game that will consume your every waking moment; worse, it will invade your dreams like a creeping phantasm. Your significant other will elbow you in the kidneys as you flail about the mattress, desperately attempting to escape the imaginary minions of Hermaeus Mora. When your kids won't stop pestering you, you'll suddenly turn on them and scream \"Fus Ro Dah!\", and they'll stare at you with that all-too-familiar mixture of pity and disdain. \"Don't be a sad freak, Dad. It's embarrassing.\"I have spent over 3,000 hours engrossed in this game -- time I could have spent bonding with my loved ones, working to further my career, or building a really cool treehouse. These are hours of my life I will never get back. Fleeting, irreplaceable seconds of existence forever lost to Alduin's fanged maw, and Todd Howard's malignant dreams of global dominion. And yet I regret none of it. Not one pointless, unproductive minute. And given the chance to do it all over again, I would. God help me, I would. It's too late for me. I'm a lost cause. But there is hope yet for you. Go. Save yourselves. Flee, you fools! \n", "\n\r\n\t\t\t\t2,317 people found this review helpful55 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n90.9 hrs on record\n\n\n\n\nPosted: 29 December, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIf you want OLDRIM, here: https://store.steampowered.com/app/72850/The_Elder_Scrolls_V_Skyrim/Like so, people can see.\t\t\t\n"]