["\n\r\n\t\t\t\t2,085 people found this review helpful24 people found this review funny\t\t\t\t2\n\n\n\n\n\n\nRecommended\n71.9 hrs on record\n\n\n\n\nPosted: 30 March, 2020\nEarly Access Review\r\n\t\t\t\t\t\t\t\tHas a long way to go. Needs more quest content, more depth, some fixes, added character interactions and dialogue and alot more.It's still fun, it's a modern warband after all. But it could be much more.\t\t\t\n", "\n\r\n\t\t\t\t1,403 people found this review helpful54 people found this review funny\t\t\t\t65\n\n\n\n\n\n\nRecommended\n1,282.7 hrs on record\n\n\n\n\nPosted: 5 October, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tWith nearly 1000 hours on this game I can agree with some reviews that the late game is simply ridiculous.  I can take all the land from a faction, defeat their remaining parties repeatedly, even capture and imprison all clan members and still have to pay vast amounts to obtain peace with them, or else they raid my villages perpetually.  The diplomacy is completely irrational. I would love for these issues to be fixed.  When you defeat an enemy they should dissipate instead of lingering to raid my villages until ragnarok.  When an ememy is defeated they should pay me for peace.  These things are realistic.\t\t\t\n", "\n\r\n\t\t\t\t1,331 people found this review helpful26 people found this review funny\t\t\t\t13\n\n\n\n\n\n\nRecommended\n236.7 hrs on record\n\n\n\n\nPosted: 13 April, 2020\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis is my first review on steam ever. I felt it was kind of my duty to give my opinion on the game that I have personally been waiting for over 6 years, as Warband happens to be -if not the- one of my all time favourite games (with around 1100 hours of gamplay - yes I know, still rookie numbers compared to some other of its fans, but still, that's a considerable amount of my life's time).So, I have -as of now- played 63 hours of Bannerlord and another 155 hours of the multiplayer beta of which I had the honor of being a part. I now feel confident enough to talk about why I think that you should get the game yourself, especially if you loved any of its previous titles.First of all, the game is aesthetically a HUGE development from the awkward indie 2010 (that -even then- still felt older) graphics, which we all grew to love. The animations seem more realistic, the items more detailed, the campaign map is incredible and the scenery (from the snowy forests of Sturgia to the desert wastelands of the Aserai homeland, and from the rocky Battanian villages to the great cities of the Empire) is beautiful and at times even -dare I say- majestic. Sure, the graphics still don't compare to the other big games of its time, and the character models still look a bit odd, but for a game of a small company like Taleworlds that chooses to focus more on the gameplay and the game's mechanics, you can at least overlook some of their flaws.I should also point out here that the game takes place around 200 years before the events of Warband, in a world where the Calradic Empire still exists, although in crisis, and new and old kingdoms arise in its wake. Some of the factions are the ones that evolved into the ones in Warband (Vlandia is the predecessor to the Swadians and the Rhodoks, Sturgia is a mix between the Vaegirs and the Nords, the Khuzaits are the khanate before the rise of the Khergits, and the Aserai the previous Sultanate to the Sarranids), while we also have the Battanians (a celtic-like mountain kingdom) and the Calradic Empire (an empire very similar to the medieval Greco-Roman -now known as Byzantine- Empire). Each of these factions is very well made in order to feel unique and different to the others, with its own architecture, clothing style and troops, that are very close to their historical inspirations, giving you a nice depiction of some fields of what the actual medieval world looked like (and in some cases how it worked).Now, for Single Player, on a first look you'd say \"That's an enhanced version of Warband\" and you'd may be right for the most part, but the game offers many new features and details that differentiate it from its predecessor. Examples of this are the many convenience options, like the way you can recruit troops from villages and towns which can be more and better if you have good relations with the village's notables or the fact that you can see the full items' stats and compare them to your own. There are many new features, like the Clan and its mechanics (basically you, your family and your companions), the fact that you can have children and continue to play as them once your older character finally kicks the bucket, the forging system which allows you to make weapons and choose how they will look on your own, the new Kingdom Mechanics, that enhance the experience of serving or ruling a realm with multiple armies and kingdom laws, and the fact that you can now kill nobles that you capture, with whatever consequences that may entail. Other features have been renewed, fixing annoying issues that existed in Warband or completely changing the way they worked for the better, like, for example, the new massive battles with more thought out AI-planning, and the sieges, that now have siege weapons and are not just a mass of angry people cramming a small ladder only to get violently killed by the other mass of angry people that awaits them on the walls.For Multiplayer, there are now 3 main modes, which are Skirmish 6v6 (which is like battle and conquest together), Captain 6v6 (which allows every player to command a small band of troops) and Siege (which is the good ol' siege we all know and love, polished with siege weapons and some new mechanics). There is also a Team Deathmatch mode which is more like a playground to prepare you for the real modes above. Now, the way the combat works is almost the same as in Warband (with some minor changes like a shield bash move, a crouch move and chain attacks) and I feel like it is what we should expect, even though I hear complaints about it being \"clunky\" and \"unreliable\". I personally enjoy it as I did in Warband and I'd say it is highly dependent on skill and experience (I believe it's hard to learn and to master, but once you do, it offers you a very fun and challenging experience). Of course, there are still many issues and bugs which make you question the fact that this is a game that was in development for 8 years and that it is priced as much as it is. If you buy it now, mind that you will come across a lot of them. That being said, you should also keep in mind that this is still Early Acccess and many of them are bound to change. Also, you have to AT LEAST give credit to the developers for keeping track with the complaints and the feedback of the players, having already made 10 updates (during the first 10-11 days since the release!) and continuing strong. Honestly, the way they keep hunting for issues and bugs and the way they listen to negative feedback is all I could ask from a game studio (which, again, is not a major one) and, if anything, deserves my support in this journey of making the game that we all have dreamt and still dream of.Overall (and sorry for this lengthy essay), the game is a worthy successor to Warband. It offers you a pretty similar experience that Warband did (letting you explore a vast world of different cultures and giving you the freedom to make your own story, whether it is of the journeys of a merchant, the adventures of a warlord, the path of terror left behind by a bandit leader, or the rise of a new ruler) which is exactly what we should all have expected and hoped for. And yet, even as a game that offers content and possibilities the size (and even significantly bigger than the size) of Warband, it still feels like it has not even scratched the surface of what it is capable of, leaving space to be filled in ways that we haven't even immagined by the many and various mods that are bound to follow (and have already started making their entrance) by the ever restless and creative modding community of Mount&Blade. So, if you have waited for this game like I have and still wonder if you should buy it in its current state I'd say, yes, join this journey, because even if it's not yet all you have dreamt of, given time and support it's going to be. If you are new to Mount&Blade, and think that it is a little overpriced for a game that is not fully completed yet, you can always wait until it comes out of EA, but I would personally recommend that you give it a go, and in the end you will be glad you did.\t\t\t\n", "\n\r\n\t\t\t\t1,828 people found this review helpful36 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n150.3 hrs on record\n\n\n\n\nPosted: 1 April, 2020\nEarly Access Review\r\n\t\t\t\t\t\t\t\tWith 2,192 hours in Warband, I think it's safe to say that I've experienced my fair share of the classic Warband experience that Bannerlord is not only trying to emulate but also build upon. With 15 hours in the game, I'm already of the belief that Taleworlds will not only achieve this end, but surpass it.The game is buggy, yes. Some of the bugs are obnoxious, yes. There are portions of content missing that are sorely needed. Not only is this true, but the disappointment surrounding it is understandable. After 8 years of waiting, 10 for some, this series has cultivated a cult following of dedicated and loving fans, myself very much included, who want nothing more than to dive head first into the game.But it's very much an early access and anyone who finds themselves overly disappointed by the state of the game needs to remind themselves that it is still in its infancy. Even now, the content included in the game is entertaining; compared to Warband, combat actually feels weighty, and adventuring around Calradia has a heightened sense of danger and excitement to it. Side activities such as smithing allow for those interested in roleplay to create deeper stories for their characters, and core mechanics such as trading have been developed and enhanced in this new release to feel far more responsive and rewarding.It is clear from the two very quick patches it has already seen that this early access is one that Taleworlds are committed to building upon. Bugs will be worked out, content will be added, and I am firmly of the faith that the game will continue to evolve and take shape over the coming days, weeks and months. Everyone is well within their rights to leave a negative review, but I would encourage people not to damage the game's rating unfairly, as the current release is not indicative of the finished product.The thing that Bannerlord needs right now is committed players to continue to highlight issues so that they can be resolved. The framework provided to us now sets a good vision for the final product, and I can't wait to see that vision be fulfilled.\t\t\t\n", "\n\r\n\t\t\t\t604 people found this review helpful394 people found this review funny\t\t\t\t202\n\n\n\n\n\n\nRecommended\n117.6 hrs on record\n\n\n\n\nPosted: 9 October, 2020\nEarly Access Review\r\n\t\t\t\t\t\t\t\tHad my entire fortune poached by wandering looteres, most of my men were killed, those who weren't died later of starvation and the only one to make it to a town was me. Where I was promptly ambushed by brigands, who *let me go* because I was *too* poor. At some point I realized I'd lived my entire life in poverty, misery and eventually I decided to turn my life around.I became a blacksmith, created some minor works - barely making a profit. Until one day, when I made a sword that broke the town's economy. Everyone wanted my sword. In merely a day, I'd earned enough to purchase largess too grand for even kings. Then my life - so deprived in years gone by - was filled but still empty. Money begets money, and violence begets violence. Eventually, when I had conquered the world I knew nothing but stillness. My clan was large and thus was my lot.  Eventually life was bleak, if a man could have anything, would he want for nothing? Or did it mean he could not desire anything, as well? Then, it was 3 am and I realized I had work in the morning.All in all, ten out of ten, would Bannerlord again.  \n", "\n\r\n\t\t\t\t716 people found this review helpful51 people found this review funny\t\t\t\t50\n\n\n\n\n\n\nRecommended\n385.3 hrs on record\n\n\n\n\nPosted: 21 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrusader Kings needs this game and this game needs crusader kings.\t\t\t\n", "\n\r\n\t\t\t\t2,087 people found this review helpful2,524 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n254.3 hrs on record\n\n\n\n\nPosted: 4 April, 2020\nEarly Access Review\r\n\t\t\t\t\t\t\t\tA lord refused to nominate me for a castle after I successfully captured it so I switched sides, tracked down his wife, and chopped her head off. 10/10\t\t\t\n", "\n\r\n\t\t\t\t333 people found this review helpful8 people found this review funny\t\t\t\t34\n\n\n\n\n\n\nRecommended\n263.8 hrs on record\n\n\n\n\nPosted: 28 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMAKE A CAMPAIGN CO-OP MODE PLEASE!!!!\t\t\t\n", "\n\r\n\t\t\t\t404 people found this review helpful10 people found this review funny\t\t\t\t43\n\n\n\n\n\n\nRecommended\n114.6 hrs on record\n\n\n\n\nPosted: 2 March, 2021\nEarly Access Review\r\n\t\t\t\t\t\t\t\tGreat game... who need 1 or 2 years of development. tl;dr: mid game turn into a micromanagment hell.The game is fantastic until a certain point. You start as a mercenary, one party, 50-150 soldiers doing missions, small battles or bigger fights joining armies. Good graphics, brutal engagments with 200-1000 units at the same time if your computer can handle, playing as a soldier is a blast.The problems start when you get a few towns and a bigger family, the micromanagement never stops and gets worse overtime. You have to physically move your party to towns to fix their issues. When your lords get captured & escapes, they'll go into a random town until you pick em again, then you'll have to reform the party. Same with caravanes for trading, if they get captured, you'll have to go in his town and recreate the caravan. You have to partially fill towns with soldiers, manually, from your own soldiers. All the little fun things of the beginning soon become a hassle, as you can't delegate. Messengers are not a thing.You can't manage a town at a distance, you can't tell a party member to move to a location or guard a territory, they do whatever they want if they're out of your army / party, so you have to do it yourself. Either you're leading your huge army to fight what is basically an enless war mid game, or you take care of your cities while the rest of your faction fight... with various success. Some commanders are pretty good, other will throw waves of recruits at highly trained arbalists in the open backed with cavalry. Protip: don't be a recruit in an imperial army.You can't tell a party you created to guard an area or to kill all bandits attacking your villagers, it's up to you, or the IA if it feel like it. Worst, if you let the parties you created roam around (parties = group of 70-200 soldiers under a lord) they can be (temporarily) drafted in other armies of your kingdom... and you'll have to physically move to the army, talk to the leader and pay some reputation to get them back. Of course, large armies are slow. This leads the the next problem, swarms.My worst fear is not a massive army, it's an army disbanded in the middle of my territory. The small parties usually start raiding all villages in the vicinity while being too fast to be catched by a big army. Raided villages impact your town / castle loyalty and gold quite heavily. Sure, you could disband your army and hunt them yourself... but that makes you take a step back, and all your parties would reform under another army you can't control. And man, some army commanders are really, really stupid. Verdun style charge in the open against walls of archers, cavalry in a forest vs pikemens, you name it. I can't count the time i had parties wiped in someone else army. But let's say you managed to capture the lords burning your villages.The capture system is broken. Captured lords escape A LOT. I had some escape 20 seconds after being captured. They never stay in a jail for more than a few in game days. Once they escape, they magically teleport to their hometown, rebuild a fast 80 mens army in the blink of an eye and go back to raiding villages. AI \"cheat\" with recruits, they will always find soldiers in town, even if they're empty for you. Executions you say?If you execute a lord, no matter how much of an A-hole he/she is, the whole faction will hate you. He raided dozens of villages and killed hundreds of peasants? Still not good enough. You just can't kill a lord without suffering heavy consequences down the line, and you'll need those lords to be friendly later. Worth to mention, capturing the leader of a faction won't stop a war.Last - peace / war is on/off. I had 600 days of continuous war, followed by 600 days of complete peace in the entire map (due to a bug apparently), and i'm now back at 300 days of war. Not a single day of peace, when one war stop another start immediatly. They will just never, ever stop fighting. Can't catch a breath, can't leave the front of your lose towns.Oh and the main quest randomly failed after 875 days or so.I would still recommand the game, it's really fun for a while but it need a HUGE QoL update. \n", "\n\r\n\t\t\t\t601 people found this review helpful143 people found this review funny\t\t\t\t166\n\n\n\n\n\n\nRecommended\n948.6 hrs on record\n\n\n\n\nPosted: 25 January, 2021\nEarly Access Review\r\n\t\t\t\t\t\t\t\tGreat game. Started playing during the second lockdown. Finished the game to the point of having my own empire, reaching the ability to fight multiple wars with over 380 troops in my personal army. Ambushed by groups of 800-1000 and held small passages with 150 fian champions, a shield wall and just enough cavalry to route the enemy. Had every companion in my personal bodyguard unit and was run down by a flanking cavalry charge, most of my unit was dismounted, we had to fight our way back to our line. Ordered our shield-wall to take tremendous losses to get us back into the fighting. Creating a tusudo (square formation) around the companions and bodyguard unit while we fought against the 2 v 1 odds (realistic difficulty). Lost 90% of my army, most of my companions but we won that battle. When we get out, we siege the enemy castle with just enough soldiers to push the ram. We knock down the reinforced doors and engage in a skirmish. The companions start to fall, members who were with me from the beginning. My troops are outnumbered, holding a small room near the gate. The balance of power is slowly creeping in the right direction. We are down to the last 20 enemies. We have 9 of us left, holding the doorway the best that we can. I take a javelin to the head, instant K.O. My units keep fighting, my bodyguard with insane leadership and tactics, reforms the wall and finds 30 or so troops that I mismanaged to come around and flank. I watch the battle incapacitated, the units left on our side is under 10. The units left on there side is under 10. We get to 3 each, companions vs. enemy leaders. My wife is one of the companions, my brother Nogrand is the other. The last companion is a surgeon who somehow made it this far. He dies but not before he throws a perfect javelin and takes one of the enemy commanders. Nogrand and my wife are melee specialists, almost maxed fighting stats with pillaged level 6 weapons. They hold, they wound both the last commanders. We take the castle, executing the commanders. But this isn't over. We, 265 wounded, an effective fighting force of 2 with my character health at 1% are about to come under siege from a nearby army. The nearby army sets the castle under siege. Hours turn to days, the army of 600 is ready to fight and in the distance I see our last hope. I see the first lord I recruited in my battle against the empire. The lord I spent years chasing as a mercenary, relentlessly beating in battle to gain charm points... he with an army of 400 is charging this way in what looks like a rally to protect his king, his commander, his lord! He stops and watches my no save, death on, realistic campaign's final moments. He sits there, watching this enemy army take down our walls with trebs and in the last second... just as they start to storm the gates, my number 2, my favourite lord... just sits there. We lose the campaign, we fight to the end and with a valiant last stand my party is killed in battle. It is over, my sons killed, my wife murdered and staring at my 300 hours campaign, satisfied that the next time; i'm going to behead that lord and his entire family the first time we meet. Until next time... 10/10\t\t\t\n"]