["\n\r\n\t\t\t\t2,048 people found this review helpful72 people found this review funny\t\t\t\t765\n\n\n\n\n\n\nRecommended\n1,126.6 hrs on record\n\n\n\n\nPosted: 30 October, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy wife & I enjoy this game together :) We love the co-operative clean fun & challenges :) She doesn't have a lot of mobility because of a rare disease so this is a way for us to 'get out' - Thank you\t\t\t\n", "\n\r\n\t\t\t\t1,665 people found this review helpful217 people found this review funny\t\t\t\t81\n\n\n\n\n\n\nRecommended\n352.4 hrs on record\n\n\n\n\nPosted: 30 July, 2019\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI bought two copies, one for my seven-year-old daughter, and one for myself. I host a non-dedicated session and invite her through Steam, and we spend hours tranquilizing dinosaurs, taming them, and collecting them on our island. I use the cheat codes to spawn all the items we want (using the ark wiki and double tab) and we have a great time. I recently purchased two copies of Scorched Earth, and we spawned in tons of air conditioners and wyvern eggs to hatch baby dragons, then we spawned in a bunch of wyvern milk to grow and tame them.I've never touched a multiplayer server and don't care to. My daughter is a dinosaur nut and she absolutely loves this game and the way we play it. This review probably helps no one, as kids aren't really the target demographic, but I thought I'd give it a thumbs up anyways.Pretty much our favorite game to play together. I'm just thankful she'd rather play this than any of the Lego games.\t\t\t\n", "\n\r\n\t\t\t\t2,549 people found this review helpful736 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nRecommended\n1,098.6 hrs on record\n\n\n\n\nPosted: 16 August, 2015\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis is a review of the offline game.          This game has been one of the best games I have ever played. I have been playing games for over  25 years and haven't experienced a game this epic. I'd like to share one of my quests.           I had just finished my first base on a peninsula. It had a bed and some storage containers and was starting to feel pretty safe. I hadn't seen many dangerous Dino other that dilos (the ones that killed the fat guy in Jurassic park). I had stockpiled some goods and decided I would go try to tame something worth taming. \tI found a raptor in a valley surrounded by rocks and decided he was gonna be my buddy. The taming process was pretty intense so it really made me want to keep my Raptor safe. I saddled him up and decided to give him a go. He was amazing, we ran around killing everything. After about 30 mins of running and killing things I decided to go home and give my new buddy a rest. We ran through the night and in the morning i realized how extra lost i was and got worried. I decided that the best way to find my way home was to climb a mountain and look around. After 5 mins or so of looking and referencing the map I finally figured out where we were. Just as I was about to put my map away I was ambushed by several scorpions and unfortunately they killed me. \tAfter I respawned back at my base I was in panic mode and jumped on my only other ride able Dino which was a Parasaur and hauled ass back to where my raptor was. We never made it. About halfway there we were attacked by a pack of raptors and both were killed. My next re-spawn was kinda bleak from the start. I re-spawn in a random location that I thought would be near my Dino. After what seemed like hours of carefully navigating my map back to where i though my Dino was I started to freeze and starve. I would move thirty to fifty feet and whistle then repeat. The sun went down and my hopes for recovering my dino with it. Just as I had given up hope I was surrounded by scorpions and I thought \"oh well\". A second later my Raptor jumped down from the rocky ledges above and killed one of the scorpions. I frantically jumped on his back and ran from the other scorpions. My health was still falling due to the cold and me starving. Once we got to relative safety I hopped off his back and checked his inventory. Somehow he had collected a full suit of armor and plenty of berries whilst we were hunting earlier. We eventually dodged meat eaters and found our way home once the sun rose. \tI have never felt that since of disparity and relief from a video game before. It sounds funny but it really felt like the raptor saved my life. I've never got that into a game before. That one experience was worth more than what I paid for the game.\t\t\t\n", "\n\r\n\t\t\t\t1,351 people found this review helpful339 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n1,084.6 hrs on record\n\n\n\n\nPosted: 20 April, 2016\nEarly Access Review\r\n\t\t\t\t\t\t\t\tNote: At least 1000 of my hours were spent on Official Servers. Thus my review will pertain to Official Servers.Ark Survival Evolved is a game that will make you feel many things.  Initially you will feel frustration at your helplessness as you spawn nude on a beach at level one and can barely fend off the smallest of dinosaurs.  Then you will meet people, these people will either be total jerks and just kill you over and over, or they will be really chill, and you'll form a tribe with them.  You will spend countless hours with these people: farming materials, taming dinosaurs, and build bases.  You will grow more and more in power.  You will be meeting other players either passing through the server or settling down.  You will know all the other tribes on the server that are worth knowing (i.e. the big tribes or friendly tribes).  You will come across numerous other cultures as you find Chinese tribes and Spanish tribes, French and German, all while growing more and more powerful.  You will on occassion have a set back, but at this point you're on a roll and now the games mechanics, have a good group of friends, and objectives that you have given yourself.  You will feel happy with what you have accomplished.  But there is a downside.  There must always be conflict, while it can be delayed for long periods of time, it will eventually come.  And so another tribe will pick a fight with you.  Your tribe will fight their tribe, and you may lose or you may win.  Either way you've invested a lot into this server and these friends, so you'll never give up.  Some other tribes will jointhe fight, picking sides.  The winning side will probably kill all the dinos, take all the mats, and kill everyone on the losing side.  Thus you have won your first war.  You are now a power on the server worth being reckoned with.  Soon enough, you'll get in an even bigger war as the losing side draws more and more people to aide them and you respond by getting more as well.  Now the entire server is split 50-50, and a great war mars the server for days as both sides are constantly wiping one anothers bases.  Eventually you'll win though, and the other side will leave the server.  They'll be fed up.  As the enemies are now gone, you are happy once more.  You hated them just as they hated you.  Now a long period of peace has passed, a couple weeks.  There is trouble brewing as a few of your allies are begin to grow wrestless and have infighting.  Peace will try to be maintained through talks.  But it will fail in the end, and more war will arise.  This cycle will continue until only 2 tribes remain.  These two tribes will be dominant in every regard: leadership, tactics, dinosaurs, and materials.  Pitted against one another to see who will rule the server.  You will fight your heart out against your former allies.  You will destroy bases you'd once entered as a friend, now as an enemy.  You will kill dinos whose names you helped come up with.  You and your tribemates will be cycling out who gets to sleep because the battle will last over 24 hours.  The fight will go on and on and on and on with no end.  It will be exhilerating.Then you win.  Then you are the supreme ruler of the server.  You are standing over the ruins of your former allies as you have proved yourself to be the mightiest.  But then it will hit you.  The sadness. As now all the people you had once known, months ago when you were just a little tribe starting out, will all be gone.  Everyone you'd ever fought with and fought against are gone.  While there is some joy in victory, it is very bitter as there is no one left to share it with.  Your tribemates will still play, but it's not the same.  Even if not in your tribe, you had a community. Friends. Foes. Maybe even lovers.  Now all that is gone.  You will pass the ruins of these once great tribes and feel a hole in your heart.  New people will always arrive to challenge you, but you'll always beat them down.  Destroying any hope they had.  You'll build fortresses that'll reach the Heavens and have so many dinos it'll cause server lag.  You'll build Great Walls across vast territories in order to denote your power.  Finally, you'll get bored and leave.Months will pass, and one day you'll see Ark still in your library and hop back on.  You'll log back into your old server.  Everything is different.  New names, faces, bases, everything.  Not a single structure you had built is left standing, not a single ruin.  All of it is gone.  The people on this server see you log in and ask if you want to join their tribe saying that 'Ark can be harsh for noobs', but you could never tell them.  You could never tell them an entire servers history.  The hundreds of thousands of hours of work you'd seen put in by that ancient world.  The structures they couldn't ever even imagine.  The wars you'd fought and people you'd met.  You could never explain to them what it all had meant to you, for it is all now gone.  In it's place is a new world, completely distinct from the original while maintaining a strong similarity.  You will be both extremely happy at this new world, and profoundly sad about the world that was lost.Ark Survival Evolved will demand dozens of hours to just get the basics down and get priorities straight.  To become a power on a server will take about a hundred hours.  To conquer a server will take a couple hundred hours.  To realize everything you lost and destroyed that you once held dear will take thousands of hours.  To atone for everything you'd done to those you once called friends will take an eternity.If you'll pour time and effort, no game will ever make you feel as strongly about the decisions you've made than Ark: Survival Evolved.  Beware that you may get addicted and lose your real social life and ambitions in exchange for this game.  But you'll meet people you'd never have met otherwise, see things you never thought possible, commit acts that would make tyrants think you're true evil or saints believe you are the second coming of Jesus Christ.  In the end, you'll feel stronger emotions then any you've ever felt from playing a game.10/10 Masterpiece.\t\t\t\n", "\n\r\n\t\t\t\t1,693 people found this review helpful1,721 people found this review funny\t\t\t\t86\n\n\n\n\n\n\nRecommended\n207.4 hrs on record\n\n\n\n\nPosted: 8 June, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMy legs broke from being hungry\t\t\t\n", "\n\r\n\t\t\t\t1,832 people found this review helpful130 people found this review funny\t\t\t\t3\n\n\n\n\n\n\nRecommended\n189.1 hrs on record\n\n\n\n\nPosted: 29 June, 2015\nEarly Access Review\r\n\t\t\t\t\t\t\t\tSince most people are bashing the PvP servers for the griefing, I feel like someone should answer that and also talk a bit about the PvE servers.Right now I got close to 130 hours in the game, about half of that on PvP servers and half of that on PvE, all official ones. All the thing people say about the griefers is true, they'll kill your dinos, steal your stuff, abuse your body and destroy your house as soon as you go to sleep. In fact a lot of tribes organize group to play past midnight for the sole reason of hunting sleeping players. And that's the keyword here TRIBES. If you're playing on a PvP server you gotta keep in mind that you're not supposed to do it at your pace and take your time building your little Tatch hut with it's little thatch fence with your Raptor and a couple of Dilos. Slowly learning the game by yourself, taking everything in, eventually upgrading to Wood and then Stone and so forth.I'm sorry but I got to burst your bubble right now: If you plan on playing in a PvP server you gotta take this game seriously. You either find a group of friends to play with you or you join a Tribe as soon as possible. If you play alone you might find a hidden spot where your stuf will be safe one or two nights, maybe even a week, but alone you're doomed to be found, robbed and killed. And like many others said, have the work of a whole week go down the drain. If you're joining a PvP server you're doing it for Tribe warfare and let me assure you, thing can get really intense, really epic pretty fast. With eagles swooping down to grab enemies and droping them from high altitues to their deaths, or tactical droping Raptors inside their base to wreak havok, T-Rexes working as battering rams at the enemies gates while rockets fly at them, auto-turrets spewing bullets at your Carno army, Sabretooths leaping over walls. It is a beauty to behold.But you'll only experience that if you join one of the dominating tribes on your server or work on creating a strong Tribe of your own. Otherwise you'll just be cattle for them, nothing else. They'll keep you from taming dinos by killing them mid proccess, block caverns so only they can harvest the resources, literally kidnap you to use you as a blood bag Mad Max style and so on.I get why so much people hate that, after all they're just being preayed upon, they're not participating in all the fun that is Tribe Wars. But the only way to Tribe Wars be so much fun is allowing all this kind of freedom the game has right now, they gotta allow people to be complete a-holes because during wars that's what you gotta be. If they put too many safety nets to keep people who wanna do PvP only when THEY wanna do PvP the game would be boring and stale.But if everything I said right now put you off, don't be. First of all because you don't really need PvP for this game to be fun. There's a TON of stuff to do in PvE servers or offline if you just wanna do everything at your pace. I got a bit tired of all the pressure on PvP servers and have been playing in a PvE for around 60 hours right now. And I still only got only a Wood base with some Dinos, just hit level 45, and I feel like I'll never run out of things to do because the devs just keep adding and adding stuff almost each day. People are also very helpful on PvE servers, they'll give you a hand when you have problems with a Rex, help you gather Prime meat when you're taming a Carnivore, give you tips and materials. At least on my server I got absolutely nothing to complain about them.And if you're still one of the guys who wanna grow at your pace and only participate on PvP when you're ready, REJOICE! Because they'll soon add War Declaration to PvE servers, so tribes can actually go at war when they feel like it, without all the griefing to new players who want just to keep to themselves.As a closing statement, I'd like to congratulate the Devs. They're doing a terrific job. Optimization is alreayd a LOT better, still not there yet, but much better. The content is fantastic and it just keeps coming. Bugs are rarer and rarer, in fact I don't even remember the last time I experienced one.An all around great game that I fully recommend if you're into dinossaurs and survival games. Oh, and it's also pretty cheap.\t\t\t\n", "\n\r\n\t\t\t\t1,269 people found this review helpful20 people found this review funny\t\t\t\t282\n\n\n\n\n\n\nNot Recommended\n10,036.2 hrs on record\n\n\n\n\nPosted: 27 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI've loved this game, put in WAY more hours making maps and modded content for it than I have playing it which is a terrifying statistic to think about, and have made some of the closest friendships from playing with people in the community- but, I'm just really disheartened. This is gonna be a long post, I've nolifed the ♥♥♥♥ out of this game for the better part of half a decade so there's a bit.Having people come into my streams & DMs to ask me if I'm going to be porting my map and mods over to ARK1.5 with ASA and then to ARK2 before all of this immense drama and fleecing happened, before we knew anything about prices and release dates- it was a firm yes! I'd love to bring my creations over to UE5, porting content over was so easy, even myself and people in the modding community were putting our maps and creations into stock UE5 just to see what the possibilities were and get off on the new physics, lumen and nanite.Now I really don't want to bring that content over. Not only because of the bad business practice, with many other games who have ported over to UE5 or have done engine upgrades been offered for free- but because I've seen this one too many times with this company and the business is just horrifically mismanaged and it's heartbreaking for some of us, it's heartbreaking for me.When someone in a position of power and authority over an IP and business has stated that ARK1.5 would be free, as a gesture of good faith, you take that as a promise, and we were all stoked about that. That was the right thing to do. ARK is not a small indie, unknown survival game in a (mostly) unfinished state anymore like it was- it is a powerhouse in the industry, top survival game charts across the internet for -years- will have ARK in the top 5- it is not a game that has done poorly for revenue, publicity or players. It is one of the giants. The best IP that Snail/WC have to date and continues to be. There is no reason to renege on a promise that was publicly made. And before some moron says \"JuSt DoNt BuY It ThEn\" it's deeper than that, I would have had, at my hours invested, zero issues purchasing ARK1.5 for like $20-$30 bucks with all DLC's included- but to make an offer, after it was promised as free, then to take it back and serve up an even bigger steaming pile of ♥♥♥♥ that is more expensive on a plate, and for Wildcard to hand you the spoon and be like yum yum dig in! Is so strange.Honestly, I'm not surprised. I was a public moderator in the ATLAS discord with Jat and other off branched former/current- Wildcard/Grapeshot employees at the release of that absolute dumpsterfire and was there with the rest trying to put out fires that could be witnessed from fu**g Jupiter- because I had faith and volunteered my time to assist with a company I believed in, created for and wanted to succeed so badly for the community. Dark and Light was next. Another abandoned IP. Then Last Oasis- yep- Abandoned. All of the offbranches of ARK have failed so horribly, and haven't managed to capture that excitement that ARK did for the industry but they will absolutely keep trying to push out what they think consumers will like, all without listening to any feedback- and feedback isn't always good, do not get it twisted some suggestions I've seen truly are horrendous- but there are gems in amongst the boulders and landslides. Having the initiative to sift and find them, and then really look at them seems to be the problem. It concerns me deeply when Wildcard state themselves on their newsletters that ARK2 will be such a different experience from ARK1 that it now makes sense why they tried to package it in a non-refundable-at-time-of-play bundle with ARK1.5.Speaking from experience here- the best thing Wildcard/Snail have done for ARK, and I will never discredit them for it, is their Sponsored Mods program and hiring modders from the community for ARK and ATLAS. That alone has kept ARK where it is, as popular as it is, as fresh as it is and as revolutionary as it is. There is never a drought of \"content\" with ARK, as the modding community carries it on their backs each and every day. Official servers have their place, and I disagree with how they're being handled, but have no solution for that as I never was an official player for more than an hour at a time to remind me why I prefer modded servers. This is no discredit to the ARK art department, by the way, having looked through the maps in the Devkit- Aberration is still to this day is a visual and technical marvel, and many other maps made since then.There is a massive air of uncertainty for modders with ARK1.5 and 2. Logistically, the average number of mods on big unofficial servers is about 18- if each modder listing them on Overwolf decides to list their single mod for say $3 bucks, something very reasonable- times that by 18 and are players really going to be expected to play on a single server they MIGHT not even like, for $54 bucks? Maybe they discovered that server was good but had no players during their playtime- and then they find one in their region but, oh- there's 5 more mods on this server, there's another $15 to play on this one. Is a $69(nice) investment really worth it? I don't think so. Even at what has been discussed quietly behind closed doors with other modders at a $1 a mod price, so 50c to the modder, 50c to Overwolf/Wildcard- that's still, on average, $18 bucks to play on a server- this price is not including ARK1.5, or the DLCs for it- so what was the discussed \"Content creators/Modders can make a living!\" price...? Because when you take a step back from the buzzwords, there's a colossal black hole of a problem in the logistics.I digress, without any more information to go on regarding priced mods, we can only speculate. Back to what we know. Selling all DLCs and base game for ARK 1 that will functionally become a single player story mode and mod carried game without any warnings, notices or heads up to new prospective players is scummy as hell. There will absolutely be more delays before ARK 1.5, which will extend the lifecycle of the current game and DLCs, sure, but it's shady. The idea that ARK1 will become, in a sense, a showcase of my above statement about modders carrying the entire ARK community on their backs, and a solo story is fine- but adjust your listings so that people will know they will never experience ARK1 as \"Wilcard intended\" with the removal of official servers, that they will be playing with archived mods no longer receiving updates as many modders move over to 1.5, that they will have a limited playerbase to play with as most have gone to 1.5, that there is limited updates going to be provided due to 1.5- that there is no more official DLC... due to 1.5.This isn't even taking into their account their roadmap of the supposed finished content releases for ARK1.5 and ARK2 finishing up and starting at almost the exact same time. So we will have this problem ALL over again when the release of ARK2 is imminent, after it's delays. Players who bought ARK1.5 and all the DLC's will play on that for a month or two before ARK2 is released, then ARK1 is even more abandoned, and ARK1.5 will dwindle.I know many people will say- damn, this chick gives way too much of a ♥♥♥♥ about this game, you right lol. I don't like seeing a community be lied to, deceived, fleeced and taken advantage of. ARK is one of those \"coping\" games. If you spend any time with the community, it's a comfort. People come home from work or school and they will turn their brain off and just play. For hours. Not giving any thoughts to how ♥♥♥♥ their workday was, how badly they were bullied at school, how much anxiety they have or problems they are facing- ARK lets them turn off and have fun, it's an escape game. There's not many other games out there that keep people playing like ARK does, for so many reasons. But, the community is at the core of it.I wish Wildcard would pay attention to it.\t\t\t\n", "\n\r\n\t\t\t\t1,747 people found this review helpful219 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n988.8 hrs on record\n\n\n\n\nPosted: 2 June, 2015\nEarly Access Review\nTHIS IS A DAY 1 REVIEW AND IS SUBJECT TO CHANGE AS THE DEVELOPMENT CONTINUESPROS+ Dinosaurs+ Sprawling land that looks and feels absolutely huge+ Ease of Understanding (controls, objectives, etc)+ Engram System (I really dig it)+ Simple Crafting (It's a no brainer to use and understand)+ Early Access Perks (cosmetic items which are dinky but cool)+ Loot Boxes! + Taming and Mounts (epicness)+ Single Player (has been added!)+ Server Hosting Instructions have been shared+ PvE/PvP commands have been added for server hosting!CONS- Optimization: Needs massive improvement (which is happening! it's a priority with the Devs atm)- Not enough servers to meet the current population- Not being able to connect to servers/being kicked out of servers- Sound issues (music/sound not turning down properly even when adjusted) - Lag issues across the board. (Some experience it, some do not.)- Raptors (dude, they will own your butt unless you hit a hill or something. Not really a Con, they're just d*cks)What little I've managed to play I have enjoyed and really look forward to pitching a tent and staying a good long while but I'm not going to sugarcoat my experience either. There are a lot of problems right now but most of them are due to the Devs simply not pushing a bigger server test before they released -- They simply didn't anticipate the community that slammed their servers trying to play.I'm recommending it, but please keep in mind that this is a VERY Early Access game despite the fact that there is a lot about it that simply looks, and somewhat feels, polished (the dinosaurs are amazing). If you cannot or do not want to deal with the current CONS then you should wait at least a week and come back and check out the changes the Devs push otherwise I'm saying go ahead and drop the 24.89$USD and try your hand at playing.EDIT: 6/2 - Single Player and Hosting Commands have been added by the Devs!THIS IS A DAY 1 REVIEW AND IS SUBJECT TO CHANGE AS THE DEVELOPMENT CONTINUES \n", "\n\r\n\t\t\t\t5,711 people found this review helpful253 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n16.4 hrs on record\n\n\n\n\nPosted: 13 June, 2015\n├Professors Review┤Game Pros • Open World • Weapons ranging from spears, to rocket launchers, and turrets • Weather System • Multiplayer • Crafting system • Consistent updates • Day/Night Cycle • Ton of skills to master • Base building • Grouping/Spawning System • PvP/PvE • You can tame/ride dinosaurs • Steam workshop • Selfie/Orbit Cam so you can look at yourself • You can host Servers and have access to console commads • 3rd person (Can be accessed on servers that have it enabled) Game Cons • Requires a very decent PC to achieve stable FPS • Dinosaurs hover on certain terrain (Very minor) • Dinosaurs need pathfinding work • Chance of spawning on a hostile dinosaur, killing you upon spawn • WARNING: Hackers • Developers released DLC before the game was anywhere closed to finished • Terrible optomization for full priced game. Especially if you buy it knowing you have an outdated graphics card.  • Developers provide little or no customer supportRelateable Games • Rust  • The ForestConclusionARK is an amazing game, But rememeber that the game is still in ALPHA STAGES. It still has a ways to go before it finished, but it is headed in the right direction. It gets your heart pumping when you have a lot to lose, and you got a giant dinosaur chasing you down through a forest.Score65/100(If you found this review helpful, consider giving it a thumbs up!)UPDATE:Considering there has been a swarm of kids who don't know how to use the \"filter\" function on steam. All further comments will be deleted on this review. It is outdated, and they think they are bringing some sort of new information to everyone by saying it.F.A.QComplaint: \"Oh my god you only have 11 hours in game?? You don't know anything!!!!!Answer: If you need more than 11 hours in a game to decide if it's good or not. You have a problem. 11 hours is more than enough time to grasp concept of any game and see the mechanics.Complaint: You got paid for this review!! Fake account!!Answer: Please email the developers if you think i should be getting paid for this review. Id love to collect my money. And by looking at my profile for 5 seconds, you can tell its not fake.Complaint: You are giving new players bad input!!! omg!!!Answer: Well than you and those new players should learn how to use the filter function on steam and quit looking at reviews from years ago. That is your fault and your fault only.Complaint: If it's such a good game why don't you play it anymore huh??? :OOAnswer: Because I have a lot of good/newer games that I enjoy playing more. I don't need to continue playing a game just because it was good. I played other games and moved on.\t\t\t\n", "\n\r\n\t\t\t\t1,401 people found this review helpful950 people found this review funny\t\t\t\t3\n\n\n\n\n\n\nRecommended\n426.1 hrs on record\n\n\n\n\nPosted: 18 September, 2015\nEarly Access Review\r\n\t\t\t\t\t\t\t\tFirst review i wrote for a game but it had to be done!This game is like Crack! I've put a few hundred hours into this game and will probably put in a few hundred more. The devs are constantly pushing out new content (to a point where all the server maintenance is starting to become annoying haha) and they are very involved with the community trough reddit etc. Me and two friends of mine started off on a public server and had a really nice welcoming, A nearby chinese tribe gave us some stuff to start out and we we're hooked to the game pretty much instantly. There were some big tribe wars going on on the server but we were left alone.A few weeks later. we have a huge metal base with a 5 high stone wall perimiter around it and 5 more people joined our tribe. All the big tribes but the chinese one left the server and got wiped out. And it seemed peaceful At this point we already spent hundreds of hours taming different dinos (which each have their different role like gathering resources, carrying heavy loads, transportation, combat, you name it) and we eventually also tamed a few t-rexes and the stronger end game dino's. You name them all and because of their different tasks and stat builds you become sort of attached to your dino's as well which makes the game even better.One week later. Random (smaller tribes) are getting destroyed at night when they are offline. all the buildings blown open resources stolen and dinos killed. (take note some dinos can take over 10 hours to tame without kibble) At this point our base is more like a fortress we have over 70 organic turrets (think plants that split acid to hostiles) and 10 auto Gatlin turrets with loads of ammo in them. And an army of all kinds of dino's over 50 including 5 t-rexes varying from lvl 150-200+ A fully metal layered base with different compartments with different resources in every room (makes it harder for raiders to get everything since they have to blow up more walls) The chinese tribe starts putting in random text in global chat in capital letters including our tribe name. they have always helped us out we have made multiple trades with them for resources and called them allies. The next day. I log on.Everything is gone.... all our dino's are dead every wall is blown up all our turrets taken out. and our base is in ruins. Hundreds of hours of building up Taming dino's training them taking them out on resource runs and working together with a tribe....gone....The chinese tribe who helped us out from day one, Destroyed us.RIP.AtlasAbraxisNienTalonAeonMckittenMcCatMcMuffinMike the trikeBob the trikeArmageddonMorgothApocalypse AnkrahmunAnkaderpMuffinDeemDemonspawnSharkenatorLuluRammusRockeyStoneyScorpenatorMittenRappyOmegaMammutanWoollyMamenamenamenanCarnyBrontenatorAnd many more....That empty hollow feeling seeing your base in ruins and all your tamed fed and cared for dino's dead. I never had that before in a game.3 days later. we set up camp a few miles west from our old base. we had primitive tools and we were back to square one. But we we're determined and longing for revenge.... we broke down some old metal walls en made a small 4x4 room and set up the basic crafting stations. We had good contact with a few of the smaller tribes nearby who we helped out countless of times. now we needed their help. we secretly banded together against the Chinese tribe and they gave us some of the harder to obtain resources like crystal and oil.We started mass producing grenades.I went out at night with a stash of metal tools a crossbow, arrows and food and approached their base. The chinese built a enormous stone castle on the water where they stored most of their Egg farm dino's in. I went to the beach. swam underneath the base. found a spot where i could hack away at their stone walls to get inside. Found a good spot and made a start. tribe members brought over grenades and we blew though the wall. Out came charging a T-rex and 5 raptors at insane speed. we started backing off while firing at them. The water slowed them down. Called for the rest of the tribe to head over. we ended up fighting them on foot with primitive weapons. After a long fight we took them out one by one and eventually they all lay dead. That feeling of Vengeance is undescribable. but we weren't satisfied. We headed back into the dino pen and laid waste to their entire egg farm, we killed over 20 Stego's three mammoths and a few ankylo's, It was a massacre. Fueled by the loss of our pets and friends. Today, we're still fighting a guerrilla style war against the Chinese. Constantly on the move hitting them where they expect it the least.Only a handfull of people remain on the server but we won't rest untill we have taken everything from them... like they did to so many others.Apoligies for the grammar mistakes etc. English is not my native language.  \n"]