["\n\r\n\t\t\t\t304 people found this review helpful76 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n1.7 hrs on record\n\n\n\n\nPosted: 9 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCampaign is longer than modern warfare 3\t\t\t\n", "\n\r\n\t\t\t\t292 people found this review helpful8 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n26.3 hrs on record\n\n\n\n\nPosted: 16 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tif u wanna play bf get this and not 2042\t\t\t\n", "\n\r\n\t\t\t\t514 people found this review helpful9 people found this review funny\t\t\t\t19\n\n\n\n\n\n\nRecommended\n28.9 hrs on record\n\n\n\n\nPosted: 29 May, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treally fun. but theres alot of hackers. so never use quick search and always look for servers with the tags of [NO HACKERS] and [ANTI CHEAT] or look for servers made by DICE or OFFICIAL servers.\t\t\t\n", "\n\r\n\t\t\t\t543 people found this review helpful46 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n342.9 hrs on record\n\n\n\n\nPosted: 12 November, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBetter then 2042\t\t\t\n", "\n\r\n\t\t\t\t238 people found this review helpful55 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n7.7 hrs on record\n\n\n\n\nPosted: 18 February, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tits not 204210/10\t\t\t\n", "\n\r\n\t\t\t\t1,163 people found this review helpful45 people found this review funny\t\t\t\t96\n\n\n\n\n\n\nRecommended\n6.1 hrs on record\n\n\n\n\nPosted: 25 July, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe game is free on Amazon Prime for a while. If you take the code and enter it in the Origin Launcher, it is permanently yours.\t\t\t\n", "\n\r\n\t\t\t\t272 people found this review helpful4 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n175.3 hrs on record\n\n\n\n\nPosted: 30 April, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLast good Battlefield game\t\t\t\n", "\n\r\n\t\t\t\t259 people found this review helpful14 people found this review funny\t\t\t\t7\n\n\n\n\n\n\nRecommended\n61.8 hrs on record\n\n\n\n\nPosted: 25 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlay this and Battlefield 4 until DICE learns how to make a good game again.\t\t\t\n", "\n\r\n\t\t\t\t450 people found this review helpful7 people found this review funny\t\t\t\t36\n\n\n\n\n\n\nRecommended\n6.1 hrs on record\n\n\n\n\nPosted: 11 June, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game has a breathtaking atmosphere that is not found in BFV.\t\t\t\n", "\n\r\n\t\t\t\t319 people found this review helpful88 people found this review funny\t\t\t\t22\n\n\n\n\n\n\nRecommended\n208.7 hrs on record\n\n\n\n\nPosted: 29 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWhen I first played Battlefield 1 it literally sent me to the hospital, cause you’re supposed to seek immediate medical attention if your erection lasts longer than 4 hours.This is easily one of the most badass games  in history. The music, the landscape, the gunplay, the hit register and the satisfying kill effect, EVERYTHING is just amazing. The last true Battlefield game. I enjoyed every second of this amazing game.  BF1 isn’t fully historically accurate but it is historically immersive. The war stories in this game genuinely made me emotional sometimes and I’m not ashamed to admit that. As someone who is more on the “historical accuracy” side of games, I can say without a doubt that Battlefield 1 did an incredible job. Hell, they were even able to be diverse without pandering to anybody! The 1st Russian Women’s Battalion of Death, the Harlem Hellfighters, people from French-occupied northwestern Africa, the list goes on. What sets this game’s inclusivity of a variety of people and groups from other games is that it does so when it has a reason to and is still accurate to the time and setting. That’s one of the main reasons why Battlefield 5 pissed me off so much. Instead of a British woman with a prosthetic arm wielding a cricket bat in WW2, why not include Lyudmila Pavlichenko, aka Lady Death, a female Russian sniper who had 309 confirmed kills? What about the French women who fought? They were in extremely small numbers, but they were a thing. Historically accurate inclusion is ♥♥♥♥♥♥♥ awesome, and I love when games do it. But inclusivity for its own sake is terrible and it cheapens said character’s presence in the game’s setting. Even the DLC are fantastic. I remember how amazing I felt when the “for the Tsar” DLC came out and I first played it. I have never seen people fight so hard to the death in a video game without a whole lot of rage. It was amazing. I felt like I was part of the Russian revolution. Please do yourself a favor and buy this game.9/10Only gave it a 9 ‘cause the 1 is already there…\t\t\t\n"]