["\n\r\n\t\t\t\t482 people found this review helpful34 people found this review funny\t\t\t\t34\n\n\n\n\n\n\nNot Recommended\n1,967.1 hrs on record\n\n\n\n\nPosted: 20 April, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHi-rez is the worst EVER. Listen to this story... I got my account stolen, I contacted them and prove them I am the real owner of the account. I've invested more than 1967 hours on this game. I was a smite player since Beta. I got my account back which was great, however after logging on my account I got an e-mail saying that my account was banned due to SHARING/SELLING... Like, really?I contacted them again but they said they will not provide any support as they have ''determined'' that's it. So, if you like the game you can play it, but I hope nothing serious happens to you, Hi-Rez won't do ANYTHING for you.So guys this is how you could lose an account almost a decade old.  Thanks for nothing Hi-rez.\t\t\t\n", "\n\r\n\t\t\t\t513 people found this review helpful55 people found this review funny\t\t\t\t26\n\n\n\n\n\n\nRecommended\n81.1 hrs on record\n\n\n\n\nPosted: 18 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tslipknot\t\t\t\n", "\n\r\n\t\t\t\t600 people found this review helpful41 people found this review funny\t\t\t\t51\n\n\n\n\n\n\nNot Recommended\n1,072.9 hrs on record\n\n\n\n\nPosted: 25 August, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKeep in mind that I have played Smite for 4 years now, these Steam hours are merely 1/5 of my whole playtime.I've spent about 2000 euros on this game, and while I don't regret any of those purchases, I really can't recommend this game in this state. Smite is not the problem, it's a good game. Hi-Rez is the issue.If you enjoy basically non-existent lore, cash-grabs and rigged systems, cancerous matchmaking, unbalanced and clearly developer-favored characters, bugs aplenty, one completely incapable and utterly useless CEO that holds back the whole department and one of the most toxic communities that even rivals Overwatch's community, Smite is your game.Back when I started playing, Smite was still in open beta and probably my favorite game for years. It was diverse, set itself apart from all other MOBAS through its 3rd person perspective and tons of different maps. It also had that great concept where you could just buy a skin that you wanted. But then Hi-Rez published it's first chests. There were only 2 exclusive skins, but they quickly realized how much money they could make off that garbage system. In the following years, 95% of all new skins were exclusive or limited - put in cash-grab events or chests. There was a time where there wasn't a single directly purchasable skin for 6 or more months. To this day there are still gods with well over 5 skins, all of them exclusive.Let's put this into perspective: There are literally 128 types of chests in this game. They range from 200gems to 400gems, so about 3,20€ to 6,40€ respectively, per roll. As a new player, you have 0/55 items from the Curiosity Chest. Each roll costs 3,20€. The chests are also rigged, not joking here, which means you'll get the skin at ~53/55, which puts you at a staggering 170€ just to get that one skin you wanted. And every single season, the grande finale of cash grabs, the so called \"odyssey\". Smite teases one \"Tier5 skin\", a skin that changes basically everything a god has to offer in terms of design. It's comparable to LoL's ultimate skins, which cost about 20€. The only issue here is, that you can't directly buy the skin. You have to get a ton of other exclusive skins you probably don't even want for that one T5 skin that's barely worth 20 bucks. You'll lose about 100€, if not more, in this great \"odyssey\", as Hi-Rez likes to title it. The odyssey is also often accompanied by several \"adventures\". Adventures are basically one sort of RPG where you choose one god and kill some monsters. The catch is, this map doesn't change, the map always remains the same, and all rewards are either locked behind a paywall (who would have guessed) or a tedious grind-fest that'll probably take millions of your brain cells and about 2 weeks of your life. I'm not even going to talk about the recent \"adventure\", because that's just a pure joke.Now, bugs. Smite suffers from so many bugs, many of which are present since closed beta. Some of the more recent ones are so gamebreaking it's honestly a joke that they're not fixed yet. First off, In 99% of all matches, lobby chat just doesn't work. It won't even appear in your chat box. You can't communicate with your teammates while you pick your gods. Second, also in 99% of all matches, one or more gods won't load in your stats screen. Which basically means, that, if you press TAB, it won't list that particular god. You can't see their items (which in turn means you don't know how to build against them), you can't see their relics, not even their score. Their kills  aren't even listed for your team. You basically have a ghost. Also, sometimes your game just freezes on defeat or win screen and just crashes alltogether. Present since beta, they're just addressing it, after 4 years.While we're at it, I just want to point out Hi-Rez' favoritism, regarding both gods and modes. As you would expect with gods, there are just certain gods which are blatantly overpowered or just unfun to play against. These can usually be identified by looking at their skins, because they usually have billions. Examples would be Loki, Neith, Hercules or Nox. These are not necessarily overpowered, but have heavily bloated kits which make them almost unkillable and totally unfun to play against. Now modes. Like I said before, Smite has a multitude of gamemodes, many more than Hots, LoL or DotA. Now, the issue is, the whole game is balanced around the \"main\" mode, Conquest; the typical 5v5 tower-and-minion-push mode, which every moba has. In my 4 years of Smite, I have played 18 matches of Conquest. To compare, I've played over 2000 matches of Arena (5v5 without towers), 600 in Joust (3v3), 500 in Siege (4v4) and 900 matches of Clash (5v5 mix between Conquest and Arena). I never really found the ambition to learn all 4851 rules of Conquest, so I stuck to the other gamemodes which barely required 2 of my 5 braincells. Hi-Rez just tries to force Conquest down your throat at every single possible moment. IIRC, one of the design-leaders even talked about removing other modes so people would flock to Conquest. This alone truly catches the sheer incompetence of Hi-Rez's executives. Most players even stated they would quit before they'd even touch Conquest.At last, Smite's community. I'm more of a casual and average player, but every single match you're plagued by atleast one incredibly inept (most of the time they're low level because matchmaking sucks) or toxic player, sometimes even both. The problem is, that just like in many other games, most players think way too highly of themselves. But Smite players take the cake. They not only play gods, they think they are gods. The ultimate pinacle of garbage this game has to offer can be found on reddit. You can't criticize one single god without some white knight showing up and defending their true love like there's no tomorrow, because \"muh waifu\". It's one of the most toxic communites you'll ever see in any videogame, so rev up these mute buttons. Just be aware that you can't mute incompetence. Also, the matchmaking is so ♥♥♥♥♥♥♥ bad that I have a legit 85% winrate this season. Every game balances the winrate around 50%.In conclusion, I'm fascinated that both Hi-Rez and Smite are still alive. Hi-Rez ran so many good games into the ground, gunned them down in the streets or left them to rot in their bug-infested basement, it's a miracle that the company isn't bankrupt. Play this game if you want, but you'll be disappointed in the long run, which is the worst kind of disappointment. Many years I've defended both Hi-Rez and Smite, but at this state, it doesn't make any sense to. I've had my fun, I don't regret a single penny or minute I've spent, but I'm about done.\t\t\t\n", "\n\r\n\t\t\t\t354 people found this review helpful206 people found this review funny\t\t\t\t18\n\n\n\n\n\n\nRecommended\n1,169.0 hrs on record\n\n\n\n\nPosted: 30 June, 2022\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI hate this game\t\t\t\n", "\n\r\n\t\t\t\t298 people found this review helpful78 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nRecommended\n850.4 hrs on record\n\n\n\n\nPosted: 19 May, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbefore i played smite i had smal pp now i have smal pp and slipknot\t\t\t\n", "\n\r\n\t\t\t\t688 people found this review helpful298 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n87.4 hrs on record\n\n\n\n\nPosted: 28 September, 2015\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe MOBA for people who don't like MOBAs.\t\t\t\n", "\n\r\n\t\t\t\t187 people found this review helpful66 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n2,024.3 hrs on record\n\n\n\n\nPosted: 23 January, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ti play this everyday but i hate it\t\t\t\n", "\n\r\n\t\t\t\t206 people found this review helpful225 people found this review funny\t\t\t\t35\n\n\n\n\n\n\nRecommended\n414.0 hrs on record\n\n\n\n\nPosted: 16 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t1 Week on Smite:Healthy and happy.Solid job with happy wife and kids.excited to learn a new game and have fun with friends.1 Month on SmiteI fall asleep to weak3n hoping to improve gameplay.Wife starting to notice im spending a lot more time on pc.Called out of work when the new season came out.1 year on smiteMarriage in shambles.Wife doesn't understand I should be diamond but im silver in elo hell ( im actually just really bad )Canceled my sons extracurricular activities, new skins came out.5 years on smiteWife took kids and left.All my time is spent on smite or r/SmiteNSFW.ive forgotten the feeling of grass.still silver.10/10 \n", "\n\r\n\t\t\t\t290 people found this review helpful6 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n628.0 hrs on record\n\n\n\n\nPosted: 31 May, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFree to play, without constantly being bugged with microtransactions. Overall it is a solid game, and with the number of gods it takes quite a bit of time to really learn how their abilities can work together. I would consider this game relatively easy to pick up and play but it will take you some time to really master the finer details. Give it a shot, its free and if you happen to hate it you can just delete it.\t\t\t\n", "\n\r\n\t\t\t\t100 people found this review helpful50 people found this review funny\t\t\t\t4\n\n\n\n\n\n\nRecommended\n133.9 hrs on record\n\n\n\n\nPosted: 29 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit makes me wanna die slightly less then league does\t\t\t\n"]