["\n\r\n\t\t\t\t753 people found this review helpful4 people found this review funny\t\t\t\t91\n\n\n\n\n\n\nRecommended\n2,614.0 hrs on record\n\n\n\n\nPosted: 29 May, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLook, you can just see how much I've played this game to know that I like it. It's a good game with a great free trial you can play if you want to get a feel for it. You've probably heard it all before from word of mouth so I'm not going to try and sell it for you here just know that it's really good.What I *am* going to try to do is let you know about a few things before you buy that I don't see a lot of people telling new players.First, and maybe the most important: *If you buy the game on steam you can only buy the steam version of the expansion*- What does this mean?If you buy FFXIV from Square Enix directly you can only buy future expansions from them and only them. This means that if steam is having a sale on the expansion you cannot participate in it. The same goes with Steam. If you buy the game on Steam you can only buy future expansions from steam and not Square. This can be frustrating as I've seen people buy their game from the wrong place and waste money. Double check where you bought your game first by going to your account on Mogstation and seeing which version of the game you own.Second, there are two types of subscriptions: Entry and Standard subscriptions are different- What does this mean?There are two types of subscriptions. The first is the Entry subscription which is 12.99 USD and is 30 days long. This gets you one character per sever with a total of 8 characters over all. I'd say go with this for your first month subscribing and if you still like the game you can move up to a standard subscription.The second is the Standard Subscription which, starting, is 14.99 USD. This one has 8 charcters per sever with a total of 40 overall. With a standard subscription you also have the option to purchase multiple months at a time. This can save you money in the long run especially if you are really into the game. There are also little additions you can get like an extra retainer for a little fee each month but this is completely optional as it's just a form of inventory management. Third, for those who are used to WoW: You can play every class, and every job, on one character- What does this mean?Every character you create can swap classes by changing weapons. Meaning, you can play anything you want when you want to. If a new class comes out you only have to be at the level the class requires, you don't have to create a whole new character for it. This was a big draw for me as swapping characters all the time was a real pain. Yes there's still some grinding involved as you'll have to level up that class as well now, but you don't have to always start from square one. If anyone who used to play wow is reading this, name changes and race changes are also way cheaper from what I remember them being in WoW. A name change is 10 USD on here and a Fantasia, which is a way to completely makeover your character changing, race, gender, and nearly everything else save the name, is also 10 USD but can also be bought in packs of 3 or 5 that can save you some money.Overall it's a good game but these a just a few things, off the top of my head, that can help people new to the game. If you're reading this I hope you have fun at least trying it out.\t\t\t\n", "\n\r\n\t\t\t\t1,126 people found this review helpful404 people found this review funny\t\t\t\t90\n\n\n\n\n\n\nRecommended\n59.0 hrs on record\n\n\n\n\nPosted: 19 July, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRegistering your account is the hardest quest so far\t\t\t\n", "\n\r\n\t\t\t\t996 people found this review helpful7 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n6,307.6 hrs on record\n\n\n\n\nPosted: 5 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSo I have bought this game on 05/25/17 and have been only playing this game till 06/04/2017 with an accumulate of 139 hours.Update: 06/22/2017 accumulated about 235 hours and I have payed a month of my Subscription :). I am reupdating this for the Summer Sale for people who want to try this game and also for the StormBlood DLC update. Updated 5.5:  09/06/2021 up to date with ShadowbringersPositive:-Completly Noob Friendly-Tons of Content with two DLC's (Heavensward 60)>(Stormblood 70)>(Shadowbringers 80)-Chocobo,Chocobo and Chocobo racing.-The brilliant soundtrack is very unique and captivating.-Multiple classes that this MMO is unique with is having 1 character and being able to switch classes- The one major thing that also makes this unique, is that in FFXIV, there is no rush in this game. You can be what you want to be and you are not forced to do anything else.Community:The community is amazing in certain perspectives that is actually more better than most MMO's. What makes this community so unique is just the cycle of players that are willing to help new players. Yes this is normal in all MMO's but in FFXIV we aren't forced to help new players but instead we choose to. That;s what makes this community so nice. Not all Communities are perfect or imperfect but the majority of this one is decently kind.Heavily Story Reliant: Most MMO's always fail to captivate the player of the story in general. FFXIV is very unique in it's own standpoint that the developers actually put so much development and depth into this story that just makes you enjoy it . Also being that this is probably the longest story in all Final Fantasy Genres. This is probably the only MMO that can potentially make you cry just from the story. That is how good it is.Dungeons/Trials/24 man raid/ Hardcore raids:Dungeons: Pretty generic even in this MMO that there isn't really much to say about honestly. Maps are very unique in it's own sense even the mobs and bosses with their unique skills. Though each map will have it's soundtrack included.Trials: Trials are Bosses that you will face during the Main story or a side quest. You will be with a party of 8 facing this trial. Every Trial is unique with it's own soundtrack. Though trials are not difficult, there are Trials:Extreme which increases the difficulties making it twice as hard.Alliance raids: 24 man raids are pretty much 24 players clearing a dungeon with multiple bosses. It's not difficult but you will die a lot. These 24 man raids also consists of the Nier raid in the most recent Shadowbringers update. Savage raids:These are your hardcore raids. They are about equivalent to Mythic raids in WoW. But, you are in a party of 8 of what you do is important. Everyone has to work together and synchronize too be able clear this content. The amount of time varies but in the most extreme hardcore raiders it can take them a 5-7 days to clear but for normal players it can take them 2-3 weeks.  There is also a 48 man savage content that released in the Eureka content.Ultimate raids: Thought savage was hard? There are currently 3 Ultimate raids. Ultimate raids make's savage content look like a joke. These are for the hardcore players that want to take it too the next level. Ultimate fights can last for about 15-18 minutes. Each passing second or minute, there is always a new mechanic that is very unique. This type of content take up to possibly more than 60+ hours. Being it can take you more than 1-3 months just to clear 1 ultimate. Though yes it's hard. But that is what makes this so much fun. The reward is that you will get a ultimate title and a unique ultimate weapon. But it's worth it.Graphics: Even with a Low end PC you can still run this game smoothly. For Medium-High End PC. A lot of people tend to not like this aesthetic of graphics because of the anime type graphics but it really seems to fit.Free Companies: Aka guilds- Finding a very dedicated FC that is willing to work with their own community is fun. Being able to host events and sometimes do raids and obtaining benefits makes FC's worth going to. Joining a FC or getting into the community can help you not get bored but can significantly make your FFXIV experience better.Enternal Bondings:  So this is basically a Marriage system that can help boost the XP gain of two of the couples are together in this game and a Chocobo and YES there are actual relationships between players but don't try to take it serious as a relationship game.Housing: You can have you're own house or a FC house that are limited in each server.  There are even crafters that can craft housing items or just be able to have you're own garden. You have your own section of an area where you would run into other players that could be your neighbor or another FC.Golden Saucer: Pretty much a land of Mini-games that has good decent amount of games to play like Chocobo Racing or Card games. People actually seem to enjoy this content that they sometimes live in it. They have unique glamours or mounts as rewards.Gear: Gears can be obtained from doing raids, dungeons or crafting. Every gear in this game unique. There are people who actually farm gear just for glamour that just looks really cool too be being very gorgeous or just very funny.Eureka: Pretty much Legendary weapons or armor that have their own signature look and stats that can be used for endgame content. This usually takes about 1-3 weeks to be able to obtain 1 weapon but can vary on the time.  They are very grindy content.Classes: You will have a single character with multiple classes to change into.So this means you do not need to make another character. There are 10 DPS, 4 Tanks, 3Healers, 7 Crafters, and 3 Gathers. Each job is very unique in terms of playstyle. You can be good with a specific class. But you will see a huge difference in terms of skill of the class you play too someone who plays the same class as you. This means even though you know your class. You haven't mastered it being there are rotations.Leveling: Leveling: Leveling can completely vary on the methods that players use. But it can probably take about 1- 3 weeks or maybe less to max a DPS/Healer/Tank class. For Crafters and Gathers it can take probably a few hours to 2 weeks that can vary. Leveling doesn't feel slow or fast. It's just very moderate.Crafters/gathering: Probably the most unique and yet rewarding content. There are tons of crafting recipes and gathering. Compared to other MMO's where Crafting and gathering are just sub-classes. In this game they can be a main class for players. Each crafter's are unique. Culinarian makes food for buffs even raids. Carpenter's can make housing materials. These are classes that can make you money and gear and being a crafter and gather is like playing a different game too where you can put infinite hours into this.Negatives:Monthly Payment: This is a subscription based MMO. But one thing in mind is that, if you do buy the steam version, you can purchase subscription with steam credits But this is how the game is still alive and healthy.The story length: You will feel beyond rushed. The story is good and it's amazing. But too other players they want to reach the endgame content. If you are the type of player that only wants to play endgame and do raids. Then this is probably the biggest.Conclusion:You are not forced to follow a linear path in this game. You can be what you want to be is what makes this game feel so alive. You can be a hardcore player or a casual but you are not forced. This game is started to become more mainstream now and it's always great to have new players. To be honest this game feels like WoW when it became popular when Wrath of the Litch King was released.(Not a hate rant). This game feels like it has more content than GW2 endgame. Both are amazing MMO's but, Final Fantasy 14 feels like the MMO that filled the void of my heart from what an MMO should be.Rating: 10/10\t\t\t\n", "\n\r\n\t\t\t\t608 people found this review helpful12 people found this review funny\t\t\t\t83\n\n\n\n\n\n\nRecommended\n8,998.5 hrs on record\n\n\n\n\nPosted: 28 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI feel like I can write at least a small review with 5 thousand hours in the game so here we go. Tldr: It's great, the best mmo in my opinion out there. Good music, dungeons, story and awesome community. Rocky start but starts to get better after the first expansion.Alright so let's start with the base and go up. A Real Reborn, the base game you get is easily the longest and grueling at times. Quests that make you go fetch things from A to B, talk to this person etc. However, it still has some good points.     -The experience you get from doing the main story quests can keep you up to date for dungeon requirements. Some even give you gear so you don't need to throw your gil (In game currency) at the Market Board (player shop).    -Before the first dungeon you get the choice of having a tutorial on the basics of your current role (Tank, Healer or DPS.). Each training focuses on the general tasks your role does. The rewards you get are gear that lasts until lvl 20 and a ring that grants you XP until lvl 25 or lvl 30.   -When you reach lvl 20-ish it starts to open up its world by having you travel around the continent. This is where you get some world building lore, the struggles of each nation, how the events prior to your arrival transpired and affected them along with some politics.    -It's beginner raids are new player friendly. Instead of having 8 people you have 4 which can be a good thing. There are other good points out there but I will let you decide on them. Now, with ARR done, let's give a look at what is to come. Spoiler free of course.    The first expansion, Heavensward, introduces new things to the fray like mechanics, locations and it starts the addition of flying in each zone with whatever mount you want! Aside from those it features an engaging soundtrack that changes with each phase making the fights more fun and epic. Worthy of the title you have been bestowed upon back in A Real Reborn. What it also brings are 3 new classes: Dark Knight, Astrologian and Machinist. All three are accessible once you start the Heavensward expansion but start at a lower level than its entry level.   -Dark Knight: A tank class that is seen edgy due to its use of \"inner darkness of your soul\" but a fun one and useful.   - Astrologian: You use the stars and tarot cards to heal and buff your allies. Another fun class, especially if you enjoy multitasking.   -Machinist: A ranged physical dps that uses guns and turrets. It's fairly simple to play as and can get powerful later on. Heavensward is seen as one of the best of the currently 3 expansions because of its story and I am inclined to agree. After finishing A Real Reborn, Heavensward will leave you very satisfied with how the game evolved. But it does not end there.With Heavensward out of the way, Stormblood! Like before, it adds new mechanics and music along with two new areas, both having zones that you can enable flying in. With it comes 2 new classes this time, both DPS.   -Red Mage: Your fencer mage that uses both black and white magic to fight and support their allies. Heal and bring back your allies like a semi-healer in battles or focus on dealing damage while looking stylish! It's part of their persona.   -Samurai: Your sword wielding fighter from the Far East, which some of you might laugh at because of its name. Simple in gameplay but once you reach a higher level and learn its gimmicks you can see yourself dishing out large amounts of damage.Stormblood is considered the good-ish one of the trio. I see it as an expansion that deviates a bit from the action of Heavensward and goes deeper in terms of other topics. And now, the latest expansion. Shadowbringers!This expansion was one that left many players with their mouth agaped, sat at the edge of their seat and with their heart clenched. I shall leave the reasons to you! Minor advice: Buckle up. Things go to another level. As before, new zones with unlockable flying. Shadowbringers also brings to the fold 2 new classes: Gunbreaker and Dancer. A tank and a DPS.   -Gunbreaker: The small brother of Warrior that focuses on swift movements and big damage. It's skills are designed for fast gameplay, the player having 3 sets of combos: One for gathering \"Cartridges\" followed by a combo that uses a cartridge and another one that uses the 2nd combo. Confused? So was I but it comes around. A good description would be: Devil May Cry but tab target style.   -Dancer: It does what its name implies. With a combo that is half dependent on RNG, the dancer swoops in with its buff by performing steps with their Dance Partner, increasing both of their damage as the timer goes down. At later levels you can buff the party members around yourself, also increasing their damage. With their Dance Partner they can buff and heal each other and those around them. Now for another part of this review. You have noticed that I have mentioned repeatedly that you can fly, yes? Well that is because I have been saving words for this segment! World Building! Each expansion gives the players new elements to the lore behind the universe of FFXIV. From the customs of each area and its people to civilizations long past to heroes of eld and gods once worshiped. The game introduces this through its story and many other quests. Questing! From Heanvensward and onward there is a trend that has been established with how the Main Quests work. It's pacing can be like this: First quest with the entry level is the introduction of the expansion followed by the next level being a dungeon you go in. The next quest can involve a solo instance where you fight along side NPC's in a revisited dungeon or a specially made area for it. And then another dungeon or trial. The cycle repeats like this to keep the player engaged and not go through another ARR slogfest.Music!The music is by far the best in my opinion. The composer, Masayoshi Soken, has a clear grasp on what to implement in this category so the player can enjoy doing the content. From slow motifs to full on pieces in which make you question yourself if you are in a battle of life or death or at an opera/concert. Many fall in love with the music in it and choose to do content because of it! Myself included. Community!It has been said a lot of times that the community of FFXIV is really welcoming and well mannered. I stand to agree to that but I won't let it be sugarcoated that much. We have problems like many other MMO's and games that have you play with real people have. If I would be correct to assume, the reason behind this big point that has been brought so many times is because we choose to be kind because the developers are also kind. It's a paying forward sort of deal. At least that is how I see it.And that is all I can think of. If you have read this far, thank you for your time! I hope this review will be at least helpful in getting an image on how the game is like and if you want to try it. Hope to see you lads and lasses in the game! And most importantly, have an awesome day!\t\t\t\n", "\n\r\n\t\t\t\t390 people found this review helpful86 people found this review funny\t\t\t\t42\n\n\n\n\n\n\nRecommended\n7,413.3 hrs on record\n\n\n\n\nPosted: 31 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYou will either burn out in Arr or become a walking talking billboard for the game.\t\t\t\n", "\n\r\n\t\t\t\t1,746 people found this review helpful667 people found this review funny\t\t\t\t126\n\n\n\n\n\n\nRecommended\n1,599.6 hrs on record\n\n\n\n\nPosted: 16 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAn MMO so good they had to stop selling it.\t\t\t\n", "\n\r\n\t\t\t\t816 people found this review helpful17 people found this review funny\t\t\t\t100\n\n\n\n\n\n\nRecommended\n491.2 hrs on record\n\n\n\n\nPosted: 13 June, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPlayed WoW for 16 years or so. Switched to FF finally been playing past couple days nonstop. Dont regret a single minute of it. Cant wait to start the actual expansions though. Already recommended to all of my friends that play WoW.!!Update!! 100 Hours more played later. Im completely addicted. Still have yet to hit the first expansion. Just content everywhere I look. I cant remember the last time I genuinely woke up or got home from work and was excited about actually sitting down continuing an adventure on a game or just to have pure fun and enjoyment. One of best communities I have had the pleasure of starting to be a part of as well. Experience is still amazing for me so far. And I know its just going to get better and better. Cant wait!!!Update!!Well i am currently sitting at 340 hours or so played now. Nothing has change I am loving this. I actually just hit the first expansion Heavensward and good lord they were not kidding. Dont get me wrong i didnt mind a realm reborn... but wow just wow did they step it up in the first expansion. the cut scenes the first new Main city i am obssessed and in love with and the music that comes along with it. Most of the cast from ARR has new voice actors and damn they are good. I just scratched the surface of Heavensward and with it already shocking me how good this is getting I cant even imagine Stormblood or Shadowbringers. I can honestly say even heavensward has put WoW shadowlands to shame in all terms of story especially and cut scenes even landscape and music its just overall beautiful and being the big game of thrones fan I am the dragons and all that feel to it is just great. Its definitely not a suprise why they add heavensward into the free trial because they know after you touch that expansion you wont want to stop! :) Overall Take it from Me a WoW 16 year vet even with a WoW tattoo irl on my arm i lived breathed and slept WoW. I have yet to even miss a single patch or anything. Even with 9.1 that just came out yesterday while sitting here playing this now. I dont even question myself for a single second about going back anytime soon or resubbing. I am having an overall amazing experience so far and it has been keeping me completely busy and satisfied. I can honestly say this is the very first game in my life that has kept me away from World of Warcraft and for me thats a huge statement and win.415 hours in or so. I should of easily been at Stormblood by now but i just keep getting side tracked into doing everything else in the game. Been leveling the Dark Knight up to 60 now and Finishing heavensward on him. Amazing class. Super fun story for the class as well. Machinest was my main until I recently started going Dark Knight crazy. The instant dungeon ques for tank are also a plus! And damn the Dark Knight gear just looks so good especially swinging around the big two hander feels so good as well. I should be hitting Stormblood soon though for sure as long as I dont get side tracked anymore. But honestly Im still genuinely happy and just having a blast playing this game honestly the longer it takes me to get to the other expansions the better. It is nothing like WoW where its just a strict grind fest as fast as you can to end game. Nah. Its just completely enjoy the game and have fun and do whatever you want and take your time!. Good stuff.!!Update!!Finally Finished Heavensward and Ill put this as simply and quick as I can. Amazing Story. Amazing Music. Just hooks you in and makes you connect with every character in the story it felt like I was just watching and getting to know every character like a full season of a show that just hooks you in. Some cutscenes were just an overall thrill and joy and by the end was hitting me in my feels haha. Simply just landed a spot in my top 10 stories of video games that I have experienced in my life.!!!!!UPDATE AGAIN!!!I am currently in the beginning stages of Stormblood still just chilling doing everything in the game and just having fun in general and damn the new Stormblood cities and music im in love lol.\t\t\t\n", "\n\r\n\t\t\t\t284 people found this review helpful2 people found this review funny\t\t\t\t48\n\n\n\n\n\n\nRecommended\n4,043.1 hrs on record\n\n\n\n\nPosted: 26 January, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI play MMOs. It's my thing. It's what I like to do. I've tried many. Most disappoint me. This one did not, as you can probably tell by my ever-increasing total playtime. The game most comparative to Final Fantasy 14 (FF14), to many people's annoyance, is World of Warcraft (WoW). They are both 'theme park' style MMOs, and they both use simple, action-based, 'TAB-targeting' combat. The similarities are vast, I can assure you, but they are also obvious. I can split hairs, talk about WoW's reactive, fast paced style versus FF14's slow, prepared style, but to anyone who has played both at the higher levels, it's fairly self-evident. The games are very similar as massively multiplayer online role-playing games, with simple mechanics and easy-to-enter natures (as well as raised cost-of-entries).I think one of the only things I can offer to the discussion involving this game is my perspective. I have experienced as many aspects of this game as I can. I played the story attentively, I watched every cutscene, I leveled a healer, tank and a dps to 80 (the current max), and I gathered and crafted for way too long. This is a weird game. The community is strange, in that they are as helpful as they are awkward. People will gladly help you for nothing, then ask that you visit them in their home (which is often just a hot tub next to a bed). They have odd customs, like saying 'o7' at the start of dungeons (which is supposed to be a salute). Everyone cares how they look, but doesn't care what you think about how they look. Playing songs in the plazas, erotic roleplay in the alleys, and bots asking you to buy gil are common sights. The story is set into whats called the Main Scenario, split by expansion. You have to play through all the present and past story to catch up. This is incredibly time consuming. If you play like I did over the last year, it is unlikely you can get to Shadowbringers (the current expansion) within one month of game time. Luckily, the free trial is extremely good now. They recently changed it to be that you can play through the initial release content (A Realm Reborn), all for free, forever. Speaking of A Realm Reborn (ARR), it's painfully average. The story is as well paced as paint drying, and because of the way item/level scaling works, there is no meaningful challenges. Granted, there aren't supposed to be, but it is disappointing. The plot comes to a grinding halt a number of times, and sometimes there isn't even a plot, just you doing weird, forgettable jobs for weird, forgettable people. If you tried this game and left because of how slow ARR is, I can't blame you. It's a slog. But if you stick around, the last arc of ARR was relatively enjoyable, finally arriving at some of the crazy style Final Fantasy is more known for. After ARR, (and after you pay for the game), comes Heavensward (HW), the Wrath of the Lich King of this game. I cannot express to you how surprised I was by the sharp quality increase here. It's remarkable. The story picks up in a new kingdom, dropping most of the old characters for a story about an oncoming dragon war, set in a genuinely interesting nation. The first time I truly took notice of the music in FF14 was when I entered this expansion, it's phenomenal, and consistently so throughout. The quests become stripped of tedious 'Slay 10 _', and are paced very well, keeping a feeling of tension as you progress that was never present in ARR. If you've ever heard someone say 'stick around FF14, it gets good', this is why. Unfortunately, it is followed by...Stormblood (SB). If Heavensward is like WotLK, then Stormblood is like Warlords of Draenor. Everything I just praised HW for took several steps back during this story. Old characters are brought to the light screaming and kicking, some given literal rewrites to force them to fit in, and newer characters struggle to make an impact. The music fails to keep me engaged as well, matching equally uninteresting environments Plots are jump-started, then the brakes are cut as they tumble down a hill. While the questing is still better than ARR, it's not by much anymore. The truly cool moments are so few and far between a deep, deep ocean of truly unfulfilling questing. It's really unfortunate, I really liked a few of the characters they introduce here, and 2 of the zones they introduce are among the best the game has, with a small plot about a rebellion I truly enjoyed. Those aspects are just mashed inside of a larger, more boring plot about a different rebellion.Fortunately for me, Shadowbringers (ShB) was everything I hoped for. If HW is WotLK, and SB is WoD, than Shadowbringers is, I guess, kind of like Legion. Honestly, the WoW expansion comparisons start to break down here. If you are looking into this game, at some point you probably heard that Shadowbringers is good. You probably also have some healthy skepticism and some tempered expectations. I'm here to assure you that Shadowbringers is not so good that it's worth playing through all of what I just described, AND a $60+ price tag. But it's pretty close. This expansions reworks a lot of old characters and plots into a surprisingly touching and insightful story, making one of the most trite and lifeless antagonistic forces in the game into strangely sympathetic villains. The themes through the story are strong, and conveyed in honestly intuitive ways. The music is unbelievably good. One or two areas have some weaker themes, but the dungeons and raids have absolutely stunning scores. The area designs are lacking, in my opinion, but they are easy to traverse, and, well, it's very subjective. A few closing remarks, organized in no particular order.The class design and feel is pretty good. Each class feels very distinct, and the meta is tight, with, and I know this is hard to believe, every class performing well. It's very well balanced on the PvE side.The PvP in this game is, and this is being generous, awful. It's poorly balanced, it's map design is shoddy, and it's not very rewarding in terms of character progression, if at all. It can be fun in short doses because it is chaotic, but playing it anymore than that is frustrating. The fashion in FF14 is one of the main aspects of the players who stick around. It's easy to track down what you want, and there is a wide variety of styles to pursue.The cash shop, also known as the Mogstation, is quite prevalent. Not in the sense that you are forced to visit it, or that you have to to get an advantage, just that many, many people use it. Premium costumes and emotes are frequent, as well as sales. It doesn't bother me much, but I mention it because it can be annoying to see someone wearing a cool set, only to discover it cost them $12. The account management is awful. The website to manage your subscription and account details is ancient, slow, and prone to problems. The customer support as well is slow, but I have found them to be at the very least helpful and patient. Also...The Steam version of this game is prone to account issues. I recommend the stand-alone version (which actually goes on sale more often). It's too late for me in this regard.All and all, I find Final Fantasy XIV a rewarding way to waste my time. I often find myself just standing in places, talking with my friends and/or strangers I happen to meet in-game. I recommend this to anyone who wants a relaxed MMO with a flair for the dramatic.\t\t\t\n", "\n\r\n\t\t\t\t328 people found this review helpful29 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n1,859.4 hrs on record\n\n\n\n\nPosted: 12 June, 2019\n Sum up+ A single character can learn all classes and jobs in the game.+ Insane variety of content, even without the expansions. Up to 2000 hours easily.+ An MMO that starts simple, looks appealing and raises the difficulty in later levels.+ Dungeons, bosses and raids look amazing, featuring rich details and lots of effects.+ Community is very social and they enjoy helping other players in anything they need.+ Party finder for those lacking a party going solo, as well as other features to keep players together and make it easy to connect.-  Monthly subscription can repel new players.- Lots of content to do in order to catch up with the latest expansions.- Early parts of the game can be quite dull and boring, though it gets much better.- The duties which are solo instances can break a party temporally and be bothersome.- Later in the game, it becomes a trial and error experience when battling new bosses and exploring new dungeons. Introduction Final Fantasy XIV is an MMO game base on the series with the same name. It features elements from all the entries and creates a huge world filled with lots of things to do. What set it apart from other MMO’s is that it looks visually appealing, that its system is easy to learn but hard to master and that it has a lot of versatility when it comes to its players. It is a fluid system with a good amount of room to explore and take it easy. Gameplay The gameplay features common elements of what an MMO would have. Players do quests in order to gain exp and level up, once they do they are able to queue up for dungeons, trials(bosses) and raids which they can battle together with friends or with other players through the party finder, which works like a charm.Each player is required to choose a class, then at lv 30, that class will become a job. Job is a more specialized class. Depending on the class the player chooses, gameplay will vary and while it would be impossible to mention all of them in a review, I will give some examples. Classes are divided into three roles: Healers Their job is to keep their fellow peers alive through the art of healing. They can range from the classic white mage with lots of healing spells, to a more offensive approach with the scholar who has damaging spells. Players can also opt to get a mix of both with astrologian, which depends on the high skill of the player and some RGN but features the higher arrange of abilities. DPS (Damage dealers) They are the ones who kill the monsters. DPS is the role with more classes in the game and they feature different types of jobs such as black mages, which enjoy lots of damaging spells but lack utility, to bards who can buff their whole party with beneficial effects while keeping up damage or ninjas, who mix different kinds of abilities to generate powerful ninjutsu. Tanks The heart of the party, they always must protect their fragile party members and be the shield that guards the realm of men. Like their description says, they keep everyone out of harm's way by provoking monster, rushing to deploy barriers or just being a pain for bosses to get rid of in general. Tanks will redirect all the damage towards them so that the healers and dps’s can do their jobs without preoccupying about dying.Is the mix of all these roles that create a functioning party, and with the finder, you are always guaranteed to get a good balance of all of them. Each of these roles is equally important as they are pieces of a greater whole. The healers keep everyone alive, the DPS kills the enemies and the tanks keep the other two out of harm's way. No matter which role you choose, you will always be important for your party.Speaking of side activities, there is another type of roles I haven’t mentioned yet. These are the disciples of the hand and the disciples of the hand. In these fields, players can find classes ranging from blacksmiths to fishermen or even culinarian! These jobs tend to break the normal pace of the game and offer a more relaxing environment. They might sound boring at first, but players often find themselves lost in them for hours. Once you get going, you just want to do more, and they are beneficial to yourself and your other classes.If you are a culinarian, for example, you can make your own food which allows you to get bonus exp modifiers. If you are a blacksmith or an armorer, you can craft your own weapons and armors to use in your other classes. If you are a fisherman, you can sell the fish for lots of money on the player market and well, who doesn’t love fishing in a game? Story Final Fantasy XIV is a game that takes its story very personal and treats it with the utmost care. It does start pretty boring and dull but catches up fast and it can feel like watching a series or a movie. The richest stories are in the expansions, unfortunately, but these are quite enjoyable, filled with lots of believable characters, conflicts, development and more. Reading all of it or catching up to the latest expansions can be quite daunting, so if you are not into spending a lot of time reading/watching cutscenes, you can always skip them and rewatch them later at an inn’s room. There are also plenty of summaries only that are well written and consist of thirty to an hour reading material per expansion (game+2 expansions= 3 hours of reading total) so feel free to skip it if you do find it boring or exhausting to sit through. Do however note that the story is one of the strongest points of the game. Some Notes The game runs well on any system that meets the requirements. Some areas might decrease your fps depending on your settings and the sheer amount of player characters that are present in the zone but fret not, this is not a big issue by any means. Duties can be bothersome when you are at a party with friends but are overall enjoyable. Probably the easiest MMO to get into has a UI that the player can adjust to fit their playstyle or needs and the game lacks any sort of pay to win or in-game advantage bought with real money, only shortcuts for those that simply don’t have a lot of time. What Makes It Special What makes Final Fantasy XIV special is that it is well balanced when it comes to all the classes and jobs. That it looks more realistic when compared to its peers and that it features a dynamic, fluent system with that is easy to use but hard to master. By sharing all classes across one character, the player will never need to go back to the start of the game in they decide that maybe that class they picked, in the beginning, wasn’t the one for them. The game makes an effort to make fights different from one another. Players can find themselves fighting in Rubik's cube, getting devours by a Cerberus and fighting the beast from its stomach or even getting split from their bodies and have to move across a labyrinth of AOE’s in order to go back into them and continue the fight. There is always something new in waiting for the player in the next encounter.  Conclusion Final Fantasy XIV is a fantastic MMO, it is filled with great amounts of content and different ice breakers to teach new players how to play and hold their hands until they can go by themselves into the wild worlds of Eorzea. There are a bunch of side activities to break the normal pace of the game and have some fun if you are ever tired from questing, and each dungeon or trial keep adding new mechanics, keeping the game entertaining and making you wonder what you will encounter in your next adventure. I recommend this game to those that haven’t experienced an MMO, and to those that have as well.Follow our curator page, Alexander's Club Curations if you like and want to see more reviews like this one.[/quote \n", "\n\r\n\t\t\t\t328 people found this review helpful4 people found this review funny\t\t\t\t49\n\n\n\n\n\n\nRecommended\n218.5 hrs on record\n\n\n\n\nPosted: 20 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis game is really good, but you dont have to take my word for it, wanna play it? just download the free trial from the square enix page (You will need an square enix account to play it anyways), you can play the game with little to no changes for free up to level 60 (that´s like a lot of content my dudes, base game + one expansion, thats easy +100 hs of content). If by that time you don't like it, don't buy it. Risk free, no money/credit card asked in advance and you can migrate your free trial character to your paid game in less than a five minutes.\t\t\t\n"]