["\n\r\n\t\t\t\t925 people found this review helpful217 people found this review funny\t\t\t\t101\n\n\n\n\n\n\nRecommended\n196.4 hrs on record\n\n\n\n\nPosted: 9 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t- No dad- Play squad- Join Australian server - Team in desperate need of mortar support - Hop onto mortars and ask SL to see if my hits are high or low - “try firing at 1390” - Fires at 1390- SL says good job son, keep it up and we could get the point - Never see him again (yet)- Might have shed a tear Thank you tripwire71\t\t\t\n", "\n\r\n\t\t\t\t2,774 people found this review helpful4,844 people found this review funny\t\t\t\t121\n\n\n\n\n\n\nRecommended\n2,132.2 hrs on record\n\n\n\n\nPosted: 28 January, 2018\nEarly Access Review\r\n\t\t\t\t\t\t\t\t>Joined squad name \"Company BIyat\">All Russians>Tried not to speak so they don't know i'm not Russian>A lof of \"davai\" and \"cyk4\">SL called my name>Panic>He said some crazy long Russian sentences>Replied with \"Da\">Got away with it>Later on a squad member aproached me>Whispered quietly in local voice>\"Hey, i don't know Russian too\">Instantly became friends\t\t\t\n", "\n\r\n\t\t\t\t521 people found this review helpful48 people found this review funny\t\t\t\t182\n\n\n\n\n\n\nRecommended\n89.1 hrs on record\n\n\n\n\nPosted: 2 October, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tARMA meets Battlefield, with a splash of Foxhole!Squad is realistic enough to be gritty and nail-bitingly tense, demanding of you a certain level of tactical awareness and teamwork. The game also does a ruthless job of punishing lone wolves and bad leadership. However, don't let the realism dissuade you from it, because once you get past the learning curve, it's an incredibly fun game with a huge amount of depth and complexity that will keep you hugely entertained and engaged.Battles feel real, raw, and yet, exciting and fresh. Every single time you play, even on maps with the same layout and same factions, you feel like there's a potential for something new, something unprecedented, every single time. Fallujah is especially terrifying and immersive, and every time you step into that map, you tensely look down each alleyway, not knowing what's going to come out. My first proper experience with Squad took place in Fallujah. I sped past the tutorial (something I very quickly came to regret), and landed in the middle of a match about to kickoff. As part of the US troops, I faced off against the Middle Eastern Alliance. I joined a squad, and grabbed a medic kit, because I always liked the healer role, and I thought it would put me safely in the backline to learn the ropes while the others in my squad did the heavy lifting. Big mistake. Things started off innocuously enough. Our squad leader sat in the truck and made small talk, asking who was new, and giving us some guidelines. He told us not to give up if we went down, and to wait for the medic to try and get us for at least 30 seconds, or else it would cost a ticket (the points that end the game if your side goes down to zero). As the truck rolled off, I looked back at the arsenal of armoured vehicles and asked why we weren't taking them. The squad leader replied that it was because losing them would cost so many tickets that it was better to use them sparingly rather than as some kind of overwhelming force doctrine. A convoy of trucks trundled off, and ours soon broke off from the pack, to form a backline FOB. The squad leader pointed out things he wanted us to build, while telling us he was on the channel with command. After we were done building, we sat around guarding the newly-built FOB, not an enemy in sight, idly chatting and kicking stones around. This felt like an accurate military simulator already! Then suddenly, he told us to get back in the truck. As we were on the truck, we were told we were meeting up with another squad, which was under heavy fire and needed reinforcements. I sat in the front watching the view, next to the squad leader and the driver, and then-The driver's head exploded in blood and he slumped over, the truck grinding to a halt. I turned to my squad leader, who yelled \"PRESS F1 GET OUT GET OUT ENGAGE\"I pressed down on the exit key, panicking at how long it took. I fumbled three times, miraculously getting out unscathed from the hail of bullets smashing into the front window. All around me little blips were showing up demanding medical attention as soldiers in our squad went down one after the other. The squad leader yelled \"SETUP THE MG AIM AT THAT HOUSE OVER THERE\" before he, too, went down. I couldn't even see where the bullets were flying from. All I heard was shrapnel, ricochet, and screams of \"MEDIC! HELP!\" The MG went up and blasted fire at the house while I was stumbled out of the way, holding out my medkit, cursing its ineffectiveness before realizing I needed bandages to stem the bleeding first before healing. I got my bandages out, and the person I was tending to keeled over. I took too long. I desperately went to the next man, who I got back up on his feet, but he stood up and immediately got shot down again from a direction I couldn't identify. As I tried to get him up again, a hail of bullets sent me down too. In the darkness, I couldn't make out anything. Just a voice going, \"I got you, I got you,\" in my ear. \"When you're up, go prone on the ground and crawl after me.\" Suddenly, I was awake, the light hitting my face. The other medic in the squad had prioritised me. I looked back at the wreckage of the truck, strewn with dead US troops. The MG gunner was still firing blindly at the building, but he was the only one left. A smoke grenade lay on the ground, spewing thick white fumes. The other medic explained to me I needed to pop smoke grenades so I could safely rescue others and let them crawl to safety under the cover of the fumes. He yelled at the MG gunner to get up and join us under the cover. We decided to complete the mission to meet up with the other squad as the SL directed while the others rallied elsewhere.En route there, we crossed this maze of alleyways. The MG gunner took point with his pistol, his MG having run out of ammo after the earlier encounter. We noticed an engine rumbling, checked our maps, and realized it was a friendly one. We ran out, confident we were safe, and then an MEA soldier stepped out from an alleyway. Too late, we emptied our weapons at him, killing him, but not before the RPG went into our friendly APC, blowing its tracks out. Shortly after, another missile from God knows where slammed into the APC as we fired in all directions. The MG gunner yelled out, \"RUN!\" before he got downed. The other medic turned and threw a smoke grenade, shortly before bullets started flying and he went down as well. I looked up at the building where the other squad was, and heard a chaos of radio static and panicked calls for help and for orders. The smoke grenade's fumes floated up. I crawled on all fours to reach the other medic, patching him and bringing him up. Then I crawled into the building, leaving my comrade to patch the MG gunner. The building's floor was strewn with US soldiers incapicitated everywhere; it seemed like every guy I patched got up only to be shot down seconds later. WHERE THE HELL WERE THE BULLETS COMING FROM?! The other squad's leader grabbed the medic from his squad and ran out the building, shouting that he was going to setup a rally away from the fighting, leaving his men in the bloody firefight. Then, my revived SL and the rest of the squad opened fire from another building they had occupied. The enemy was under enfilade, getting fired on by two sides. Artillery rained down on them. I cheered, wooping as they were surely obliterated. As I stumbled out of the building, my SL checked my stats and remarked, \"Well done, you're doing good for a new medic!\" \"Thanks! ... Is it over?\" \"Over?\" He laughed. \"No, that was the first skirmish. We haven't even flipped the first flag yet. Come on! Onto the objective!\" I bleakly realise 20 minutes have passed and we're somehow only in the opening phase. As I grab my gear and march off after my squad with the distant ricochet of gunfire and the ominous trundling of engines in the distance, I think to myself... dear Lord, war is hell.\t\t\t\n", "\n\r\n\t\t\t\t682 people found this review helpful111 people found this review funny\t\t\t\t96\n\n\n\n\n\n\nRecommended\n46.4 hrs on record\n\n\n\n\nPosted: 15 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t>Second time ever playing the game>Start wandering into the city on foot by myself with no squad>See some other guy on my team following me>Begins doing the e, q dance to me leaning back and forth. I do the same back>Instantly become battle buddies and stick by each others sides constantly>Ambush an entire squad together and take them all down just the two of us>We notice we're nearing the border of territory the enemies have complete control of and decide to hold up in a house>Quickly become surrounded with our presence slowly being revealed by the enemy>They catch on to us and two squads begin to pinch us from each side of the building>Completely surrounded deep in enemy swarms>Buddy suddenly gets pegged in the head by a random sniper round through the window>Stare at his body, feel nothing but anguish>Storm out of the building in some John Wick worthy fight scene, killing almost an entire squad in my path getting to the snipers position>Nearly out of ammo at this point but spot the sniper close by>Drain the rest of my shots in the firefight>Pull out the last lethal thing in my kit, one hand grenade>Sniper gets a beat on my position>Throw the grenade right into his cover moments before he blows my head off>Unsure what the snipers fate was>I still miss him...\t\t\t\n", "\n\r\n\t\t\t\t1,870 people found this review helpful39 people found this review funny\t\t\t\t167\n\n\n\n\n\n\nRecommended\n182.2 hrs on record\n\n\n\n\nPosted: 27 August, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis is the middle ground between BF4 and ArmA. - Where ArmA is slow, Squad is faster. - Where ArmA graphics aren't immersive, Squad has cinematic action.- Where ArmA is hard to get into a good game, Squad has dozens of full games running constantly, and servers that stay full. - Where BF4 is easy, Squad is harder. - Where BF4 is full of arcade gamers, Squad has lots of people who care about strategy.- Where BF4 maps look sprawling but end up playing linearly, Squad engagements can be different every time.If you like a game full of explosions and screen rattling, with a hundred players in a square kilometer, 400m engagements are common, and you think a bullet to the chest should be fatal--Squad is your game.\t\t\t\n", "\n\r\n\t\t\t\t564 people found this review helpful413 people found this review funny\t\t\t\t46\n\n\n\n\n\n\nRecommended\n121.0 hrs on record\n\n\n\n\nPosted: 6 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVery few games capture the real world feel of being led by an 8 year old into modern conflict and the slaughter that follow.10/10.\t\t\t\n", "\n\r\n\t\t\t\t395 people found this review helpful4 people found this review funny\t\t\t\t58\n\n\n\n\n\n\nRecommended\n479.7 hrs on record\n\n\n\n\nPosted: 15 December, 2021\nMy ImpressionSquad, to me, is really more a social experience than a simple FPS.It's an experience of opposites - where you rush to wait, where a single man can't do anything or turn the game, where sometimes the best way to eliminate your foes is to hold fire, and where competitors become friends.SummaryWhile we are still in the staging phase of my review, let's give you a quick rundown of the plan.✔️ Positive🟡 Mediocre❌ Negative✊ Fully Community Driven👍 No FOMO Features 👍 Great Map Variety👍 Many Different Kits and Play Styles👍 Solid Gunplay👍 Stunning Views✊ Mediocre Textures👎 Many Performance Dips👍 Punchy Audio👎 Which You Can't Always Rely on👎 Bugs👎 Slow Updates📜'Story'Of course, there is no real 'story' - nothing that makes you go \"man, I wonder what happens next\". There are, however, the stories you write while fighting together with your squad.Additionally, there are no extra features to motivate you - no levels, no prestige, no skins or achievements to unlock. The only reason to play the game is that you genuinely like it.🌐CommunityThis title lives and dies by its community, and thus, by you.In the system requirements you find that a microphone is recommended — I, however, say it should be required along with the intention of using it.Why? Because a lot of servers will kick Squad Leaders (SLs) that do not have one and some squads will mandate it for their soldiers as well.All of the servers for this game are player-hosted, so it is important, for your enjoyment, to find one that a) is filled at your playtimes, b) fits your play style, and c) has a solid admin team.The game quality often depends solely on the ability of the SLs and, especially as a new player, your liking or disliking of the product will depend on that one person.⌨GameplayIts identity is a modern first-person military simulator with an enormous focus on communication. A squad can consist of up to nine members with different kits opening up depending on the number of players. You move very slowly, running and shooting consume stamina and two to three bullets are all it takes to take somebody down. Beware, that one round of Squad will take about an hour to complete.Winning and losing depend on tickets.Many things lose you tickets - like giving up when dead, losing vehicles, FOB radios, and objectives. But only one thing gains tickets: capturing objectives.Your first matches may very well end without you shooting anyone and even as an experienced player, you will realize that a big part of the game is just driving around and waiting which, personally, I do not see as a bad thing, quite the opposite in fact, especially when I'm leading a squad. It feels more like a campaign of 4D Chess — moving your troops, coordinating with other SLs, and anticipating the movements your enemy will make.Starting out, you definitely should not open a squad. Even if it takes some time for them to open up, be patient. As a member of the crew, you can choose from a variety of kits, each with a different role, if you are overwhelmed, just go for Rifleman with scope or Medic. Changing kits is possible during the round on Ammo crates, but that will cost some ammo, so choose carefully.After making that decision, listen to your SLs orders - generally, you will hop in a Logi (Logistics Truck) and, depending on the game mode, drive to a point that you will either be attacking or defending.Now, you might have seen my emphasis on the word not in the context of opening a squad - that's because it happens a lot. It is also one of the most frustrating things in this title: standing in the spawn with no direction. On the same page, you might also get an SL who does not communicate with you, which will end with the same result. Then there are games when there is simply no communication on the command level - no supplies are coming in, no units on defense and no HABs (spawns) are being set up. Most likely resulting in a brutal defeat, which probably wasn't fun.All of these difficulties were even without the bugs — ranging from simply showing you in a vehicle, in which you aren't, to being unable to load/unload resources from a Logi.To not end this part on a negative note, you can have a lot of fun in the game, even if you are losing. If you have a good SL, or a small squad of friends, you can play your best, win some points, and have a blast, but lose the war in the end.🗺MapsSquad offers 20 large maps with a good variety in looks and playstyle.From the flat, sandy deserted hangars of Talil, where long sightlines and heavy vehicles rule; over the green fields, forests, and hills of Gorodok which enables sneaky flanks; to the steep, snowy mountains of Belaya which make traversal off-road quite hard.Finally, there is my favorite map: Mutaha, a semi-symmetrical city divided by an island in the middle, which allows for a wide variety of strategies while keeping the action close.I want to emphasize the points: you walk really slowly and a lot of the maps are really huge — so make sure you have a vehicle handy when traveling from point to point and don't walk except there is no other way.👁️‍🗨️VisualsLooking (from a safe distance) at an artillery strike going down on a place is a sight I will never get tired of.Graphically, this game can look quite good. Sadly, I have to play it on the lowest settings to get some decent frames out of my dated hardware (GTX 970, Xeon e3-1231v3, 1080p). There is a lot of foliage and rubble on the ground, making it feel more \"alive\" and providing visual cover. \t\tNonetheless, a lot of assets are reused, which feels lame. On the other hand, it helps you identify houses that are potential HAB locations easier, and in the heat of battle, you probably won't complain about it after all.What also put me off initially was the lack of any props inside of houses it kind of hurts the immersion, but I guess it eases up gameplay.🎧SoundI enormously enjoy the main menu soundtrack, which you are gonna hear a lot while you are sitting in a queue connecting to your favorite server.Once in the field, you've got great sounds for guns, vehicles, and explosions. With a trained ear, you will be able to tell friend from foe by the sound of the rifle; separate between a Logi, a BTR (as all APCs and IFVs seem to be called by your fellow team members), and an actual ♥♥♥♥♥♥♥ Tank.There is only one catch: it likes to bug out often. Sometimes you will hear shots from the left, while the firefight is going on to your right, and rarely the sound will glitch and blast your eardrums out.🏁VerdictIf you want a multiplayer shooter that feels like playing with actual people and not just voiceless puppets, plus you like teamwork and tactics - this is it, this is your game.Your enjoyment, for the most part, will lie in the hands of strangers, more so than in other online titles. If you can open your mind for that and embrace the community, you will be in for one hell of a ride.Always strive to be better and help others to build for the gameplay experience you can all enjoy together.NoteIf you have read this far - thank you, make sure to:❤️ vote💬 comment⚡ follow my curator \n", "\n\r\n\t\t\t\t289 people found this review helpful271 people found this review funny\t\t\t\t29\n\n\n\n\n\n\nRecommended\n433.8 hrs on record\n\n\n\n\nPosted: 8 August, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI might have 380 hours in this game, but I still have no idea who am I shooting at.\t\t\t\n", "\n\r\n\t\t\t\t276 people found this review helpful115 people found this review funny\t\t\t\t16\n\n\n\n\n\n\nRecommended\n136.2 hrs on record\n\n\n\n\nPosted: 26 June, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI was stuck in a warehouse for 30 minutes while a tank barraged our position. 15 minutes into the assault an Anti-Tank Personnel showed up. He said \"I'm here to help boys\" as he pulled out his launcher. He was then immediately shot in the head by a sniper, and we were left helpless until the tank eventually got bored and left. This game is awesome.Edit: This game got an outstanding overhaul that made the game so much more fun since its release. The new content being added is outstanding, and that's why I want this game to win the \"Labor of Love\" award this year.\t\t\t\n", "\n\r\n\t\t\t\t1,003 people found this review helpful815 people found this review funny\t\t\t\t157\n\n\n\n\n\n\nRecommended\n12.1 hrs on record\n\n\n\n\nPosted: 13 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t>Joined squad name \"Company BIyat\">All Russians>Tried not to speak so they don't know I'm not Russian>A lot of \"davai\" and \"cyk4\">SL called my name>Panic>He said some crazy long Russian sentences>Replied with \"Da\">Got away with it>Later on a squad member approached me>Whispered quietly in local voice>\"Hey, i don't know Russian too\">Instantly became friends\t\t\t\n"]