["\n\r\n\t\t\t\t1,070 people found this review helpful117 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n112.6 hrs on record\n\n\n\n\nPosted: 7 March, 2020\nProduct received for free\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t以前，我不知道Steam，在宅霸上玩Un，第一次玩不知道干什么，一位大佬就热情的带我，我们也就玩，后来来了新人我也带，我们玩的都很开心。后来，网易来了，宅霸被封了，我的朋友们的联系方式都没有，我恨网易，现在，我玩steam，游戏有了，我的朋友没了，现在，我决定要带新人，来一个新人带一个，让他们不退游，我希望我能碰到他们。\t\t\t\n", "\n\r\n\t\t\t\t1,561 people found this review helpful26 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n667.2 hrs on record\n\n\n\n\nPosted: 7 July, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tA teenage developer who manages to release great updates every week, new, detailed maps several times a year and no pay to win; this is a really good game. 500 hours and still enjoying myself. The Gold Upgrade lets you change the colour of your skin (Possibly to abuse as camouflage) I see this as the only major advantage a paying player would have over a free-to-play player.EDIT: This review is receiving a lot of critique, to clear up: Most free to play games rely on overpowered bonuses to get people to buy in-game products. This game lets you camouflage better and have more storage space by switching between characters. In comparison to other pay-to-win games this is a very small bonus. I'd say most people buy it to support the developer with the small bonuses as an extra incentive.EDIT 2: It's free to play, you can't expect a perfect game from a single developer. Additionally, he needs a way to incentivize people to buy the Gold Upgrade for him to make any money. If it was completely useless, fewer people would buy it. It really doesn't affect gameplay all that much. Overall: Good game. I like it. Not pay-to-win like many other games in this genre. 9/10\t\t\t\n", "\n\r\n\t\t\t\t395 people found this review helpful232 people found this review funny\t\t\t\t26\n\n\n\n\n\n\nRecommended\n7.9 hrs on record\n\n\n\n\nPosted: 12 May, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot called a Ni--er by a 5 year old whos mother was yelling at him to take out the trash.10/10\t\t\t\n", "\n\r\n\t\t\t\t297 people found this review helpful155 people found this review funny\t\t\t\t43\n\n\n\n\n\n\nRecommended\n11.5 hrs on record\n\n\n\n\nPosted: 21 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot called a Ni--er by a 5 year old whos mother was yelling at him to take out the trash10/10\t\t\t\n", "\n\r\n\t\t\t\t342 people found this review helpful203 people found this review funny\t\t\t\t35\n\n\n\n\n\n\nRecommended\n3.6 hrs on record\n\n\n\n\nPosted: 6 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot called a Ni--er by a 5 year old whos mother was yelling at him to take out the trash10/10\t\t\t\n", "\n\r\n\t\t\t\t248 people found this review helpful13 people found this review funny\t\t\t\t9\n\n\n\n\n\n\nRecommended\n162.6 hrs on record\n\n\n\n\nPosted: 24 March, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPLEASE MAKE IT EASIER TO CREATE A PRIVATE SERVER SO WE CAN PLAY WITH OUR FRIENDS!!!!!!!!!!!\t\t\t\n", "\n\r\n\t\t\t\t145 people found this review helpful93 people found this review funny\t\t\t\t7\n\n\n\n\n\n\nRecommended\n1,653.5 hrs on record\n\n\n\n\nPosted: 3 November, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThere is a zombie apocalypse in lego city and your worst enemy is a group of 12 year old Russian tryhards. 10/10\t\t\t\n", "\n\r\n\t\t\t\t284 people found this review helpful149 people found this review funny\t\t\t\t27\n\n\n\n\n\n\nRecommended\n1.7 hrs on record\n\n\n\n\nPosted: 8 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot called a Ni--er by a 5 year old whos mother was yelling at him to take out the trash.10/10\t\t\t\n", "\n\r\n\t\t\t\t232 people found this review helpful233 people found this review funny\t\t\t\t14\n\n\n\n\n\n\nRecommended\n694.5 hrs on record\n\n\n\n\nPosted: 4 December, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI joined a server. A little kid, he came against me threatening me with a hatchet and told me to give him my stuff.All I know is: Now i have a hatchet.\t\t\t\n", "\n\r\n\t\t\t\t337 people found this review helpful207 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n30.9 hrs on record\n\n\n\n\nPosted: 7 March, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot called a Ni--er by a 5 year old whos mother was yelling at him to take out the trash.10/10\t\t\t\n"]