["\n\r\n\t\t\t\t4,657 people found this review helpful56 people found this review funny\t\t\t\t631\n\n\n\n\n\n\nRecommended\n95.6 hrs on record\n\n\n\n\nPosted: 15 January, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tIts simple, and addictive. I'm a disabled gamer and the controls are very accessible. I normally don't play early access games but this one is good as it is now.Update for the release edition: Yes, still very good. Nailed it in every way possible.\t\t\t\n", "\n\r\n\t\t\t\t2,211 people found this review helpful559 people found this review funny\t\t\t\t156\n\n\n\n\n\n\nRecommended\n29.2 hrs on record\n\n\n\n\nPosted: 15 April, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThere is no escape. You press play, and it's 3am.\t\t\t\n", "\n\r\n\t\t\t\t1,863 people found this review helpful221 people found this review funny\t\t\t\t281\n\n\n\n\n\n\nRecommended\n43.0 hrs on record\n\n\n\n\nPosted: 21 February, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tGaming in 2022 has come a long way. Some games now have budgets and cast lists that rival movies. Gaming can be like sitting down for an elegant ten-course meal at a fancy restaurant. But sometimes you just want a handful of m&ms.This game is a bag of m&ms.There's no nutritional value, it's not burdened with plot or story or fancy graphics or forks or plates or anything that's standing between you and shoving what you want directly into your facehole. It's that kind of game where you're just going to play one more run and sort of absentmindedly grab another handful of chocolate. Okay, one more run after this. I'll just have a few more. Oh, I've eaten a pound of chocolate.This game is delicious.\t\t\t\n", "\n\r\n\t\t\t\t820 people found this review helpful6 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n24.7 hrs on record\n\n\n\n\nPosted: 8 January, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis game is ridiculously good for its pricepoint. Wow. Super happy I found it.\t\t\t\n", "\n\r\n\t\t\t\t966 people found this review helpful297 people found this review funny\t\t\t\t73\n\n\n\n\n\n\nRecommended\n102.5 hrs on record\n\n\n\n\nPosted: 15 May, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\t3 dollar cocaine.Edit: Now 5 dollar cocaine.\t\t\t\n", "\n\r\n\t\t\t\t960 people found this review helpful5 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nRecommended\n34.8 hrs on record\n\n\n\n\nPosted: 4 May, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis has to be the best $3 game on steam.Edit: $5 game\t\t\t\n", "\n\r\n\t\t\t\t2,156 people found this review helpful483 people found this review funny\t\t\t\t250\n\n\n\n\n\n\nRecommended\n34.0 hrs on record\n\n\n\n\nPosted: 30 January, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis game rules, absolute chad design.Do I need a cutscene explaining what's happening? No. You press Start and now you kill stuff until you die.Do I need to press buttons to attack? ♥♥♥♥ that, we know you're hitting those things on cooldown anyway. So we do it for you.Better make this $60 and get some hot-♥♥♥♥ AAA graphics right? No. You'll take your pixels and you'll like them. That'll be like $3. In this economy that is less than you will spend on lunch.Vampire Survivors: King ♥♥♥♥. Buy it now and if you don't like it you can just skip buying french fries and you're back to even.\t\t\t\n", "\n\r\n\t\t\t\t614 people found this review helpful61 people found this review funny\t\t\t\t23\n\n\n\n\n\n\nRecommended\n113.2 hrs on record\n\n\n\n\nPosted: 13 April, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tImagine getting 100 hours of game play out of a $3 game.\t\t\t\n", "\n\r\n\t\t\t\t406 people found this review helpful77 people found this review funny\t\t\t\t20\n\n\n\n\n\n\nRecommended\n65.1 hrs on record\n\n\n\n\nPosted: 13 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdigital bubble wrap\t\t\t\n", "\n\r\n\t\t\t\t1,039 people found this review helpful254 people found this review funny\t\t\t\t95\n\n\n\n\n\n\nRecommended\n142.9 hrs on record\n\n\n\n\nPosted: 7 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAs of...November 7th 2023 I've officially cleared, beaten, collected and unlocked everything in this game including the DLC and free content updates. I've also maxed out the money count to 9,999,999. I think I'm qualified to write a review now, here 'goes *clears throat*:Yes.\t\t\t\n"]