["\n\r\n\t\t\t\t1,171 people found this review helpful30 people found this review funny\t\t\t\t12\n\n\n\n\n\n\nRecommended\n207.6 hrs on record\n\n\n\n\nPosted: 14 September, 2018\nEarly Access Review\r\n\t\t\t\t\t\t\t\tDo not buy this game until you have looked into what you are getting into. Don't buy it based off of streamer hype, friend hype or review hype. SCUM is in early access. Whether you agree with the concept of early access games is irrelevant. SCUM does not offer a lot of content right now. Combat is super janky, mechs are unpredictable at times and your shotgun will shoot through puppets if they’re too close.So, what have I spent 150 hours doing in this game? I’ll tell you what I haven’t been doing. I haven’t been running straight to the Airfield and getting frustrated when I die every 5 minutes because some geared player, squad, mech or puppet lagged out and killed me. This is not PUBG, if you want a game where the goal is to get looted and battle it out with other players, this game is not for you. Fame points are an awesome way to limit your bad decisions. Not so hard to get that it’s annoying, but not so easy to get that they are a waste. You need to plan your engagements. You’ve got to be willing to lose your gear if a situation goes south. You’ve got to be sure that you are aware of your surroundings so someone doesn’t kill you while you’re busy looting. What I have been doing is surviving… Reading some of the reviews you would think this game was marketed as a Battle Royale or something. It’s a survival game. The most fun I’ve had in this game have been hunting bears with a spear, skinning them and then wearing their hide as a trophy.I work on upgrading my cooking skill, I’m fascinated by the idea of cooking the more complex items. I upgrade my throwing skill, because I’m curious what the next level will bring. I wander from city to city, bunker to bunker and admire the beauty of this game. As an Avid outdoorsman I am blown away by how lost I get in the landscape. I have rebuilt my character many times. This latest build was focused on stealth, because a part of me wants to see if I can be a spear throwing shadow, destroying players with primitive weapons. I bought into the early access because I have been following this game for a while now and decided to take a chance on supporting the developer while they continued to build the game. If you don’t agree with the devs releasing an unfinished game, don’t buy it. It’s that simple.I feel like the amount of money I put into this game is more than worth my enjoyment of it so far.\t\t\t\n", "\n\r\n\t\t\t\t1,128 people found this review helpful110 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n14.1 hrs on record\n\n\n\n\nPosted: 20 September, 2018\nEarly Access Review\r\n\t\t\t\t\t\t\t\t请所有中国的挂壁们原地爆炸明明是款很好的游戏被挂壁毁了但还是支持这款游戏，很真实，需要动脑子。以后疾病元素和运动元素完善以后肯定更好玩。那些喜欢作弊的孤儿们真的全家火葬场WE ARE SORRY, WE CHINESE HATE THOSE CHEATERS TOO.THOSE CHINESE CHEATERS ARE NOT CHINESE, THEY ARE REAL SCUMS\t\t\t\n", "\n\r\n\t\t\t\t328 people found this review helpful10 people found this review funny\t\t\t\t55\n\n\n\n\n\n\nNot Recommended\n9,817.5 hrs on record\n\n\n\n\nPosted: 17 December, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis game was good when it first came out. Then it became a great game.  Now it started to go down hill since the hunting & cooking update, I play it in real time, so now it takes 16 minutes to cook something. This last update they took out the wild puppets & indoor puppets. For the single player there is no reason to find a rifle & scope because the puppets spawn within 40 yards of you. They had a great game going now they are just messing it up. Please don't get  on my case about the hours I have on this game . I'm 63 & disabled, so play this game all the time. I hope they listen what I have said & make the changes back to the way it was. Don't mind the horde update because you can shut it off\t\t\t\n", "\n\r\n\t\t\t\t427 people found this review helpful24 people found this review funny\t\t\t\t0\n\n\n\n\n\n\nRecommended\n16.0 hrs on record\n\n\n\n\nPosted: 13 December, 2018\nEarly Access Review\r\n\t\t\t\t\t\t\t\tThis is a fun game But please---PLEASE, Im asking you, Add a tab for current players on the server! I dont want to guess who is playing, or if im in an empty server, #AddCurrentPlayerTab\t\t\t\n", "\n\r\n\t\t\t\t238 people found this review helpful5 people found this review funny\t\t\t\t30\n\n\n\n\n\n\nRecommended\n1,734.2 hrs on record\n\n\n\n\nPosted: 4 January, 2021\nEarly Access Review\r\n\t\t\t\t\t\t\t\tOkay, Bought this Game on Launch or Week of. I played DayZ when it was a Mod for Arma. Played Rust, Ark, Project Zomboid, The Last Dark, The Forest. Name it. If its survival I've probably played it or at least HEARD of it. DayZ is King for me. Brutal. Hard. Blah blah blah. ... Was King...Scum really hooked me with the Mechanics. If you don't know about them, check em out.Namely: Metabolism, Health, Diseases, Vitamins. Its something DayZ Doesnt Touch on and Project Zomboid Nails. So I loaded Scum a few months back Perhaps August 2020. It was alright but eh. Something off about it idk. Loaded it this Friday and wow. The Changes are absurd. No joke, as it stands right now this game is top top Survival for me. The look of the world, the Graphics... they really upped the ante there. The Sounds, Amazing. Very nice, Very Creepy. The Environment is fantastic. The world is huge.The Gun play, sounds, and mechanics are tip top. The Base building is amazing, it works. I spent a good 3 hours wandering around blasting the radio I found in game just survivin'. Ran into 3 different people, 2 of which were geared. Put my hands up. Explained I just wanted a backpack. They threw me one and told me split and we good. So I did after thanking them. The other two I ran into (Freshies) I offered help. They declined. They didnt try to suicide Charge me. (Playing on an unofficial Hardcore, higher pop) Just an all around good experience. Was refreshing. Eventually Built a sh*** little camp, buried a box with some basic supplies and called it. I've been in a massive gaming rut, NOTHING has pulled me in or kept me. Nothing. Scum has done more than fill the void. On top of that Im beyond stoked for .5 Patch update. So for me.... someone whose played Miscreated, Zomboid, DayZ, Forest, Stranded Deep, Long Dark, Again.... name it. 10/10. Do your research though. Camoflauge mechanics, Strength stats, archery. The Stat Systems and Metabolism and stuff. Thats what really sucks me in and the world and sh**, they did a great job.1/10/2021: Update on some things I noticed: I hear a lot of people complaining about Lag in game. Im on an Unofficial. Personally I havent encountered Any lag. Vehicles however...... they are awesome But they do desync a TON. Saw someone drive by the other day and it was like.... skipping. Needs work there. Last night I had like.... 4 Fatal Errors. So, after about a week of PLaying I started getting them 4 in a row Just last night. I Verified and it seems to be stable. No more issue there.I play on an unofficial hardcore so.... as for how good officials are...  IDK. Personally Official Servers on most PvP Games are Trash imo. I hear there are some exploits that they know of but are working on. Also a ton ton ton of people HATE the lockpicking on mil bases. Personally I f*cking love it. Means people cant just spawn in and suicide run right to get geared. When game launched that was one reason I left. I was full kit in a few hours. Like.... 3-4 Hours I had an arsenal. I paid for the supporter pack last night just cuz Im loving the game and felt like supporting. My Specs: Nvid 2070SAMD Ryzen 370032gb RAM10/03/2021 Update (Same PC)So as of my last play time I went through a massive Gaming drought. Bored out my mind. I'd waited ages for the .6 update and while it was released i'd not touched it. I figured.... eh. WTH, Might as well install SCUM and see whats new. See that Metabolism. Well....... I think this week alone I played over 70 hours. The new metabolism is amazing. Absolutely amazing. Even now it's not fully finished and omfg its so good. Loving the direction its going and I want more. Need more. I cannot freaking wait. Diseases? Bone breaks and such? PLEASE!!! My last review stated Fatal Errors, those are pretty much a thing of the past. In the last 4-6 Weeks of playing I think I may have had Two? The Graphics and Visuals are absolutely Stunning. My Lord. I honestly often find myself just totally immersed and staring off into the sunset or up at the moon and twinkling stars. Absolutely stellar job. The way the leaves all sway and rustle with the wind... oh and the sound effects? Amazing. Top notch, truly. The wind picking up and making it hard to listen. Wolves howling off in the distance. Rattling chain link fences. My word.... Fantastic all around. I've been to quite a few of the new POI's and just wow. Im honestly blown away since I last played. OH! And boats, sharks.... fishing!? The Fishing is freaking fantastic and honestly better than any other game I've ever played (Aside maybe ACTUAL Fishin simulators?). Definitely chill and relaxing to just whip out your rod... lol... and catch some fish. Taking a few mins to reel in a lunker. Nice lil mini game of sorts. The boats work amazing, The first time I had one I had to Evac my buddy from Wep Factory in the dead of night. I got there and we went to get in.... Both of us standing on one edge and the friggin thing flipped. Like, that lil attention to detail. Amazing. Scared the Sh_t out of us. We lived. Then the storm comes, lightning cracking, pouring rain. Waves smashing the boat. What a feeling... This game creates stories. Adventures. Memories.Update 09/12/2022: I took a break last year whilst waiting for updates. Quit playing around February? Came back a week or two with the old squad. We promised we'd only hop in casual. No big deal. Just play here and there. The games just good. 8 or 9 other friends and acquaintances bought the game as well. Everyone enjoyed it. Laughs were had. \"Oh ♥♥♥♥\" moments abound. Fantastic. Some new bugs, mainly with vehicles, but nothing game breaking. I was apprehensive with the traders at first honestly, but I genuinely like them. Gives me Kind of a hardcore sea of thieves/Tarkov vibe. Get loot or raid, sell. Repeat. Stack that cash. Guard it heavily. Beyond stoked for whats to come. My most anticipated is more medical/health stuff. Cooking. Vehicle parts and maintenance. Those three I think will really make it more difficult to survive. The update to poisonous mushrooms was fantastic. Infections are absolutely wonderful.I would like to see some sort of possible parasites or something as currently, eating bugs is a bit easy mode.\t\t\t\n", "\n\r\n\t\t\t\t157 people found this review helpful2 people found this review funny\t\t\t\t15\n\n\n\n\n\n\nRecommended\n277.2 hrs on record\n\n\n\n\nPosted: 7 December, 2023\nEarly Access Review\r\n\t\t\t\t\t\t\t\tShort review-buy it on sale 10-15 dollars, especially if you are ok with rust, and like zomboid. If you can't make it past the initial huge learning curve you won't waste too much money.Longer review-Recommending was a toss up. There is so much potential it is insane, and I do ultimately enjoy it, but there is a lot to unpack. Scum is the love child of Rust and Project Zomboid. Like Zomboid it has a steep learning curve. Very steep. If you are learning on your own, I estimate 50 hours if you have limited similar experiences to really have a grasp on how to survive, assuming you are learning most of the game and not skipping things.Like Rust there is raiding and pvp, but it heavily depends on the server. Make no mistake 60 people on 1 server at once is a lot. Once you have the basics down, you can largely simplify the game if you please. You can sustain yourself on a simple diet, and you don't have to build or farm, and making money becomes easier. Many players live off of stashes they place in world and are baseless.The way I see it the devs care about the game, but not about the players. This deserves further explanation. There are basically 0 quality of life features. If you want basic wood arrows, you need to cut sticks into small stick, then craft each arrow. Find a box of nails? Have fun right clicking and then left clicking remove nail for the next few minutes. That isn't fun, it is work. To add insult to injury there used to be faster ways to do it, like being able to craft a nail with the required material being a box of them, but that was removed for some reason. It is a simple recipe, it wouldn't take an hour to code it in from scratch, and if you just used a form it would take minutes. To make things a little more aggravating you need dozens if not hundreds of nails, bolts and bobby pins, which means you are unpacking for an hour of two if you do it all at once. Again, this is work, not fun. Further, your first base will likely be made with primitive gear, which means a simple 2x2 can take hours. Not very much is intuitive either, so it can be VERY frustrating. There are even keyboard commands that arent shown on the keybindings, which should piss anyone off. Because of this the game ultimately feels like the devs don't respect the players time which explains why the game is on life support.In my experience official servers are more toxic than Rust official. The main reason is feuding. Some people hold grudges in rust, but the reality is that in rust there is usually such a high pop that are all doing the same thing, that people forget because in 30 minutes it happened again 2-3 times. Sometimes it goes further but I have yet to hear about long time players holding a grudge more than a day or two without a specific reason, like racism etc. Scum servers have to be smaller, so people will try to punish you specifically often. While this can be fun if it is a friendly competition, most people who are new don't want to deal with that. Ever have someone find all your bases and only raid you and constantly hunt for specifically you, before you were really established? I have it sucks, and there was literally nothing I could do. I was prim, and he had rifles. Why? apparently I built my first base too close to him, but I had no idea where he was. Maybe 2 hours in on my first time loading.The actual gameplay is great, the animations are really good, plenty of things to do if you just want to learn playing solo. I do find the shooting to be the most accurate to real life than in any game I have ever played, with there being a bullet rise before drop, windage etc. So sniping can be really complicated compared to most other games, and in one case I hit a friend in the head with a shot at over a grid away. Unfortunately most servers wont have draw distance that high, but hey that happened and it was awesome. The hunting is incredibly hard, and the best way I can describe it is like spot and stalk irl, which isn't practiced a lot, and is quite difficult, harder than irl to be honest. Anyone who hunts knows hunting is not easy either. The fishing is fun. PVP is fast, as in incredibly fast. 1-2 shots and it is likely over, and even if you win, you could still die from the injury or infection. That is why server pops can not be too high.  The game can be very fun after the learning curve, and there are many people who are helpful, and nice (relatively speaking, don't ask where their base is and they wont say goodnight). The online tutorials are ok, but until you figure it out do yourself a favor and start on a pve server. The game is immensely different than any other I have found, and you will need time to acclimate to it\t\t\t\n", "\n\r\n\t\t\t\t963 people found this review helpful24 people found this review funny\t\t\t\t65\n\n\n\n\n\n\nNot Recommended\n285.0 hrs on record\n\n\n\n\nPosted: 14 February, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\ti've loved this game for years now, but i just can't enjoy it for what it was meant to be, and isn't:  a survival game.the devs listen to everyone, and i think they've been led astray by pvp junkies and looting fanatics.when the game started it was about immersion into the landscape, skills, camo, finding food and encountering other players.it was spellbinding, and i'd creep through the map for hours, building my skills and exploring, with the occasional pvp in a mostly-pve experience.but then we got cars because people don't like to spend time walking.of course all the squads got the cars and locked them away.then we got high loot servers and new weapons and points made in private pvp meant that killed players in squads could respawn literally 100m from the battle, and just re-join.and then squads got name tags.name tags did it for me.as a solo players against 3 others who can see each other on the map, while i can't, in a game that's supposed to be about SURVIVAL?sorry, that's a nope.now it's about squads, that's all.the solo bushmaster doesn't stand a chance.\t\t\t\n", "\n\r\n\t\t\t\t275 people found this review helpful7 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nNot Recommended\n474.7 hrs on record\n\n\n\n\nPosted: 17 December, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tShort version: Do not buy this game, it is full of bugs and missing a ton of features at the moment. Plus as of 12/14/2022 Gamepires was purchased by Jagex of Runescape fame. The future of SCUM is null, as Jagex revealed back in June 2022 their plans for a survival game set in the Runescape universe, what better investment than purchasing a company that already did all the work for you? https://www.nme.com/news/gaming-news/jagex-is-making-an-open-world-survival-game-set-in-runescape-universe-3254915Long version: SCUM used to be a good game, it had a ton of things to do and the devs continuously kept adding content to the game. You could play PvP, or go solo and even single player and have a more laid back experience crafting, cooking, hunting, building a base, fishing, etc. There were all kinds of vehicles to explore the map and it was a freaking fun game.Unfortunately the devs have been taking features away, there were planes - gone, there were bikes - gone, there was a city you could explore – gone, there were cars, tractors, quads - all gone, even the birds are gone now. See, you used to be able to play SCUM the way you wanted, and you earned Fame Points for every action you did (it is supposed to be a game show after all), which were then used to respawn, from lower FP cost to respawn randomly on the map, to high cost to respawn at your shelter/base. With update 0.8 the devs introduced many new bugs and a money and gold system tied to respawn, basically SCUM is forcing you to play one way only if you want to have a chance to respawn and keep your character.What a game of SCUM is now:1. run around and loot2. once you have enough loot, run around to find a trader and sell your stuff3. run even more to find a bank or ATM to deposit the cash in your bank account4. repeat 1 to 3 until you have enough to respawn (min $250 for a random spawn far away from your base)5. repeat 1 to 4 to have enough cash to buy gold for an even better respawn choice:From the store page:- random respawn $250- sector respawn $1000- shelter respawn 1 gold unitOh and did I mention there are only 5 traders on the whole map? And if you are lucky to find that one modular car they added back, you will have to fix it first then push it all the way to a trader anyway to put in an engine. Enjoy that long walk.Now, maybe some folks like to do this, but that is not what SCUM was, yet with update 0.8 the devs also had the brilliant idea to introduce PERMADEATH! Meaning that after 10 deaths (or if you reach -$2500) your character will disappear forever. So leveling your skills no longer means anything if you do not first run around looting to gather enough funds to keep your character alive!After four years spent in Early Access the game still has many issues and definitely got worse this year, removing the vehicles was a major blow to playability. Yet the devs decided that the introduction of a banking system was a top priority. Which makes perfect sense if the game was ready to introduce a microtransaction system where cash for in game gold would guarantee you would never lose your character. Which brings me to this: as of 12/14/2022 Jagex aquired Gamepires. What means financial salvation for the indie studio also brings a sense of dread for us early adopters of SCUM. We all know Runescape and the microtransaction galore of its store page. Yet here we are. More worrying still is that bringing up the topic of the acquisition in the forums gets you warnings (for trolling, offensive content and spam), and the discussions get promptly removed, as if the topic was absolute taboo to talk about. As of 12/17/2022 date I am posting this review the acquisition is not even announced on SCUM’s store page. Draw your own conclusions as to what it means for SCUM’s future, as Jagex is actively working on its own survival game set to be ported to consoles, and is hiring a whole team for this project. My guess is Jagex will let Gamepires release a bare bone 1.0 version of SCUM in 2023, or 2024 if they want all the skills systems up and running, before shutting down the studio and moving all the assets to their main Cambridge location (where new Jagex hires are located). Why keep a small 50+ team in Croatia when the new project will be based at their 400+ employees location? So to conclude, SCUM had its prime time, but it is passed now and in light of the recent events, it will definitely not come back. Sad but true.EDIT 12/18/2022: As others and myself have mentioned in their reviews, criticizing the game, the update or mentioning the Jagex purchase on forums will get you warnings. As of the time of this edit I am now BANNED from posting in the Steam discussion boards! LOLEDIT 12/30/2022: After the temporary ban above I came back to the forums to find out that whenever I post any comment it gets promptly removed by the mods. Meanwhile the very same mods allow openly hostile and insulting pro SCUM players to thrive and attack those who dare to criticize the game or its features. The few players remaining (9K as of today) are becoming increasingly more toxic, better to avoid them altogether.Edit 1/19/2023: So about two months after 0.8 many people are still complaining about the lack of vehicles and utter failure of the two news cars reintroduced in the game (no engines available at traders, etc). Devs keep saying “we are working on it” yet they are getting pretty shaky about the loss of players as they even released a Twitter poll asking what the players want: https://twitter.com/dedaPong/status/1612757942394036224 But as always, bring up the issue (or any other problem really) on the discussion boards and you will be treated to some quality feedback by delightful people (always the same peeps BTW, mods let them freely harass others):“- If developers would listen to everything players ask for, then we will have not a game but an unplayable hoax. - slow down and be carefull.......the vehicles are fine stop making these crybaby threads - Or you can indeed adjust your driving temper, this is not difficult at all. - Dunno why everyone is crying. New cars work great for me. - Everybody is crying because they love to whine - A few people responding to a twitter poll is not the majority of players.A few people coming to the forums and asking for the old ride backs is not a majority of players. - I can't play! I wanna play....crying... :D - You're not supposed to hit a stone. Do not drive without a license. Learn how to drive.”The wonderful SCUM community... Edit 02/09/2023: the sad upcoming future of Gamepires has been added to the my review, the question is: when will Jagex pull the plug on Gamepires? TBD...\t\t\t\n", "\n\r\n\t\t\t\t235 people found this review helpful145 people found this review funny\t\t\t\t17\n\n\n\n\n\n\nRecommended\n517.5 hrs on record\n\n\n\n\nPosted: 29 October, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tIf you work, you are not suitable for this game. But if you are unemployed, it is recommended to play.\t\t\t\n", "\n\r\n\t\t\t\t1,087 people found this review helpful41 people found this review funny\t\t\t\t175\n\n\n\n\n\n\nNot Recommended\n3,517.1 hrs on record\n\n\n\n\nPosted: 18 December, 2022\nEarly Access Review\r\n\t\t\t\t\t\t\t\tRead this if you want the real deal opinion, no sugar coating, and no dev butt sucking.  I'll praise them where it's due and criticize them when its warranted.I installed this game awhile back when it was still killing you for touching water.  I installed again about 3 months ago during the peak of 0.75 release.  I was hooked.  Sure, there were bugs that would be frustrating at times but it was rare enough for me that I could deal with it personally as a dedicated gamer.   I got involved in the Scum community forums and pages, keeping up with the Dev's work and progress on 0.8.  They went as far as including the community and reaching out, getting polls, consensus of which models looked best for the Base Building, etc.  That added A LOT of hype to the upcoming 0.8 release.  Advertised farming, implied we would be getting 2 modular vehicles(car and a truck), implied animal taming \"might\" happen with the 0.8 release, boasted the Nuclear Power Plant POI and it's new features VERY HEAVILY.  In fact that was the main thing they seemed to be pushing with the new update and not so much the game changing mechanics of modular vehicles, base building, farming, etc.  Everybody was H-Y-P-E-D.  I'm emphasize that because the dev's and community admin's pushed this 0.8 update like it was the new flavor of the day and it was going to CHANGE SCUM YET AGAIN!  and FOR THE BETTER!  right?.....right?....bueller?.....Then D day happened.....0.8 dropped a nuclear BOMB on the ENTIRE community..and NOT IN A GOOD WAY EITHER!!!!!!!Let's run a few things that did and didn't happen with the 0.8 release.We got the nuclear power plant poi and the features with that.  STOP.  This is the only GOOD thing I've seen added to this update in my honest opinion.  The Dev's put ALL their eggs in one basket with this added location.  It came out AMAZING....but then...they wanted to mess it up with HOTFIXES.  So now you can't run in a hazmat suit, hazmat lockers and medical lockers with phoenix tears can no longer be forced, you have to actually pick them now, after burning through 6 40/40 use screwdrivers and not unlocking a single one ive said screw it.  screw that poi, screw the issues with radiation and screw that POI.  I'll just avoid that entire area the rest of my life now because they've made it too much of a pain in the ass to visit regularly that it's not even beneficial as far as loot goes so other than my initial one time there in single player spawning my own gear to get in, I won't be back anytime soon.Other 0.8 surprises and changes:Animal Taming - NOSCAR - NOFarming - BROKEN,  I had a 25 plot planter on a 10x Max loot server,  out of the 25 plants(cherries, potatoes, tomatoes, garlic, apples.  It took me several days to get them to be \"ripe\" and even then, total items collected over several days and COUNTLESS searching after restarts and loot respawning  (5 potatoes, 3 garlic).  That's it.  Never got an apple, or cherry, or tomato, and then they DIED.  No point in farming til u can actually get produce off your plants.  Otherwise, it's just for FUN!  CUZ GROWING PLANTS TO GET NOTHING IS FUN AMIRITE?!Base Building - Meh, semi-broken but with the amount of resources needed to upgrade each piece of your base individually, you'll spend days upgrading to just brick which can easily be destroyed with only 1 C4, and that's not even the last tier!  For perspective, I have a 2 story 3x3 base on the edge of the water with a very small yard by comparison to flag range, walled in.  I've made 3 runs to Brick Factory, Gravel yard, junkyard AND cement factory over 3 days and just NOW got my building to brick and have yet to upgrade the external walls beyond metal.  This is on a 10x MAX LOOT server.  Imagine trying to upgrade your base on a low loot or hell.....even a vanilla server.Cars - Well let's see.  We had 3 diff types of planes, 2 diff types of boats, 2 diff types of bicycles, several types of motorcycles,  1 quad(four wheeler), an suv, a pickup truck, and a tractor...with diff color variants of the quad, motorcycles, pickups and suvs during 0.75.  They removed EVERY SINGLE VEHICLE FOR THE UPDATE... with 0.8 we didnt even get the truck, we only got a half broken red dinky janky \"wolfwagon\" hatchback that for the last month has been nothing but a pain in the ass for players.  Glitching, random despawning through the map, flipping the car on its side and roof with the only way to fix is either RAM it with another car or have somebody throw their body into your tires.....oh...but you have to STAY in your vehicle until that happens otherwise the car is dead in its tracks and you cant move it once you exit.  So if you get stuck, unless an admin, or another player decides to help you.  You're f*cked.   Oh but we also got a boat too still, which likes to disappear randomly and people could still steal it for weeks after the update even if it was locked.   Oh, and let's not forget to mention the dev's have HARD CODED a 100 VEHICLE limit per SERVER map, so if an admin spawns car 101, the oldest one despawns off the map....hence why most of your cars are despawning randomly...that or theyre falling through the map still.  The SCUM Community had a meltdown.  We still are in fact.  Tomislav and the rest of the dev's don't appear to give 2 sh*ts anymore because NEWSFLASH:  JAGEX NOW owns Gamepires.  Yup...you read that right.  The company who bought Runescape and monitized it to Micro TX hell.  Every hotfix since the 0.8 update has only removed bugs that benefit players and nothing to fix the actual issues with the major issues players are experiencing.Server restart times:   Prior to 0.8, the server I play on was doing 2 hour restart times.  Restarts would take 2 minutes before being able to relog back in.  Now....it's 10 minutes and we can't even get 30 minutes into a restart before everybody starts rubberbanding and lagging on a 70/70 server.I get that it's in OpEn BeTa however, you can look up in the release date....2018....5 f*cking years almost and they haven't hit 1.0 yet.  It's almost as if they dragged their feet long enough waiting for a company like JAGEX to acquire them.  One of the problems the community is facing now is suppression of our outrage.  Any forum(Discord, FB, Reddit, etc) that has community input are deleting NEGATIVE comments and REVIEWS about this game and update that players are making to try and HIDE the fact that this game is a hot pile of trash right now.  They're protecting the Dev's and don't want bad publicity on a major FAILED update.  This game has a lot of potential and before the 0.8 update, was extremely fun to play.  I advise anybody looking to purchase this game right now.  DON'T.  Don't support these dev's right now because they def are coming across like they aren't listening or supporting the community right now.  Wait til 0.9...Hell wait til 1.0 and see how good or bad JAGEX makes it before buying, the price might go up 10 or 20 bucks but you'd be happier with your purchase THEN, than the feeling of wasting 35 bucks you'd be spending NOW on a broken game.  Dev's need to stop going out and drinking all the time, posting pics on social media of their shenanigans and get to fixing their product.  Hell, I'd have much more respect for them right now if they were to roll back to 0.75 and apologize to the community for this trainwreck rather than the current catastrophe that's occurring with this game.\t\t\t\n"]