["\n\r\n\t\t\t\t746 people found this review helpful66 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nRecommended\n67.9 hrs on record\n\n\n\n\nPosted: 29 April, 2020\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLoved it so much I showed my wife.She loved it so much she bought her own copy. This was her first videogame.She loved it so much she spent over a 100 in-game hours trying to learn how to play videogames.She loved it so much she, the person who rage quits Little Big Planet, stuck with it until she beat the game. Twice.10/10 would give anything to find another game like this for me and wife.\t\t\t\n", "\n\r\n\t\t\t\t9,547 people found this review helpful152 people found this review funny\t\t\t\t1\n\n\n\n\n\n\nRecommended\n63.7 hrs on record\n\n\n\n\nPosted: 11 June, 2017\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThis piece of art right here?Game of the year for someone like me who loves platformers, a great soundtrack, and is a big fan of Metroidvania style games? Oh yeah.Game of the year for everyone else? Maybe!Let me tell you some things about this game:+Offers a lengthy adventure (I completed 100% in 28 hours and there is still more I could do if I wish)+The combat is so tight! Not only are the mechanics themselves simple and crisp but they are also super deep with things like charms which you can equip to give certain abilities and other classic staples in these types of games like a dash / double jump / wall jump+The controls are very fine tuned and it always feels like it was my fault if I died and not simply poor game design+The bosses are sick AF and they all have really cool moves / patterns / styles to them+The game manages to never feel linear at all, it has no direct markers telling you where to go it simply throws you into the world (Hallownest it is called) and leaves the exploring up to you+The Soundtrack is bomb. These indie company hits lately always offer a memorable and groovy soundtrack and this game is no different. It offers a few solid themes for many of the fight scenes as well as beautiful atmospheric soundtracks which fit the areas so nicely+Oh and did I mention the game looks beautiful? Go check images of this game right now like the area \"The City of Tears\" and just marvel at the amount of detail put into the scenery. For a game this big the art style and attention to detail is truly impressiveMy real only problem with this game is not even so much a problem at all as it is a warning: to those of you out there on the more casual end who may struggle with difficulty in this genre you have been warned! While the game is mostly pretty forgiving with save points in most general areas I will say some of the combat gets pretty tough. For someone like me I enjoyed it thoroughly as I felt the difficulty was just the right amount and it never felt cheap or unfair.Fot those out there who aren't as into these type of games as much I feel Hollow Knight is a great game to start you into the genre. The price is very reasonable, and it seems the devs are going to continue adding more content which is hype. Give it a try, You won't be dissapointed!\t\t\t\n", "\n\r\n\t\t\t\t418 people found this review helpful5 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n206.1 hrs on record\n\n\n\n\nPosted: 5 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI would do anything to play this again for the first time.\t\t\t\n", "\n\r\n\t\t\t\t1,234 people found this review helpful92 people found this review funny\t\t\t\t87\n\n\n\n\n\n\nRecommended\n117.7 hrs on record\n\n\n\n\nPosted: 30 March, 2021\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t~ DIFFICULTY ~🔲 My 90 year old grandma could play it🔲 Easy🔲Normal✅ Hard🔲 Dark Souls~ GRAPHICS ~🔲 MS Paint🔲 Bad🔲 Meh🔲 Graphics dont matter in this🔲 Good🔲 Beautiful✅ Masterpiece~ MUSIC ~🔲 Bad🔲Not special🔲 Good✅ Beautiful~ STORY ~🔲 This game has no story🔲 Like playing Temple Runners for the story🔲 It's there for the people who want it🔲 Well written🔲 Epic story✅ Imagine Kingdom Hearts but on crack~ PRICE ~Underpriced✅ Perfect Price🔲 Could be cheaper🔲 Overpriced🔲 Complete waste of money~ REQUIREMENTS ~🔲 You can run it on a microwave/toaster✅ School computer🔲 Average🔲 High end🔲 NASA computer~ LENGTH ~🔲 Extremely Short (60 minutes or less)🔲 Very Short (1 - 3 hours)🔲 Short (3 - 15 hours)🔲 Average (15-50 hours)✅ Long (50-90 hours)🔲 Extremely long (90-110 hours)🔲 No ending~ FUN ~🔲 I'd rather watch paint dry🔲 Hard to enjoy🔲 Repetitive🔲 Actually pretty amusing✅ Ride of your life~ REPLAYABILITY~🔲 Wasn't worth completing🔲 It's a one-time experience🔲 Only for achievements🔲 If you wait a few months/years🔲 Definitely✅ Infinitely replayable~ WORTH BUYING ~🔲 Remove this from the steam store🔲 No🔲 Wait for sale🔲 Yes✅ You NEED to experience this game\t\t\t\n", "\n\r\n\t\t\t\t691 people found this review helpful95 people found this review funny\t\t\t\t42\n\n\n\n\n\n\nRecommended\n36.0 hrs on record\n\n\n\n\nPosted: 26 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠶⠀⠀⠀⠀⠀⣈⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⡿⠋⠀⠀⠀⠀⠀⠹⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣤⣤⣴⣤⣤⣄⠀⢠⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⠋⠈⢻⣿⡝⠁⠀⢻⣿⣿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣄⣠⣿⣿⣧⣀⣠⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⡿⠟⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣷⡾⠿⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⡿⠓⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣀⡀⠀⠀⠀⠀⠀⠀⣰⡟⠉⣼⣿⠟⣡⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣤⡀⠀⢠⣿⠀⠀⣿⣿⣾⠿⠛⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡛⠻⠑⡀⠈⣿⠀⡼⢿⡏⠀⠀⠀⠹⣿⡆⠉⠻⣿⣿⣿⣿⣿⡻⢿⣿⠷⠞⠁⠀⢸⠇⠀⠈⡇⠀⠀⠀⠀⠘⢿⡄⠀⠸⡏⠀⠀⠉⡇⠀⠹⢦⡄\t\t\t\n", "\n\r\n\t\t\t\t553 people found this review helpful181 people found this review funny\t\t\t\t25\n\n\n\n\n\n\nRecommended\n168.4 hrs on record\n\n\n\n\nPosted: 5 July, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t⠀⠀⠀⠀⠀⠀⣖⢤⡀⠀⠀⠀⠀⠀⠀⠀⡐⠣⡄⠀⠀⠀⠑⡄⠙⠆⠀⠀⠀⠀⠀⠀⡇⠘⢄⡄⠂⠉⠀⡀⠀⢸⠀⠀⠀⠀⠀⠀⢃⡐⠁⠀⠀⠀⠀⠀⠀⡼⠆⠀⠀⢀⣴⠂⠀⢁⠀⠀⣠⡀⠀⠀⠀⠀⢸⢀⣴⣿⠏⠀⠀⠈⣿⡄⢹⣿⡄⠀⢀⡀⢠⣿⣿⠏⠀⠀⠀⠀⠈⢇⠀⢉⣥⣾⣿⣷⣿⣿⠏⠀⠀⠀⠀⠀⠀⠀⣽⣿⣿⣿⣿⣿⣿⣯⠱⡀⠀⠀⠀⠀⠀⠀⠙⠋⢻⣿⣿⣿⣿⣿⡄⡇⠀⠀⠀⠀⠀⠀⠀⠘⣼⣿⣿⣿⣿⣿⣷⡇⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿⡿⠛⡿⣿⡇⡇⠀⠀⠀⠀⠀⠀⠠⠟⠋⠀⠈⠂⠌⠺⠇⠀⠀⠀112% BABY!!!!\t\t\t\n", "\n\r\n\t\t\t\t457 people found this review helpful171 people found this review funny\t\t\t\t33\n\n\n\n\n\n\nRecommended\n153.7 hrs on record\n\n\n\n\nPosted: 20 August, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t*sigh* Bapanada\t\t\t\n", "\n\r\n\t\t\t\t502 people found this review helpful271 people found this review funny\t\t\t\t28\n\n\n\n\n\n\nRecommended\n74.7 hrs on record\n\n\n\n\nPosted: 28 December, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tno benches?⠀⠀⠀⠈⢿⣿⣿⣿⣿⡿⠿⠿⠿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀ ⠈⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠉⠉⠉⠛⠻⠿⣿⣿⣿⣿⣿⡿⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀‏‏‎⠀⠀⠀⠀⠀⠀⠀⠉⠛⡿⠋⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀‏‏‎⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⠀⠀⠀⢀⡠⠂⠀⠀‏‏‎⠀⠀⠀⠙⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣀⣠⣤⣶⣾⣿⡀⠀⠀⠀⠀‏‏‎⠀⠀‎⠀⢈⣿⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⠀⣿⣿⣿⣿⣿⣇⠀⠀⠀‏‏‎⠀⠀⠀⢠⣾⣿⣿⣿⣷⣦⣀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⡆⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⡇⢹⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣷⠀⠙⢿⡿⠛⠀⠀⠀⠀⠀‎⠀⠀⢹⣿⣿⣿⣿⣿⡟⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⣿⣿⠿⠋⠀⠀⠀⣼⡿⢿⠙⢿⣿⣿⣿⣿⣿⡷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀‏‏‎⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠞⠉⠀⠈⢠⣼⣿⣿⣿⣿⠏⢰⣿⣶⣄⡀⠀⠀⠀⠀⠀‏‏‎⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣿⣄⢠⣶⣿⣿⣿⣿⣿⣿⣿⢠⣿⣿⣿⣿⣿⣶⣦⣤⣀⣀⣀⣀⣀⣀⣠⣴⣾⣿⣿⣎⠈⣿⣿⣿⣿⣿⣿⣿⣿⠘⣫⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡞⣿⣿⣿⣿⣿⣿also feels like steeling for how cheap and how much content is in the game\t\t\t\n", "\n\r\n\t\t\t\t439 people found this review helpful148 people found this review funny\t\t\t\t37\n\n\n\n\n\n\nRecommended\n45.9 hrs on record\n\n\n\n\nPosted: 1 July, 2022\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYou are bug. Kingdom of bugs. Fight bugs. Find bug secrets. Make bug friends. Kill mean bugs. Be strongest bug. Kill bug god. Bapanata.\t\t\t\n", "\n\r\n\t\t\t\t314 people found this review helpful9 people found this review funny\t\t\t\t5\n\n\n\n\n\n\nRecommended\n564.8 hrs on record\n\n\n\n\nPosted: 11 December, 2018\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYes, you're seeing it correctly. I have 300+ hours* on this game.That being said, I played through about 250 of those hours, and I can confidently say that this is, and might always be, my favorite game.I'll start with the cons:- There is a LOT of roaming around and exploration in this game. Although this can appeal to some people, it can definitely make you feel lost and a little frustrated trying to find out where to go (especially after Greenpath, at least for me).- Many, many points in the game where you'll get stuck for literal hours trying to get past. If you tilt easily or are an ardent completionist, you might have a bad time. You will probably never get to the Land of Storms.- Sometimes, the movement mechanics can feel really unfair, especially at the most difficult platforming sections (WHY DOES MONARCH WINGS SEND YOU DOWN FIRST!?), although I think learning and mastering the mechanics is all just part of the game.- Although I've never played Dark Souls (I'll get to it eventually), I've heard that this game's story feels very similar. Not sure how this is a con, but felt that it was important to mention.- Will destroy your Mac's battery. Seriously.Now time for the pros. I'll admit I'm a little biased, but I think there's a reason this is my favorite game.First of all, this game is massive. My first 112% of this game took me a little under 100 hours, if not actually 100 hours. Now, every other playthrough of this game that I've done took me significantly less time, but considering that this game was made by a team of three people and that this game is a quarter the price of Dark Souls, I'd say that the amount of content in this game is remarkable. And that content isn't filler content. Few rooms in this game are. Almost every room will have something new in it, either a new enemy, a new mechanic/upgrade, a piece of the story, or a secret. Since its initial release, three free content packs have come out, along with one \"major update,\" with a paid DLC coming in 2019**. Every one of the content packs released so far has had so much new content, including some of the most difficult bosses in the game. Hidden Dreams came out with bosses that, if beaten enough, can kill you with a single blow. The Grimm Troupe arrived with a dream variant on a new, already-difficult boss that took me over three hours of attempts to beat, along with the hardest platforming that you might ever come across. Finally,  Gods and Glory  Godmaster arrived, adding a bossrush mode, exciting variants on old bosses that made them even more difficult, two more endings, and a boss that easily overthrew the Grimm Troupe boss as the hardest enemy this game has to offer.Speaking of enemies, the bosses are tough, well-designed, and the learning curve for them is quite good. I can say that I can count the number of bosses that I actually disliked on one hand, and that's being pretty harsh for a few of them. And there are so many, and so many variants! The atmosphere of this game is incredible. The music is perfect, the color pallet for everything in each area is spot on, and they all contribute a part to the amazing story. So immersive and so fleshed out. It looks and sounds so good (bless you, Christopher Larken, bless you).The story is developed through the game so well. At first, the story seems to be very baseline, just little bits of lore to piece together. You don't even know who your character is, although you just assume you're the Hollow Knight. But slowly, you learn about the devastating events that eventually leads to this beautiful world's demise. There are five endings, and once you learn that there was more to do in order to fix this broken kingdom, you feel compelled to keep going.It amazes me how relatively unknown this game is. It's so incredibly cheap for what it gets you, and is one of the richest worlds you will ever dive into. You'll become a much better player just by getting through the game, and you're likely to love nearly every moment of it. This is the only game that I've encountered that has significant portion of its player base sad that they didn't pay MORE for this game in order to support the developers. An amazing world with an even better soundtrack, I highly recommend this game above all others.Updates:*whoops looks like I made it to 400+.**So turns out that Team Cherry, the genius company behind this game, decided not to make the DLC... THEY'RE INSTEAD MAKING AN ENTIRELY NEW GAME IN ITS PLACE. This is also a pro for buying the game. SUPPORT THIS AMAZING COMPANY.\t\t\t\n"]