["\n\r\n\t\t\t\t1,019 people found this review helpful19 people found this review funny\t\t\t\t128\n\n\n\n\n\n\nRecommended\n110.0 hrs on record\n\n\n\n\nPosted: 26 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBeen fun beating up fuzzy little goobers.beardbox – Kiko character skinjoshandkato – Kato character skinUse these 2 codes to redeem in game skins, I'll continue to update my review with more codes as they drop.Edit 1: Discord Nitro users should be prompted with a \"claim gift\" prompt, this gives you an exclusive Nitro Skin & in game bucks.\t\t\t\n", "\n\r\n\t\t\t\t354 people found this review helpful192 people found this review funny\t\t\t\t25\n\n\n\n\n\n\nRecommended\n5.5 hrs on record\n\n\n\n\nPosted: 3 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe cutest sweatlord PvP game. I've never wanted to strangle a cute white bunny who kept throwing me over the side so much in my entire life!\t\t\t\n", "\n\r\n\t\t\t\t384 people found this review helpful273 people found this review funny\t\t\t\t10\n\n\n\n\n\n\nRecommended\n51.6 hrs on record\n\n\n\n\nPosted: 10 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI kept asking if my mic was on until a 13 year old screamed like a goblin, 10/10\t\t\t\n", "\n\r\n\t\t\t\t1,317 people found this review helpful21 people found this review funny\t\t\t\t115\n\n\n\n\n\n\nRecommended\n21.7 hrs on record\n\n\n\n\nPosted: 20 September, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI think everyone who is displeased about the offline play has a right to air their grievances.  All the negative reviews had me quite concerned about whether I should buy the game.  However, I'm glad I did and the game deserves a lot of credit.  It does almost everything right.  I was able to play local co-op with my daughter with no issues.  The gameplay is smooth, fun, sound and graphics are quite good and so far I've been very impressed with map variety.  AI is at least as good as Gang Beasts.  I'm glad I decided to buy, and for me the lack of offline play and the microtransactions are non issues and it does not effect my experience.  I don't plan on paying for microtransactions (unless they release a frog, then I might drop some cash).  I've only played custom games with local co-op and have had no issues with lag.    As a fan of Gang Beasts, Boomerang-fu, Stick Fight the Game, Rounds, A Gummy Life - I can recommend this game.\t\t\t\n", "\n\r\n\t\t\t\t156 people found this review helpful58 people found this review funny\t\t\t\t21\n\n\n\n\n\n\nRecommended\n13.7 hrs on record\n\n\n\n\nPosted: 12 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tI enjoy this game as much as the next person. I enjoy throwing paws with my friends. That is if I had any. However, there is one thing that I wish the game had. An opossum character to play as. They would be the perfect animal to add to this game and I await their addition. This is not a request, it is a demand and a threat. You will catch these paws otherwise.\t\t\t\n", "\n\r\n\t\t\t\t779 people found this review helpful12 people found this review funny\t\t\t\t31\n\n\n\n\n\n\nNot Recommended\n7.5 hrs on record\n\n\n\n\nPosted: 4 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFun game to play with online friends (not really a local co op party game), but too pricey for what it is. Especially when considering the heavy microtransactions and gatcha mechanics. Sell at a expensive price, or go f2p with microtransactions. Rage against double dipping in all games!\t\t\t\n", "\n\r\n\t\t\t\t1,940 people found this review helpful109 people found this review funny\t\t\t\t49\n\n\n\n\n\n\nNot Recommended\n12.8 hrs on record\n\n\n\n\nPosted: 11 October, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor the love of god remove the punishment for leaving games, i got a 2 minute timeout for cancelling the QUEUE, thats ridiculous. I wasnt in a game, i just cancelled matchmaking. What an incredibly stupid system for a game that isnt even competitive\t\t\t\n", "\n\r\n\t\t\t\t1,441 people found this review helpful29 people found this review funny\t\t\t\t82\n\n\n\n\n\n\nNot Recommended\n0.3 hrs on record\n\n\n\n\nPosted: 16 October, 2023\nProduct refunded\r\n\t\t\t\t\t\t\t\t\t\t\t\tDev's promoted this game as including the ability to play online as well as offline with friends.They then released the game with online-only, blamed their user base for taking their own Steam page description at face-value, then doubled-down saying they never intended and will not provide an offline mode.The Dev's lack of taking responsibility and instead blaming the community doesn't sit right with me, which is the primary reason I refunded the game.I will recommend the game once I see evidence the Dev's are listening to, and more importantly, catering to their user base.\t\t\t\n", "\n\r\n\t\t\t\t823 people found this review helpful35 people found this review funny\t\t\t\t56\n\n\n\n\n\n\nNot Recommended\n47.0 hrs on record\n\n\n\n\nPosted: 14 November, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLucky coins should always result in a skin that you don't have. Duplicates should not be possible. I do not support gambling so my review will stay negative until the GACHA mechanic is removed.\t\t\t\n", "\n\r\n\t\t\t\t703 people found this review helpful365 people found this review funny\t\t\t\t106\n\n\n\n\n\n\nRecommended\n4.1 hrs on record\n\n\n\n\nPosted: 5 December, 2023\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tGot me laid\t\t\t\n"]